Config = Config or {}
Config.DramaChatData = Config.DramaChatData or {}
Config.DramaChatData.data_info_length = 32
Config.DramaChatData.data_info = {
	[10060] = {
		name = "英勇之弓",
		height = 1196,
		id = 10060,
		title = "精灵族的王子",
		bid = 1,
		condition = {},
		content = {
			{
				3,
				"",
				"一个矫健的身影在卡莉法间的树上跳跃着，飞快前进，见到修罗和娜美时突然停了下来，犹豫了一秒钟，来到他们面前的一棵树上。"
			},
			{
				3,
				"",
				"是一个背着弓箭，长着尖耳朵，身穿皮甲，两眼放光的精灵族青年……"
			},
			{
				3,
				"加布拉",
				"这位美丽小姐你好啊~"
			},
			{
				3,
				"娜美",
				"额，我认识你吗？"
			},
			{
				3,
				"加布拉",
				"以前不认识，但现在认识了。"
			},
			{
				3,
				"加布拉",
				"请允许我自我介绍下，我是来自乌尔黎的加布拉，擅用弓箭，英俊是我的弓，勇敢是我的箭~"
			},
			{
				3,
				"娜美",
				"#4#4#4"
			},
			{
				3,
				"娜美",
				"真想一把火把你给烧了！"
			},
			{
				3,
				"加布拉",
				"诶诶诶，别这么大火气嘛~一看你们就是第一次来伟大航路。"
			},
			{
				3,
				"加布拉",
				"就算对我不感兴趣，总该对这里的路感兴趣吧~"
			},
			{
				3,
				"娜美",
				"小瑟，我们走了~"
			},
			{
				3,
				"加布拉",
				"就算对路不感兴趣，总该对圣器感兴趣吧！"
			},
			{
				3,
				"娜美",
				"等等，你说圣器？这倒有点意思。"
			},
			{
				3,
				"修罗",
				"你们说的圣器是什么？"
			},
			{
				3,
				"加布拉",
				"神魔兵……咳咳，圣器你都不知道？你还是不是这个世界的人了？！"
			},
			{
				3,
				"修罗",
				"你怎么知道我不是这个世界的？"
			}
		}
	},
	[10180] = {
		name = "英勇之弓",
		height = 1295,
		id = 10180,
		title = "圣器传说",
		bid = 1,
		condition = {},
		content = {
			{
				3,
				"",
				"站在树上的加布拉听到了修罗的回答， 脚底一滑，差点一头栽到了地上。"
			},
			{
				3,
				"加布拉",
				"你你你……认真的？"
			},
			{
				3,
				"娜美",
				"真真假假我就不知道啦，不过我倒是亲眼看到了这货从天上掉下来~"
			},
			{
				3,
				"加布拉",
				"好吧好吧，圣器我都见过了，就算天上掉个神下来也没什么好惊讶的了。"
			},
			{
				3,
				"加布拉",
				"至于圣器呢，是存在于传说中那个神之纪元的东西，拥有媲美神的力量！"
			},
			{
				3,
				"加布拉",
				"神族拥有枪、盾、腕三件圣器，以此为尊，后来，魔族最为强大的香克斯率领魔族攻打神界。"
			},
			{
				3,
				"加布拉",
				"神族以三件圣器抵御魔族，并最终取得了胜利，还获得了战利品：魔族的三圣器，弓、斧、锤！"
			},
			{
				3,
				"修罗",
				"这么说的话，我怎么没见过神呢？"
			},
			{
				3,
				"娜美",
				"笨，都叫传说啦，逝去了的才能称之为“传说”！"
			},
			{
				3,
				"加布拉",
				"没错！这位魔法师小姐真是聪慧过人！"
			},
			{
				3,
				"",
				"加布拉说着，语气似乎夹杂着说不清的情绪。"
			},
			{
				3,
				"加布拉",
				"传说所以为传说，就是因为我们已经无法触达他们……"
			},
			{
				3,
				"加布拉",
				"据说那之后，神族内部对六件圣器的处置方式发生了分歧，最终爆发了内战。"
			},
			{
				3,
				"加布拉",
				"圣器不知所踪，神族两败俱伤，并最终走向了灭亡。"
			},
			{
				3,
				"娜美",
				"那你又说知道圣器的下落？！"
			}
		}
	},
	[10300] = {
		name = "英勇之弓",
		height = 752,
		id = 10300,
		title = "使命结束",
		bid = 1,
		condition = {},
		content = {
			{
				3,
				"",
				"加布拉嘴角微微上扬，似乎在得意着什么。"
			},
			{
				3,
				"加布拉",
				"虽然，传说中圣器不知所踪……"
			},
			{
				3,
				"娜美",
				"但是……"
			},
			{
				3,
				"加布拉",
				"诶~但是！前几天我发现了圣器，就在伟大航路的最东方！"
			},
			{
				3,
				"娜美",
				"既然发现了圣器的话，你怎么不直接把它带走，还要来告诉我们？"
			},
			{
				3,
				"加布拉",
				"因为……那里似乎有一道屏障，我没办法通过，应该是圣器会认主的原因。"
			},
			{
				3,
				"娜美",
				"好吧，就暂且相信你一次，我们过去看看。"
			},
			{
				3,
				"加布拉",
				"那我就先走一步了，反正注定没办法获得圣器的认可，还不如继续我的逍遥精灵生去~"
			},
			{
				3,
				"加布拉",
				"（内心）终于等到了传说之人，居然还是异世界的。呵，不管了，本王子的千年使命就此结束，溜了溜了。"
			}
		}
	},
	[10420] = {
		name = "英勇之弓",
		height = 861,
		id = 10420,
		title = "精灵古书",
		bid = 1,
		condition = {},
		content = {
			{
				3,
				"",
				"前方的树卡莉法茂盛异常，一道绿色的光芒在树卡莉法间时隐时现，空气令人心旷神怡。"
			},
			{
				3,
				"",
				"修罗和娜美来到附近，却没发现有屏障存在。"
			},
			{
				3,
				"修罗",
				"看你的样子好像很希望获得圣器？"
			},
			{
				3,
				"修罗",
				"那么轻易就把这么重大的消息告诉我们，就不怕……"
			},
			{
				3,
				"娜美",
				"本小姐也知道啊，但是，传说中的圣器，值得冒险一试！"
			},
			{
				3,
				"娜美",
				"何况你不是想要找到回到元世界的方法吗？"
			},
			{
				3,
				"修罗",
				"对啊，但这和圣器有什么关系？"
			},
			{
				3,
				"娜美",
				"当然有啦，传说中圣器共鸣具有时空之力，可以服从拥有者的意志进行传送。"
			},
			{
				3,
				"修罗",
				"那，需要收集多少圣器才能让圣器共鸣。"
			},
			{
				3,
				"娜美",
				"当然，要全部啦！"
			},
			{
				3,
				"修罗",
				"听起来怎么像是天方夜谭……"
			},
			{
				3,
				"娜美",
				"哎呀，天方夜谭我不知道，但是圣器总会一个个找到的嘛，赶紧把圣器带走，免得被别人发现！"
			}
		}
	},
	[20060] = {
		name = "翱翔之翼",
		height = 667,
		id = 20060,
		title = "并非圣器",
		bid = 2,
		condition = {},
		content = {
			{
				3,
				"",
				"走出一段路后，娜美看了看修罗手中那本古籍，捏着下巴似乎在思考什么。"
			},
			{
				3,
				"娜美",
				"这个，并不像传说中的圣器……"
			},
			{
				3,
				"修罗",
				"嗯？我都能感受到这本书的生命气息，为什么会所它不是圣器呢？"
			},
			{
				3,
				"娜美",
				"就像刚才那个精灵说的，这并不符合传说中的那六件圣器的外形。"
			},
			{
				3,
				"修罗",
				"也是，那这么说我们不是白费功夫了？"
			},
			{
				3,
				"娜美",
				"你也说这本书散发出强大的生命气息啦，说不定也是神那个纪元的东西，对我们会有帮助。"
			},
			{
				3,
				"娜美",
				"好了，我们继续出发吧！"
			},
			{
				3,
				"娜美",
				"照这个情况看，我们很快就能找到真正的圣器了！"
			}
		}
	},
	[20180] = {
		name = "翱翔之翼",
		height = 1068,
		id = 20180,
		title = "狮鹫大叔",
		bid = 2,
		condition = {},
		content = {
			{
				3,
				"",
				"四周尘土飞扬，黄沙漫漫，与伟大航路相邻的威士忌山峰却是截然相反的景色。"
			},
			{
				3,
				"",
				"前方出现一道身影，上半身是人，下半身是狮子，正艰难的扑腾着翅膀，昂首向上。"
			},
			{
				3,
				"娜美",
				"走，我们偷偷过去看看。"
			},
			{
				3,
				"鱼人3号",
				"嗯？两个小鬼别躲躲藏藏的，我知道你们在这附近。"
			},
			{
				3,
				"娜美",
				"嘻嘻，大叔你好啊~"
			},
			{
				3,
				"鱼人3号",
				"大叔？？我有这么老吗？"
			},
			{
				3,
				"修罗",
				"大哥别见怪，我们只是刚好路过，看到您在这里，所以想过来看看您在这里做什么。"
			},
			{
				3,
				"鱼人3号",
				"我？我一直都在这里，只为完成我狮鹫一族的夙愿！"
			},
			{
				3,
				"",
				"鱼人3号昂首站在黄沙飞扬的山城上，如伊卡洛斯一般张开自己的翅膀。"
			},
			{
				3,
				"鱼人3号",
				"在漫长的年月里，我狮鹫一族逐渐变得强大。"
			},
			{
				3,
				"鱼人3号",
				"现在的我们拥有狮一般的力量，和鹰一般的速度！但也失去了我族本该有的飞行能力。"
			},
			{
				3,
				"鱼人3号",
				"天空才是我狮鹫一族应有的归宿，就算付出再大的代价也在所不惜！"
			}
		}
	},
	[20300] = {
		name = "翱翔之翼",
		height = 587,
		id = 20300,
		title = "永恒的信念",
		bid = 2,
		condition = {},
		content = {
			{
				3,
				"",
				"远处黄沙滚滚，狮鹫的眼中露出了一丝警惕。"
			},
			{
				3,
				"修罗",
				"这是？"
			},
			{
				3,
				"鱼人3号",
				"又是这群可恶的魔物！"
			},
			{
				3,
				"鱼人3号",
				"最近有一群魔族生物在山城附近出没，滥杀无辜。"
			},
			{
				3,
				"鱼人3号",
				"你们先离开这里，我来对付它们！"
			},
			{
				3,
				"娜美",
				"嘻嘻，既然大叔都这么说了，我们肯定不能当逃兵啊~"
			},
			{
				3,
				"修罗",
				"义不容辞。"
			},
			{
				3,
				"鱼人3号",
				"嘿嘿，小鬼头倒是挺有义气的，那就让我们来，大战一场！"
			}
		}
	},
	[20420] = {
		name = "翱翔之翼",
		height = 1107,
		id = 20420,
		title = "先知的预言",
		bid = 2,
		condition = {},
		content = {
			{
				3,
				"",
				"一番战斗，三人击退了魔物。"
			},
			{
				3,
				"",
				"就在三人休息疗伤之时，精灵古书再次发出了翠绿色的光芒。"
			},
			{
				3,
				"鱼人3号",
				"小鬼，这是传说中的“圣器”？"
			},
			{
				3,
				"修罗",
				"虽然我们也这样认为，但是它却跟传说中的六件圣器外形完全不同。"
			},
			{
				3,
				"鱼人3号",
				"小鬼，传说毕竟只是传说，口口相传的事情并不完全可信。"
			},
			{
				3,
				"修罗",
				"您的意思是说，真正的圣器未必就是传说描述的那样？"
			},
			{
				3,
				"鱼人3号",
				"就如大陆上最近盛传的大祭司梅卡莉法的预言：来自异界的少年将会为这个世界带来曙光。"
			},
			{
				3,
				"修罗",
				"……"
			},
			{
				3,
				"鱼人3号",
				"冒险大陆之上从未出现过重大危机，希望这只是大祭司的一个失误吧。"
			},
			{
				3,
				"鱼人3号",
				"但东方的小花园最近确实出现了一股杀戮之气，你们一定要离那里远一点。"
			},
			{
				3,
				"娜美",
				"好啦大叔，我们会注意的。那我们要继续去冒险啦~"
			},
			{
				3,
				"鱼人3号",
				"祝你们好运~还有，不要叫我大叔！"
			},
			{
				3,
				"娜美",
				"好的大叔。"
			},
			{
				3,
				"鱼人3号",
				"（自言自语）哎，魔族和圣器都开始现世了，希望大祭司预言的那一天不会真的到来……"
			}
		}
	},
	[30060] = {
		name = "雪地弦音",
		height = 751,
		id = 30060,
		title = "极寒雪地",
		bid = 3,
		condition = {},
		content = {
			{
				3,
				"",
				"一男一女两道身影走在山城上，远远望去能够看到前方白茫茫的一片。"
			},
			{
				3,
				"娜美",
				"喂，这件事你怎么看？"
			},
			{
				3,
				"修罗",
				"什么怎么看？"
			},
			{
				3,
				"娜美",
				"大叔说的小花园出现的杀戮之气啊！我觉得很有可能就是圣器了！"
			},
			{
				3,
				"修罗",
				"确实有可能，但是相比起来，我更在意他所说的那个预言……"
			},
			{
				3,
				"娜美",
				"你是说你有可能是那个预言的人吗哈哈哈？"
			},
			{
				3,
				"娜美",
				"比起这个来我还是觉得东方有圣器这个消息更加靠谱些~"
			},
			{
				3,
				"修罗",
				"#26#26#26"
			},
			{
				3,
				"娜美",
				"不过，既然有了圣器的消息，我们过去看看如何？"
			},
			{
				3,
				"修罗",
				"也只能这样了，虽然有点危险！"
			}
		}
	},
	[30180] = {
		name = "雪地弦音",
		height = 1116,
		id = 30180,
		title = "水之元素",
		bid = 3,
		condition = {},
		content = {
			{
				3,
				"",
				"山城与雪地接壤之处，土黄色开始褪去，四周渐渐被皑皑的白雪覆盖，一望无际的银白色。"
			},
			{
				3,
				"娜美",
				"有点冷……"
			},
			{
				3,
				"修罗",
				"嗯，真是奇怪了，刚才还是一片沙漠，走着走着就变成一片雪地。"
			},
			{
				3,
				"娜美",
				"已经能够隐约感觉到了大叔说的那股气息了，走吧！"
			},
			{
				3,
				"修罗",
				"嗯，小心。"
			},
			{
				3,
				"",
				"面前的雪地上突然有一股水涌起，渐渐化为一个蓝色透明的女人形，妖媚地看着修罗和娜美。"
			},
			{
				3,
				"小八",
				"哟，水灵灵的小姑娘和小伙子。"
			},
			{
				3,
				"修罗",
				"你是什么人？"
			},
			{
				3,
				"小八",
				"我可不是什么人，我只不过是大自然所孕育的小八之灵而已。"
			},
			{
				3,
				"小八",
				"身为低级元素之灵的我们生命只有短短的几十年。"
			},
			{
				3,
				"小八",
				"如果没办法获得来自于外界的帮助，摆脱对元素的依赖，我们很快就会消散于天地之间。"
			},
			{
				3,
				"修罗",
				"“外界的帮助”，指的是？"
			},
			{
				3,
				"小八",
				"比如~你身上的圣器！"
			},
			{
				3,
				"",
				"雪地上出现了一道道冰柱，小八发起攻击，把修罗和娜美困在冰柱中间。"
			}
		}
	},
	[30300] = {
		name = "雪地弦音",
		height = 1271,
		id = 30300,
		title = "卡巴奇",
		bid = 3,
		condition = {},
		content = {
			{
				3,
				"",
				"远方一阵悠扬的弦音传来，小八陷入了沉睡之中，冰柱也化成了一道道的水。"
			},
			{
				3,
				"",
				"一道人身鱼尾，抱着竖琴的身影出现在了修罗和娜美面前。"
			},
			{
				3,
				"修罗",
				"谢谢你救了我们，你是？"
			},
			{
				3,
				"卡巴奇",
				"我是生活在这里的海妖一族。"
			},
			{
				3,
				"修罗",
				"你为什么要救我们？"
			},
			{
				3,
				"卡巴奇",
				"因为你身上有着圣器的气息，有别于那股杀戮之气的圣器气息……"
			},
			{
				3,
				"娜美",
				"所以你也是为了圣器而来？"
			},
			{
				3,
				"卡巴奇",
				"可以这么理解，但不需要这样警惕的看着，我和那个低等低等元素题可不一样。"
			},
			{
				3,
				"卡巴奇",
				"我们海妖一族，曾借用雪地深处的那件圣器来壮大我族的实力。"
			},
			{
				3,
				"卡巴奇",
				"但前段时间它却突然失去了控制，大肆杀戮我族之人。"
			},
			{
				3,
				"卡巴奇",
				"所以我想请求你们替我族制服圣器，解决海妖一族之难。"
			},
			{
				3,
				"娜美",
				"既然它如此厉害，我们又怎么可能帮得上忙呢？"
			},
			{
				3,
				"卡巴奇",
				"圣器的力量可以相互制衡，因此，强大的实力并不是收服圣器的唯一办法。"
			},
			{
				3,
				"修罗",
				"如果这样就能为你们一族解决灾难，那我愿意试一下。"
			},
			{
				3,
				"娜美",
				"不过，我们可是要带走圣器的噢~"
			},
			{
				3,
				"卡巴奇",
				"我明白了，圣器之力终究不是我们这种普通之族可以染指的东西。"
			}
		}
	},
	[30420] = {
		name = "雪地弦音",
		height = 1368,
		id = 30420,
		title = "邪恶的脸",
		bid = 3,
		condition = {},
		content = {
			{
				3,
				"",
				"雪地深处的杀戮气息越发浓厚，不远处的雪上漂浮着一把弓，实质化的黑色杀戮之气若隐若现。"
			},
			{
				3,
				"娜美",
				"这是圣器么？为什么会有这么浓重的杀戮气息？"
			},
			{
				3,
				"修罗",
				"看来，传说中的圣器，真的另有隐情。"
			},
			{
				3,
				"娜美",
				"哎呀，现在还管什么隐不隐情的，我们有可能收服这件圣器么？"
			},
			{
				3,
				"修罗",
				"海妖说的，以圣器来收服另一件圣器，只能试试了……"
			},
			{
				3,
				"",
				"修罗从身上取出了精灵古书，古书缓缓飘向了半空中，散发出的生命气息越来越浓厚。"
			},
			{
				3,
				"",
				"空中的书和弓开始剧烈地震动，形成一阵剧烈的风，卷起了地上的雪……"
			},
			{
				3,
				"",
				"弓上的杀戮之气凝成了一张脸，冲着修罗和娜美笑了起来。"
			},
			{
				3,
				"",
				"随后，那把弓仿佛失去了气息一般，坠落在了修罗身前的地上……"
			},
			{
				3,
				"娜美",
				"那股邪恶的气息真让人难受……"
			},
			{
				3,
				"修罗",
				"还有那张脸，我总觉得这把弓气息的消失并没有那么简单。"
			},
			{
				3,
				"娜美",
				"大概是被那本古书的收服了吧，毕竟生命的气息敲好可以克制杀戮的气息。"
			},
			{
				3,
				"娜美",
				"话说，我们居然这么快就收集到了第二件圣器了。"
			},
			{
				3,
				"修罗",
				"是啊，真没想到。"
			},
			{
				3,
				"修罗",
				"（抬头望天）可我总觉得仿佛有什么东西在引导着我们找到圣器。"
			}
		}
	},
	[40060] = {
		name = "山岭之岩",
		height = 1172,
		id = 40060,
		title = "一生的使命",
		bid = 4,
		condition = {},
		content = {
			{
				3,
				"",
				"安格玛拉山中，一个周身都是由岩石构成的怪物旁若无人地经过，东张西望仿佛在寻找着什么……"
			},
			{
				3,
				"修罗",
				"这怪物的块头可真大！"
			},
			{
				3,
				"娜美",
				"这应该是Mr.5。"
			},
			{
				3,
				"修罗",
				"Mr.5？"
			},
			{
				3,
				"娜美",
				"对，和我们在雪地遇到的小八一样，也是大自然所孕育的元素之灵。"
			},
			{
				3,
				"娜美",
				"据说Mr.5的一生，只有两件事，寻找和守护。"
			},
			{
				3,
				"修罗",
				"寻找什么？守护什么？"
			},
			{
				3,
				"娜美",
				"不知道，或许就连它们自己也并不清楚吧。"
			},
			{
				3,
				"娜美",
				"传闻里，Mr.5诞生之初，便会启程寻找，然后用余生去守护它们。"
			},
			{
				3,
				"修罗",
				"这样漫无目的地寻找，就不怕找不到么？"
			},
			{
				3,
				"娜美",
				"大概吧，也有人亲眼目睹Mr.5消散在路上，那样的它们大概是还没有找到生命就已经走到了尽头。"
			},
			{
				3,
				"",
				"娜美怔怔地望着远去的Mr.5，眼里似乎有泪光闪烁，许久才回过头来。"
			},
			{
				3,
				"娜美",
				"好了我们该继续前进了，早点集齐圣器才能实现愿望！"
			},
			{
				3,
				"修罗",
				"什么愿望？（你以为圣器是七龙珠吗？）"
			},
			{
				3,
				"娜美",
				"啊？没什么，我是说你才能早点回到元世界。"
			}
		}
	},
	[40180] = {
		name = "山岭之岩",
		height = 736,
		id = 40180,
		title = "独眼神秘人",
		bid = 4,
		condition = {},
		content = {
			{
				3,
				"",
				"悬崖边上，一个身影迎着夕阳面向远方，他的影子被夕阳拉长，显出些许落寞……"
			},
			{
				3,
				"",
				"听见脚步声的接近，他回过神来，虽然遮住了左眼，但是仍让人生出一种能看穿一切的感觉。"
			},
			{
				3,
				"神秘人",
				"（低语）这是……秘典的气息。"
			},
			{
				3,
				"神秘人",
				"你们是什么人？"
			},
			{
				3,
				"修罗",
				"我们是出来历练的船长，正好路过。"
			},
			{
				3,
				"神秘人",
				"你并没有说实话，你的身上有着秘典的气息，还有，不属于这个世界的气息。"
			},
			{
				3,
				"修罗",
				"你是谁？怎么会感觉得到我身上的圣器。"
			},
			{
				3,
				"神秘人",
				"我是谁并不重要。"
			},
			{
				3,
				"神秘人",
				"“圣器”，是你们对它的称呼吗？"
			},
			{
				3,
				"神秘人",
				"因为，我曾是神兵之一的掌控者，就是你们所说的圣器，也是一切祸端的根源……"
			}
		}
	},
	[40300] = {
		name = "山岭之岩",
		height = 587,
		id = 40300,
		title = "黄昏由来",
		bid = 4,
		condition = {},
		content = {
			{
				3,
				"",
				"神秘人轻叹一声，闭上了右眼，仿佛陷入了无尽的回忆之中。"
			},
			{
				3,
				"神秘人",
				"那场战争，不过是因为对权与力的渴望而导致的神性的扭曲。"
			},
			{
				3,
				"神秘人",
				"我们，都不过是那场阴谋中的一枚棋子，一个牺牲品而已！"
			},
			{
				3,
				"修罗",
				"您指的是？"
			},
			{
				3,
				"神秘人",
				"那场导致众神走向衰落，继而灭亡的神族内战！"
			},
			{
				3,
				"娜美",
				"诸神的黄昏么？"
			},
			{
				3,
				"神秘人",
				"黄昏？那确实是，我们众神的末日。"
			}
		}
	},
	[40420] = {
		name = "山岭之岩",
		height = 1042,
		id = 40420,
		title = "必然的归宿",
		bid = 4,
		condition = {},
		content = {
			{
				3,
				"",
				"神秘人伸出手，轻轻地覆在了自己被遮住的左眼上。"
			},
			{
				3,
				"神秘人",
				"其实，我早就通过这只预言之眼，看到了众神陨落的光景。"
			},
			{
				3,
				"修罗",
				"那您没有尝试着阻止这一切吗？"
			},
			{
				3,
				"神秘人",
				"我……能预见，却并不代表就有能力去改变。"
			},
			{
				3,
				"神秘人",
				"即使是凡人眼中无所不能的神，也并非万能，一切都有它的规则，我改变了过程，却阻止不了它的发生。"
			},
			{
				3,
				"娜美",
				"你到底是谁？"
			},
			{
				3,
				"神秘人",
				"我是谁？我只是一个眼睁睁看着事情发生而无力去改变的失败的神罢了。"
			},
			{
				3,
				"神秘人",
				"至于其他，当你们找到胜利之枪时，真相也就快要浮出水面了。"
			},
			{
				3,
				"修罗",
				"你怎么能确定一切会如你所言呢？"
			},
			{
				3,
				"神秘人",
				"我也无法看穿全部真相，但我从你的身上，看到了打破这个轮回的希望。"
			},
			{
				3,
				"神秘人",
				"你一定会取到位于大陆尽头的那里，这也是你命运的必然。"
			},
			{
				3,
				"神秘人",
				"来自异界的你，就把这当做是一场梦吧。"
			},
			{
				3,
				"神秘人",
				"不需要去肩负那些所谓的命运和重任，做自己想做的就足够了。"
			}
		}
	},
	[50060] = {
		name = "海神之怒",
		height = 994,
		id = 50060,
		title = "雪山崩塌",
		bid = 5,
		condition = {},
		content = {
			{
				3,
				"",
				"水之都，修罗和娜美在雪山里缓慢地前行着。"
			},
			{
				3,
				"娜美",
				"哇，被冰雪覆盖的山真美~~"
			},
			{
				3,
				"修罗",
				"额，别撑了，我看到了你在发抖了。"
			},
			{
				3,
				"娜美",
				"哪，哪有，明明是你在发抖。"
			},
			{
				3,
				"修罗",
				"……"
			},
			{
				3,
				"修罗",
				"对了，好像都没听到你提起过自己的经历。"
			},
			{
				3,
				"娜美",
				"我嘛，我其实……"
			},
			{
				3,
				"修罗",
				"嗯？这个震动是怎么回事？"
			},
			{
				3,
				"",
				"大地开始震动，四周山上的雪开始不断地向下滚，隐约中能听到一声怒吼……"
			},
			{
				3,
				"娜美",
				"这是，要雪崩了？"
			},
			{
				3,
				"修罗",
				"前面有个山洞，赶紧躲起来！"
			},
			{
				3,
				"",
				"雪球滚落，封堵住了洞口，嘈杂声中仿佛夹杂着龙吟之声。"
			},
			{
				3,
				"娜美",
				"洞口被堵死了……"
			},
			{
				3,
				"修罗",
				"要想想办法出去了。"
			},
			{
				3,
				"娜美",
				"这洞后面好像有路……"
			},
			{
				3,
				"修罗",
				"只能试一试了，走吧。"
			}
		}
	},
	[50180] = {
		name = "海神之怒",
		height = 1443,
		id = 50180,
		title = "海神基德",
		bid = 5,
		condition = {},
		content = {
			{
				3,
				"",
				"幽暗的通道仿佛没有尽头，也不知道会通向何方，走了不知多久，终于见到一丝光亮。"
			},
			{
				3,
				"",
				"修罗和娜美向前飞奔，终于来到出口，却发现一个蓝皮肤的人正发了疯似的向前方攻击。"
			},
			{
				3,
				"娜美",
				"那个人，是疯子吗？"
			},
			{
				3,
				"修罗",
				"嘘，小声点，刚才那场雪崩说不定……"
			},
			{
				3,
				"娜美",
				"你是说，有可能是他造成的？"
			},
			{
				3,
				"修罗",
				"嗯……"
			},
			{
				3,
				"基德",
				"嗯？人类，还有……"
			},
			{
				3,
				"基德",
				"正好，来和大爷打一场，让大爷我发泄一下！"
			},
			{
				3,
				"",
				"基德舞动手中的三叉戟，身后的海皇龙发动吐息，打得修罗和娜美毫无还手之力。"
			},
			{
				3,
				"基德",
				"好了，不打了不打了。"
			},
			{
				3,
				"修罗",
				"嗯？"
			},
			{
				3,
				"基德",
				"干嘛？你以为你海神大爷是想杀了你们吗？"
			},
			{
				3,
				"基德",
				"本大爷想杀了你们，让小皇吐口口水都能淹死。"
			},
			{
				3,
				"基德",
				"没想到神魔兵之主，居然还如此弱小，不打了不打了。"
			},
			{
				3,
				"修罗",
				"神魔兵？上次那个独眼神秘人也提起过……"
			},
			{
				3,
				"基德",
				"你身上那把邪恶之弓简直臭气熏天，我巴不得一戟戳破！"
			},
			{
				3,
				"娜美",
				"这不是魔族拥有“圣器”吗？"
			},
			{
				3,
				"基德",
				"什么圣器不圣器的？这是魔族的三魔兵之一！"
			},
			{
				3,
				"基德",
				"罢了罢了，都是过去的事了，不跟你们这些小子计较！"
			},
			{
				3,
				"基德",
				"想想我就来气，要不是因为你拥有神魔兵，我一定还要揍你一顿顿解解我这么多年的气！"
			}
		}
	},
	[50300] = {
		name = "海神之怒",
		height = 1628,
		id = 50300,
		title = "冰河时代",
		bid = 5,
		condition = {},
		content = {
			{
				3,
				"",
				"基德气呼呼地坐在地上，毫无想象中神的威严可言。"
			},
			{
				3,
				"基德",
				"噢，bitch，想想还是气！"
			},
			{
				3,
				"娜美",
				"？？？"
			},
			{
				3,
				"基德",
				"我说你们俩，想听大爷我讲讲过去的事情吗？"
			},
			{
				3,
				"娜美",
				"想啊想啊想啊~"
			},
			{
				3,
				"修罗",
				"乐意之极。"
			},
			{
				3,
				"基德",
				"哼，神族在精灵族和海族的协助下，击溃魔族，同时夺得了魔族的三件魔兵。"
			},
			{
				3,
				"基德",
				"我们一族却慢慢地在“三件魔兵该摧毁还是像三件魔兵一样加以利用”这个问题上产生了分歧。"
			},
			{
				3,
				"基德",
				"大爷我本来是支持摧毁魔兵的，闻到他的气息我就像作呕……"
			},
			{
				3,
				"基德",
				"但是却因为蛇女那个贱…的劝说，支持利用魔兵，后来神族中开始出现了心术不正之神。"
			},
			{
				3,
				"基德",
				"慢慢形成了对立的两派，最终进行了一场大战。"
			},
			{
				3,
				"基德",
				"现在想想，真特么愚昧，自诩聪明的神，却被隐匿于黑暗中的人所利用。"
			},
			{
				3,
				"",
				"基德的脸上写满了羞愧与愤怒，又深深看了修罗一眼。"
			},
			{
				3,
				"娜美",
				"你是说，这很有可能都是一场阴谋？"
			},
			{
				3,
				"基德",
				"什么可能不可能，这就是一场阴谋，罢了罢了……"
			},
			{
				3,
				"基德",
				"小子，虽然我不知道你是什么来历，但能得到神魔兵认可的人，绝非平庸之人。"
			},
			{
				3,
				"基德",
				"虽然神魔兵并无善恶之分，但沾染了魔族气息的魔兵，确实会不知不觉影响人神的心智。"
			},
			{
				3,
				"基德",
				"切记这一点，否则一切将陷入无法挽回的地步！"
			},
			{
				3,
				"修罗",
				"我……"
			},
			{
				3,
				"基德",
				"好了，大爷我累了，你们可以滚了，顺便，走的时候把这把破锤子带走……"
			},
			{
				3,
				"修罗",
				"这锤子，难道是？！"
			}
		}
	},
	[50420] = {
		name = "海神之怒",
		height = 837,
		id = 50420,
		title = "轮回逆转",
		bid = 5,
		condition = {},
		content = {
			{
				3,
				"",
				"基德的三叉戟猛然插在地上，冰面上出现了一道道裂缝，露出一把带有骷髅头的锤子。"
			},
			{
				3,
				"基德",
				"这东西每天都能让大爷我恶心千百遍，终于有人可以带走它了。"
			},
			{
				3,
				"修罗",
				"您不是怕魔兵现世会引发什么事情么？"
			},
			{
				3,
				"基德",
				"大爷我一直守着这把破锤子，也只是为了等一个人出现，能够让它重新现世。"
			},
			{
				3,
				"基德",
				"冰封在这里，虽然有一时安宁，但最终只会让一切无法挽回，陷入轮回之中！"
			},
			{
				3,
				"修罗",
				"我不明白，既……"
			},
			{
				3,
				"基德",
				"大爷我什么都不知道了，既然你们见过了独眼鬼，还能带着魔兵来到这里，已经说明了一些东西。"
			},
			{
				3,
				"基德",
				"该怎么做，独眼鬼也该说过了。无法逆转的预言就算了，还偏偏喜欢说出来……"
			},
			{
				3,
				"基德",
				"（自言自语）魔族，墨莎，如果再一次逆转轮回……"
			}
		}
	},
	[60060] = {
		name = "精灵女王",
		height = 546,
		id = 60060,
		title = "渐渐遗忘",
		bid = 6,
		condition = {},
		content = {
			{
				3,
				"",
				"有别于伟大航路的枝叶繁茂，司法岛前的树木更为高大笔直。"
			},
			{
				3,
				"修罗",
				"事情越来越复杂了……"
			},
			{
				3,
				"娜美",
				"这不是已经收集到三件圣器了吗？只要再找到剩下的三件圣器就大功告成了！"
			},
			{
				3,
				"修罗",
				"我只是想寻找回到元世界的方法，可是却觉得自己陷入了一个局……"
			},
			{
				3,
				"娜美",
				"安啦~我们很快就能寻找到其他圣器，然后离开这里。"
			},
			{
				3,
				"修罗",
				"元世界，我怎么想不起来了……"
			}
		}
	},
	[60180] = {
		name = "精灵女王",
		height = 716,
		id = 60180,
		title = "海贼14号",
		bid = 6,
		condition = {},
		content = {
			{
				3,
				"",
				"修罗陷入了深深的沉思之中，却被一个清脆的声音所打断。"
			},
			{
				3,
				"海贼14号",
				"咿呀，大哥哥，大哥哥……"
			},
			{
				3,
				"海贼14号",
				"你身上是不是带了什么东西，这股气息让小花觉得好舒服呀~"
			},
			{
				3,
				"",
				"一个娇小可爱的身影出现在修罗和娜美面前，轻轻地晃着修罗的肩膀。"
			},
			{
				3,
				"修罗",
				"你说的是这个吗？"
			},
			{
				3,
				"海贼14号",
				"咿呀就是它……咿，怎么和女王大人说过的那样东西那么像。"
			},
			{
				3,
				"海贼14号",
				"大哥哥，你可以带着这本书跟小花一起去找女王大人吗？"
			},
			{
				3,
				"娜美",
				"走吧，正好也可以知道它的来历。"
			}
		}
	},
	[60300] = {
		name = "精灵女王",
		height = 660,
		id = 60300,
		title = "大·黑暗笼罩",
		bid = 6,
		condition = {},
		content = {
			{
				3,
				"",
				"司法岛前中央，一棵参天大树下，海贼14号拍着翅膀慢慢地飞翔。"
			},
			{
				3,
				"海贼14号",
				"女王大人，女王大人……"
			},
			{
				3,
				"伊万科夫",
				"小花又跑哪里去啦？他们是？这个气息？"
			},
			{
				3,
				"海贼14号",
				"女王大人你看大哥哥手里的东西！"
			},
			{
				5,
				"伊万科夫",
				"这个是？我族遗失的大·黑暗笼罩？"
			},
			{
				5,
				"伊万科夫",
				"噢，失礼了，还没有自我介绍。我是司法岛前精灵一族的女王。"
			},
			{
				5,
				"修罗",
				"我是修罗。"
			},
			{
				5,
				"娜美",
				"我叫娜美！"
			},
			{
				5,
				"修罗",
				"您刚才说这是，精灵族遗失的大·黑暗笼罩？"
			},
			{
				5,
				"伊万科夫",
				"不确定，但它的样子和气息，确实和我族记载的大·黑暗笼罩一致。"
			}
		}
	},
	[60420] = {
		name = "精灵女王",
		height = 835,
		id = 60420,
		title = "秘典的使命",
		bid = 6,
		condition = {},
		content = {
			{
				5,
				"",
				"精灵女王似乎在思考着什么，许久后才回过神来。"
			},
			{
				5,
				"伊万科夫",
				"请问你们是从哪里得到它的呢？"
			},
			{
				5,
				"修罗",
				"是在伟大航路发现的，对了，是一个自称来自司法岛前的加布拉告诉我们它的下落的。"
			},
			{
				5,
				"伊万科夫",
				"这就奇怪了，我族一直生活在司法岛前中，从未有王子外出过。"
			},
			{
				5,
				"伊万科夫",
				"其实，精灵族至今都未见过这本秘典，记载中最后一次出现是神之纪元。"
			},
			{
				5,
				"伊万科夫",
				"当时魔族进攻神界，两族势均力敌，我族收到神族的请求，携带大·黑暗笼罩前往支援。"
			},
			{
				5,
				"伊万科夫",
				"击败魔族后，秘典却不知所踪，但后来的族训中却有提及：秘典自有其使命，我族不得强行索回秘典。"
			},
			{
				5,
				"修罗",
				"这么说，大·黑暗笼罩被我们得到并不是偶然？"
			},
			{
				5,
				"伊万科夫",
				"可以这么理解，万物存亡自有其规律变化，我精灵一族向来信奉这点。"
			},
			{
				5,
				"伊万科夫",
				"愿大·黑暗笼罩能为你们带来生机的祝福。"
			}
		}
	},
	[70060] = {
		name = "冰川龙族",
		height = 1000,
		id = 70060,
		title = "刺骨之寒",
		bid = 7,
		condition = {},
		content = {
			{
				3,
				"",
				"越是了解过往的真相，内心就有了越多的谜团。"
			},
			{
				3,
				"",
				"修罗和娜美带着圣器，继续向东北方前行，翠绿色开始渐渐褪去，远处是一片一望无际的冰川。"
			},
			{
				3,
				"修罗",
				"又是一片冰雪之地……"
			},
			{
				3,
				"娜美",
				"你有没有觉得这里和我们之前去过的都不太一样？"
			},
			{
				3,
				"修罗",
				"不一样？"
			},
			{
				3,
				"娜美",
				"嗯，这里的寒冷，让我觉得像是被人盯着，随时能置我于死地。"
			},
			{
				3,
				"修罗",
				"怎么感觉像是鬼故事一样？#50#50#50"
			},
			{
				3,
				"娜美",
				"鬼故事是什么？"
			},
			{
				3,
				"修罗",
				"没什么，我们走吧，说不定这是因为圣器而导致的异象。"
			},
			{
				3,
				"",
				"修罗和娜美走在冰川之上，远处有几头蓝色的龙围攻另一头巨龙。"
			},
			{
				3,
				"",
				"那头巨龙发现了修罗和娜美的身影，甩下另外几头龙朝着他们冲来。"
			},
			{
				3,
				"娜美",
				"啊啊啊，有一头龙飞来了！"
			},
			{
				3,
				"修罗",
				"这附近没地方躲，只能上了！"
			}
		}
	},
	[70180] = {
		name = "冰川龙族",
		height = 997,
		id = 70180,
		title = "红眼巨龙",
		bid = 7,
		condition = {},
		content = {
			{
				3,
				"",
				"巨龙停留在半空中，一双泛着红光的眼盯着修罗，随后猛然扑向修罗。"
			},
			{
				3,
				"",
				"修罗奋力一跃，躲开了巨龙的一扑，并用尽全身之力一剑劈向巨龙。"
			},
			{
				3,
				"",
				"巨龙跌落在冰面上，甩了甩脑袋，一个吐息将修罗冻成了冰雕。"
			},
			{
				3,
				"",
				"远方几条龙赶到，继续与巨龙纠缠了起来。"
			},
			{
				3,
				"",
				"千钧一发的时刻，大·黑暗笼罩泛起了绿光，巨龙在空中摇摇欲坠，闭上了眼，最终跌落在地。"
			},
			{
				3,
				"",
				"几头龙同时从空中降落，待在巨龙身边瞧了瞧，随后向修罗和娜美走来。"
			},
			{
				3,
				"路龙甲",
				"谢谢你，人类少年……"
			},
			{
				3,
				"修罗",
				"你们是？"
			},
			{
				3,
				"路龙甲",
				"我们是隐居在这片司法岛后的德雷克，刚才那是我们的长老。"
			},
			{
				3,
				"娜美",
				"既然是你们的长老，怎么会……"
			},
			{
				3,
				"路龙乙",
				"我们也不知道，总之，先带长老回去再看下吧。"
			}
		}
	},
	[70300] = {
		name = "冰川龙族",
		height = 1207,
		id = 70300,
		title = "噬神魔兵",
		bid = 7,
		condition = {},
		content = {
			{
				3,
				"",
				"修罗和娜美骑在冰龙的背上，在寒冷的风雪中前往龙族的栖息地。"
			},
			{
				3,
				"",
				"到达后，龙族长老也慢慢地从沉睡中苏醒。"
			},
			{
				3,
				"龙长老",
				"谢谢你，人类，刚才的所有事情我都清晰地记得。"
			},
			{
				3,
				"修罗",
				"那您这是？"
			},
			{
				3,
				"龙长老",
				"刚才，我能够清晰地感知外界的一切，但我的身体却不受控制地想要毁灭一切。"
			},
			{
				3,
				"龙长老",
				"人类，刚才救了我一命的，是神兵吧？"
			},
			{
				3,
				"修罗",
				"您说的是这个吗？我也不知道它到底是不是你们所说的神兵。"
			},
			{
				3,
				"龙长老",
				"我之所以变成这样，就是因为我冰霜龙族世代镇守的那件魔兵。"
			},
			{
				3,
				"龙长老",
				"就在今天，我发现了魔兵的异象，前去探查。"
			},
			{
				3,
				"龙长老",
				"魔兵却突然像是拥有了意识一样对我发起了攻击，受了伤之后我就开始发现我的身体开始不受我的控制。"
			},
			{
				3,
				"龙长老",
				"我毫不怀疑，如果一直这样下去，我的意志会被这股力量侵蚀。"
			},
			{
				3,
				"龙长老",
				"既然你已经到来，那我族对神族的承诺也就完成了。"
			},
			{
				3,
				"修罗",
				"承诺？"
			},
			{
				3,
				"",
				"修罗的心猛然一动，似乎又是一件跨越千年，与他有关的事情。"
			}
		}
	},
	[70420] = {
		name = "冰川龙族",
		height = 896,
		id = 70420,
		title = "所谓使命",
		bid = 7,
		condition = {},
		content = {
			{
				3,
				"龙长老",
				"是的，我族对鳄鱼大神和艾斯的承诺。"
			},
			{
				3,
				"龙长老",
				"神族曾有恩于我族，而在那场神族之战后，艾斯突然带着魔兵来到我族。"
			},
			{
				3,
				"龙长老",
				"要求我族长居司法岛后之内，镇守魔兵，不得离开，直至一个掌控神兵的少年到来。"
			},
			{
				3,
				"龙长老",
				"将魔兵血斧交予他，这份承诺才算完成。"
			},
			{
				3,
				"修罗",
				"你意思是，那个冰…雪女王让你将魔兵交给我？"
			},
			{
				3,
				"龙长老",
				"是的。"
			},
			{
				3,
				"修罗",
				"可是我并不是这个世界的人，怎么可能在千年前便预知我的到来。"
			},
			{
				3,
				"龙长老",
				"孩子，既然你知道这件事发生在千年前，就说明你已经知道了很多事情。"
			},
			{
				3,
				"龙长老",
				"正如我龙族千年镇守的命运，掌握神兵之人自然有其命运之路。"
			},
			{
				3,
				"龙长老",
				"还想知道什么的话，就带上这件魔兵，还有这颗冰雪灵石，去往雪山中央吧。"
			},
			{
				3,
				"龙长老",
				"在那里你会明白自己的命运，或者说，使命。"
			}
		}
	},
	[80060] = {
		name = "永坠深寒",
		height = 646,
		id = 80060,
		title = "各自的命运",
		bid = 8,
		condition = {},
		content = {
			{
				3,
				"",
				"雪山深处，到处都是永不消融的坚冰，即使是修罗用上全力的一剑，都无法在冰面上留下哪怕一点痕迹。"
			},
			{
				3,
				"",
				"即使拥有了龙族长老赠予的冰雪灵石，却还是能感受到雪山里刺骨般的寒冷。"
			},
			{
				3,
				"修罗",
				"（自言自语）命运？使命？"
			},
			{
				3,
				"娜美",
				"喂，呆瑟你干嘛了？"
			},
			{
				3,
				"修罗",
				"没什么，我只是在想长老说的命运和使命，我好像在哪里听过，但是又想不起来。"
			},
			{
				3,
				"娜美",
				"哎呀，想不起来就别想啦，像我一样抛下一切多好。"
			},
			{
				3,
				"修罗",
				"你抛下了什么了吗？"
			},
			{
				3,
				"娜美",
				"没……没什么啊，快点走啦！这里好冷啊！"
			}
		}
	},
	[80180] = {
		name = "永坠深寒",
		height = 1054,
		id = 80180,
		title = "艾斯",
		bid = 8,
		condition = {},
		content = {
			{
				3,
				"",
				"雪山中央，灵石突然发出了耀眼的光芒，一个冰雕浮现在修罗和娜美眼前。"
			},
			{
				3,
				"",
				"这是一个年轻女子的冰雕，双手高举着法杖，冰蓝色的裙子和一头金发彰显着她的高贵与冰冷。"
			},
			{
				3,
				"娜美",
				"这是？为什么突然间变得好冷……"
			},
			{
				3,
				"修罗",
				"冷？我怎么没有感觉到？"
			},
			{
				3,
				"修罗",
				"你怎么了？喂……"
			},
			{
				3,
				"",
				"娜美突然晕倒在了冰上，冰雕也开始剧烈地晃动起来。"
			},
			{
				3,
				"",
				"那冰雕上看似坚不可摧的冰开始融化，冰雕之中赫然是一个活生生的人！"
			},
			{
				3,
				"艾斯",
				"人类，你终于来了！"
			},
			{
				3,
				"修罗",
				"你是，龙长老所说的，艾斯？"
			},
			{
				3,
				"艾斯",
				"是的。"
			},
			{
				3,
				"修罗",
				"那我所谓的使命到底为何？为什么龙长老说你们在千年前就预知了我的到来？？"
			},
			{
				3,
				"修罗",
				"又为什么？好像这个世界所有的一切都与我有关？？？"
			},
			{
				3,
				"艾斯",
				"看起来，现在的你，似乎更加想要了解一切，是因为她的出现吗？"
			}
		}
	},
	[80300] = {
		name = "永坠深寒",
		height = 660,
		id = 80300,
		title = "永恒中的变化",
		bid = 8,
		condition = {},
		content = {
			{
				3,
				"",
				"艾斯望着倒在冰面上的娜美，目光中带着些许震惊、疑惑，还有一丝杀意……"
			},
			{
				3,
				"艾斯",
				"算了，能够在这永恒之中带来一丝变化的，或许也只有你了。"
			},
			{
				3,
				"修罗",
				"永恒？变化？？"
			},
			{
				3,
				"艾斯",
				"就算我告诉你真相，也只不过是让你肩负更重的使命。"
			},
			{
				3,
				"艾斯",
				"何况，也唯有你，才能在这个虚实交错的世界，寻找到唯一的真相。"
			},
			{
				3,
				"艾斯",
				"我已再次醒来，乌索普的封印也即将解开。"
			},
			{
				3,
				"艾斯",
				"去往大陆的极热之地，封印炎魔，这是你无法拒绝的使命。"
			}
		}
	},
	[80420] = {
		name = "永坠深寒",
		height = 490,
		id = 80420,
		title = "打破轮回",
		bid = 8,
		condition = {},
		content = {
			{
				3,
				"",
				"一阵风吹过，修罗昏昏沉沉地闭上了眼睛。"
			},
			{
				3,
				"",
				"艾斯久久地望着冰面上的两人。"
			},
			{
				3,
				"艾斯",
				"过去的每一次，你都只顾着完成所谓的使命。"
			},
			{
				3,
				"艾斯",
				"现在的你，终于也开始懂得抗争命运了吗？"
			},
			{
				3,
				"艾斯",
				"希望她的出现，并无恶意。"
			},
			{
				3,
				"艾斯",
				"呵，让我见识一下吧，预言之子，打破轮回之人，唯有如此，才能凌驾于神。"
			}
		}
	}
}
