Config = Config or {}
Config.HallowsData = Config.HallowsData or {}
Config.HallowsData.data_const_length = 16
Config.HallowsData.data_const = {
	id_advanced_props = {
		val = 72001,
		desc = "神技进阶道具ID"
	},
	id_skill_upgrade = {
		val = 72002,
		desc = "神技道具ID"
	},
	stone_attribute = {
		desc = "刻印石属性",
		val = {
			{
				"hp_max",
				500
			},
			{
				"atk",
				50
			}
		}
	},
	id_stone = {
		val = 72003,
		desc = "神印石ID"
	},
	price_advanced_props = {
		desc = "神技进阶道具价格（红蓝钻）",
		val = {
			15,
			20
		}
	},
	exchangeid_advanced_props = {
		val = 1020,
		desc = "进阶道具商店ID"
	},
	temporary_ratio = {
		val = 800,
		desc = "临时属性千分比"
	},
	order_max = {
		val = 24,
		desc = "神技最大阶数"
	},
	skill_show = {
		desc = "神技属性展示",
		val = {
			"atk",
			"def",
			"hp_max",
			"speed"
		}
	},
	spirit_show = {
		desc = "神灵属性展示",
		val = {
			"atk",
			"def",
			"hp_max"
		}
	},
	source_item = {
		val = 71060,
		desc = "装备前往获取读取的物品ID"
	},
	skill_max = {
		val = 12,
		desc = "神技最高等级"
	},
	imprint_lowest = {
		val = 3,
		desc = "3阶可使用刻印石"
	},
	hallows_open = {
		desc = "通关卡达尔森林3开启",
		val = {
			"dun",
			10030
		}
	},
	game_rule = {
		val = 1,
		desc = [[
一、解锁任务
1.每件神技均有专属解锁任务，完成指定任务即可解锁对应神技，并开启下一件神技的专属任务！
二、神技说明
1.穿戴神技后，该神技属性对全队英雄进行加成，加成效果仅在战斗中生效。
2.可使用炼神石提升神技等级，提升神技属性加成。
3.可使用神技符石提升技能等级，大幅提高技能伤害效果。
4.可使用烈阳晶石提升精炼等级，大幅提升神技的技能伤害。
三、技能说明
1.每件神技附带1个主动技能，神技可在战斗中上阵，第3回合释放主动技能，每3回合施放1次
四、圣印说明
1.圣印可使用刻印石提升属性。
刻印石的可使用数量由神技等级决定。
五、幻化说明
1.满足对应的幻化条件即可开启幻化外观。
2.幻化的属性附加在神技对英雄属性提升的基础上，多个幻化属性将会叠加。
3.同一幻化外观每次最多可给一个神技进行幻化，战斗中原神技技能效果不变。]]
	},
	illusion_open = {
		val = 70,
		desc = "船长等级70级开启"
	}
}

function Config.HallowsData.data_const_fun(slot0)
	slot1 = Config.HallowsData.data_const[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HallowsData.data_const[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HallowsData.data_max_lev_length = 5
Config.HallowsData.data_max_lev = {
	24,
	24,
	24,
	24,
	24
}
Config.HallowsData.data_base_length = 5
Config.HallowsData.data_base = {
	{
		effect = "E21050",
		item_id = 72104,
		name = "攻城炮",
		c_res_id = "H21050",
		id = 1
	},
	{
		effect = "E21070",
		item_id = 72106,
		name = "雷迎",
		c_res_id = "H21070",
		id = 2
	},
	{
		effect = "E21020",
		item_id = 72107,
		name = "大炎戒·炎帝",
		c_res_id = "H21020",
		id = 3
	},
	{
		effect = "E21010",
		item_id = 72102,
		name = "黑暗笼罩",
		c_res_id = "H21010",
		id = 4
	},
	{
		effect = "E21030",
		item_id = 72103,
		name = "冰河时代",
		c_res_id = "H21030",
		id = 5
	}
}
Config.HallowsData.data_info_length = 120
Config.HallowsData.data_info_cache = {}

function Config.HallowsData.data_info(slot0)
	if Config.HallowsData.data_info_cache[slot0] == nil then
		if not Config.HallowsData.data_info_table[slot0] then
			return
		end

		if not loadstring(string.format("return %s", slot1))() then
			return
		end

		Config.HallowsData.data_info_cache[slot0] = {
			id = slot1[1],
			step = slot1[2],
			name = slot1[3],
			attr = slot1[4],
			loss = slot1[5],
			max_lucky = slot1[6],
			clear_limit = slot1[7],
			clear_time = slot1[8],
			notice = slot1[9],
			effect = slot1[10]
		}
	end

	return Config.HallowsData.data_info_cache[slot0]
end

Config.HallowsData.data_info_table = {
	["4_5"] = "{4, 5, \"黑暗笼罩\", {{'hp_max',7065},{'atk',836}}, {{72001,10},{1,40000}}, 360, 0, 0, \"\", \"E21010\"}",
	["5_5"] = "{5, 5, \"冰河时代\", {{'hp_max',7065},{'atk',836}}, {{72001,10},{1,40000}}, 360, 0, 0, \"\", \"E21030\"}",
	["4_1"] = "{4, 1, \"黑暗笼罩\", {{'hp_max',471},{'atk',55}}, {{72001,2},{1,5000}}, 70, 0, 0, \"\", \"E21010\"}",
	["3_22"] = "{3, 22, \"大炎戒·炎帝\", {{'hp_max',119178},{'atk',14107}}, {{72001,74},{1,550000}}, 1570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>22</div>级！~ts\", \"E21020\"}",
	["3_23"] = "{3, 23, \"大炎戒·炎帝\", {{'hp_max',130012},{'atk',15389}}, {{72001,78},{1,598000}}, 1640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>23</div>级！~ts\", \"E21020\"}",
	["5_12"] = "{5, 12, \"冰河时代\", {{'hp_max',36742},{'atk',4349}}, {{72001,34},{1,180000}}, 860, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>12</div>级！~ts\", \"E21030\"}",
	["3_14"] = "{3, 14, \"大炎戒·炎帝\", {{'hp_max',49461},{'atk',5854}}, {{72001,42},{1,238000}}, 1000, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>14</div>级！~ts\", \"E21020\"}",
	["5_9"] = "{5, 9, \"冰河时代\", {{'hp_max',21197},{'atk',2509}}, {{72001,22},{1,108000}}, 640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>9</div>级！~ts\", \"E21030\"}",
	["5_11"] = "{5, 11, \"冰河时代\", {{'hp_max',31089},{'atk',3680}}, {{72001,30},{1,154000}}, 790, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>11</div>级！~ts\", \"E21030\"}",
	["3_6"] = "{3, 6, \"大炎戒·炎帝\", {{'hp_max',9892},{'atk',1170}}, {{72001,13},{1,54000}}, 430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>6</div>级！~ts\", \"E21020\"}",
	["5_23"] = "{5, 23, \"冰河时代\", {{'hp_max',130012},{'atk',15389}}, {{72001,78},{1,598000}}, 1640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>23</div>级！~ts\", \"E21030\"}",
	["5_22"] = "{5, 22, \"冰河时代\", {{'hp_max',119178},{'atk',14107}}, {{72001,74},{1,550000}}, 1570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>22</div>级！~ts\", \"E21030\"}",
	["4_24"] = "{4, 24, \"黑暗笼罩\", {{'hp_max',141789},{'atk',16784}}, {}, 0, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>24</div>级！~ts\", \"E21010\"}",
	["5_17"] = "{5, 17, \"冰河时代\", {{'hp_max',72072},{'atk',8531}}, {{72001,54},{1,340000}}, 1210, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>17</div>级！~ts\", \"E21030\"}",
	["4_6"] = "{4, 6, \"黑暗笼罩\", {{'hp_max',9892},{'atk',1170}}, {{72001,13},{1,54000}}, 430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>6</div>级！~ts\", \"E21010\"}",
	["1_6"] = "{1, 6, \"攻城炮\", {{'hp_max',9892},{'atk',1170}}, {{72001,13},{1,54000}}, 430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>6</div>级！~ts\", \"E21050\"}",
	["4_23"] = "{4, 23, \"黑暗笼罩\", {{'hp_max',130012},{'atk',15389}}, {{72001,78},{1,598000}}, 1640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>23</div>级！~ts\", \"E21010\"}",
	["4_22"] = "{4, 22, \"黑暗笼罩\", {{'hp_max',119178},{'atk',14107}}, {{72001,74},{1,550000}}, 1570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>22</div>级！~ts\", \"E21010\"}",
	["5_16"] = "{5, 16, \"冰河时代\", {{'hp_max',64064},{'atk',7583}}, {{72001,50},{1,304000}}, 1140, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>16</div>级！~ts\", \"E21030\"}",
	["5_14"] = "{5, 14, \"冰河时代\", {{'hp_max',49461},{'atk',5854}}, {{72001,42},{1,238000}}, 1000, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>14</div>级！~ts\", \"E21030\"}",
	["5_20"] = "{5, 20, \"冰河时代\", {{'hp_max',98922},{'atk',11709}}, {{72001,66},{1,460000}}, 1430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>20</div>级！~ts\", \"E21030\"}",
	["4_14"] = "{4, 14, \"黑暗笼罩\", {{'hp_max',49461},{'atk',5854}}, {{72001,42},{1,238000}}, 1000, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>14</div>级！~ts\", \"E21010\"}",
	["5_24"] = "{5, 24, \"冰河时代\", {{'hp_max',141789},{'atk',16784}}, {}, 0, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>24</div>级！~ts\", \"E21030\"}",
	["4_17"] = "{4, 17, \"黑暗笼罩\", {{'hp_max',72072},{'atk',8531}}, {{72001,54},{1,340000}}, 1210, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>17</div>级！~ts\", \"E21010\"}",
	["3_24"] = "{3, 24, \"大炎戒·炎帝\", {{'hp_max',141789},{'atk',16784}}, {}, 0, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>24</div>级！~ts\", \"E21020\"}",
	["4_21"] = "{4, 21, \"黑暗笼罩\", {{'hp_max',108814},{'atk',12880}}, {{72001,70},{1,504000}}, 1500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>21</div>级！~ts\", \"E21010\"}",
	["4_20"] = "{4, 20, \"黑暗笼罩\", {{'hp_max',98922},{'atk',11709}}, {{72001,66},{1,460000}}, 1430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>20</div>级！~ts\", \"E21010\"}",
	["5_13"] = "{5, 13, \"冰河时代\", {{'hp_max',42866},{'atk',5074}}, {{72001,38},{1,208000}}, 930, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>13</div>级！~ts\", \"E21030\"}",
	["3_12"] = "{3, 12, \"大炎戒·炎帝\", {{'hp_max',36742},{'atk',4349}}, {{72001,34},{1,180000}}, 860, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>12</div>级！~ts\", \"E21020\"}",
	["3_10"] = "{3, 10, \"大炎戒·炎帝\", {{'hp_max',25908},{'atk',3066}}, {{72001,26},{1,130000}}, 710, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>10</div>级！~ts\", \"E21020\"}",
	["3_16"] = "{3, 16, \"大炎戒·炎帝\", {{'hp_max',64064},{'atk',7583}}, {{72001,50},{1,304000}}, 1140, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>16</div>级！~ts\", \"E21020\"}",
	["3_13"] = "{3, 13, \"大炎戒·炎帝\", {{'hp_max',42866},{'atk',5074}}, {{72001,38},{1,208000}}, 930, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>13</div>级！~ts\", \"E21020\"}",
	["3_11"] = "{3, 11, \"大炎戒·炎帝\", {{'hp_max',31089},{'atk',3680}}, {{72001,30},{1,154000}}, 790, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>11</div>级！~ts\", \"E21020\"}",
	["3_17"] = "{3, 17, \"大炎戒·炎帝\", {{'hp_max',72072},{'atk',8531}}, {{72001,54},{1,340000}}, 1210, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>17</div>级！~ts\", \"E21020\"}",
	["3_15"] = "{3, 15, \"大炎戒·炎帝\", {{'hp_max',56527},{'atk',6691}}, {{72001,46},{1,270000}}, 1070, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>15</div>级！~ts\", \"E21020\"}",
	["2_14"] = "{2, 14, \"雷迎\", {{'hp_max',49461},{'atk',5854}}, {{72001,42},{1,238000}}, 1000, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>14</div>级！~ts\", \"E21070\"}",
	["2_17"] = "{2, 17, \"雷迎\", {{'hp_max',72072},{'atk',8531}}, {{72001,54},{1,340000}}, 1210, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>17</div>级！~ts\", \"E21070\"}",
	["3_21"] = "{3, 21, \"大炎戒·炎帝\", {{'hp_max',108814},{'atk',12880}}, {{72001,70},{1,504000}}, 1500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>21</div>级！~ts\", \"E21020\"}",
	["3_20"] = "{3, 20, \"大炎戒·炎帝\", {{'hp_max',98922},{'atk',11709}}, {{72001,66},{1,460000}}, 1430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>20</div>级！~ts\", \"E21020\"}",
	["1_12"] = "{1, 12, \"攻城炮\", {{'hp_max',36742},{'atk',4349}}, {{72001,34},{1,180000}}, 860, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>12</div>级！~ts\", \"E21050\"}",
	["1_22"] = "{1, 22, \"攻城炮\", {{'hp_max',119178},{'atk',14107}}, {{72001,74},{1,550000}}, 1570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>22</div>级！~ts\", \"E21050\"}",
	["2_21"] = "{2, 21, \"雷迎\", {{'hp_max',108814},{'atk',12880}}, {{72001,70},{1,504000}}, 1500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>21</div>级！~ts\", \"E21070\"}",
	["2_20"] = "{2, 20, \"雷迎\", {{'hp_max',98922},{'atk',11709}}, {{72001,66},{1,460000}}, 1430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>20</div>级！~ts\", \"E21070\"}",
	["1_11"] = "{1, 11, \"攻城炮\", {{'hp_max',31089},{'atk',3680}}, {{72001,30},{1,154000}}, 790, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>11</div>级！~ts\", \"E21050\"}",
	["2_24"] = "{2, 24, \"雷迎\", {{'hp_max',141789},{'atk',16784}}, {}, 0, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>24</div>级！~ts\", \"E21070\"}",
	["1_15"] = "{1, 15, \"攻城炮\", {{'hp_max',56527},{'atk',6691}}, {{72001,46},{1,270000}}, 1070, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>15</div>级！~ts\", \"E21050\"}",
	["4_8"] = "{4, 8, \"黑暗笼罩\", {{'hp_max',16958},{'atk',2007}}, {{72001,19},{1,88000}}, 570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>8</div>级！~ts\", \"E21010\"}",
	["5_8"] = "{5, 8, \"冰河时代\", {{'hp_max',16958},{'atk',2007}}, {{72001,19},{1,88000}}, 570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>8</div>级！~ts\", \"E21030\"}",
	["5_19"] = "{5, 19, \"冰河时代\", {{'hp_max',89501},{'atk',10594}}, {{72001,62},{1,418000}}, 1360, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>19</div>级！~ts\", \"E21030\"}",
	["3_5"] = "{3, 5, \"大炎戒·炎帝\", {{'hp_max',7065},{'atk',836}}, {{72001,10},{1,40000}}, 360, 0, 0, \"\", \"E21020\"}",
	["3_1"] = "{3, 1, \"大炎戒·炎帝\", {{'hp_max',471},{'atk',55}}, {{72001,2},{1,5000}}, 70, 0, 0, \"\", \"E21020\"}",
	["2_13"] = "{2, 13, \"雷迎\", {{'hp_max',42866},{'atk',5074}}, {{72001,38},{1,208000}}, 930, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>13</div>级！~ts\", \"E21070\"}",
	["2_23"] = "{2, 23, \"雷迎\", {{'hp_max',130012},{'atk',15389}}, {{72001,78},{1,598000}}, 1640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>23</div>级！~ts\", \"E21070\"}",
	["5_18"] = "{5, 18, \"冰河时代\", {{'hp_max',80551},{'atk',9535}}, {{72001,58},{1,378000}}, 1290, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>18</div>级！~ts\", \"E21030\"}",
	["2_22"] = "{2, 22, \"雷迎\", {{'hp_max',119178},{'atk',14107}}, {{72001,74},{1,550000}}, 1570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>22</div>级！~ts\", \"E21070\"}",
	["4_18"] = "{4, 18, \"黑暗笼罩\", {{'hp_max',80551},{'atk',9535}}, {{72001,58},{1,378000}}, 1290, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>18</div>级！~ts\", \"E21010\"}",
	["4_16"] = "{4, 16, \"黑暗笼罩\", {{'hp_max',64064},{'atk',7583}}, {{72001,50},{1,304000}}, 1140, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>16</div>级！~ts\", \"E21010\"}",
	["1_7"] = "{1, 7, \"攻城炮\", {{'hp_max',13189},{'atk',1561}}, {{72001,16},{1,70000}}, 500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>7</div>级！~ts\", \"E21050\"}",
	["4_19"] = "{4, 19, \"黑暗笼罩\", {{'hp_max',89501},{'atk',10594}}, {{72001,62},{1,418000}}, 1360, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>19</div>级！~ts\", \"E21010\"}",
	["3_7"] = "{3, 7, \"大炎戒·炎帝\", {{'hp_max',13189},{'atk',1561}}, {{72001,16},{1,70000}}, 500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>7</div>级！~ts\", \"E21020\"}",
	["1_18"] = "{1, 18, \"攻城炮\", {{'hp_max',80551},{'atk',9535}}, {{72001,58},{1,378000}}, 1290, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>18</div>级！~ts\", \"E21050\"}",
	["5_7"] = "{5, 7, \"冰河时代\", {{'hp_max',13189},{'atk',1561}}, {{72001,16},{1,70000}}, 500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>7</div>级！~ts\", \"E21030\"}",
	["4_11"] = "{4, 11, \"黑暗笼罩\", {{'hp_max',31089},{'atk',3680}}, {{72001,30},{1,154000}}, 790, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>11</div>级！~ts\", \"E21010\"}",
	["2_16"] = "{2, 16, \"雷迎\", {{'hp_max',64064},{'atk',7583}}, {{72001,50},{1,304000}}, 1140, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>16</div>级！~ts\", \"E21070\"}",
	["2_15"] = "{2, 15, \"雷迎\", {{'hp_max',56527},{'atk',6691}}, {{72001,46},{1,270000}}, 1070, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>15</div>级！~ts\", \"E21070\"}",
	["3_18"] = "{3, 18, \"大炎戒·炎帝\", {{'hp_max',80551},{'atk',9535}}, {{72001,58},{1,378000}}, 1290, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>18</div>级！~ts\", \"E21020\"}",
	["4_10"] = "{4, 10, \"黑暗笼罩\", {{'hp_max',25908},{'atk',3066}}, {{72001,26},{1,130000}}, 710, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>10</div>级！~ts\", \"E21010\"}",
	["3_8"] = "{3, 8, \"大炎戒·炎帝\", {{'hp_max',16958},{'atk',2007}}, {{72001,19},{1,88000}}, 570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>8</div>级！~ts\", \"E21020\"}",
	["3_19"] = "{3, 19, \"大炎戒·炎帝\", {{'hp_max',89501},{'atk',10594}}, {{72001,62},{1,418000}}, 1360, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>19</div>级！~ts\", \"E21020\"}",
	["2_12"] = "{2, 12, \"雷迎\", {{'hp_max',36742},{'atk',4349}}, {{72001,34},{1,180000}}, 860, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>12</div>级！~ts\", \"E21070\"}",
	["2_11"] = "{2, 11, \"雷迎\", {{'hp_max',31089},{'atk',3680}}, {{72001,30},{1,154000}}, 790, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>11</div>级！~ts\", \"E21070\"}",
	["2_19"] = "{2, 19, \"雷迎\", {{'hp_max',89501},{'atk',10594}}, {{72001,62},{1,418000}}, 1360, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>19</div>级！~ts\", \"E21070\"}",
	["3_2"] = "{3, 2, \"大炎戒·炎帝\", {{'hp_max',1413},{'atk',167}}, {{72001,4},{1,10000}}, 140, 0, 0, \"\", \"E21020\"}",
	["2_10"] = "{2, 10, \"雷迎\", {{'hp_max',25908},{'atk',3066}}, {{72001,26},{1,130000}}, 710, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>10</div>级！~ts\", \"E21070\"}",
	["5_2"] = "{5, 2, \"冰河时代\", {{'hp_max',1413},{'atk',167}}, {{72001,4},{1,10000}}, 140, 0, 0, \"\", \"E21030\"}",
	["2_2"] = "{2, 2, \"雷迎\", {{'hp_max',1413},{'atk',167}}, {{72001,4},{1,10000}}, 140, 0, 0, \"\", \"E21070\"}",
	["2_7"] = "{2, 7, \"雷迎\", {{'hp_max',13189},{'atk',1561}}, {{72001,16},{1,70000}}, 500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>7</div>级！~ts\", \"E21070\"}",
	["4_2"] = "{4, 2, \"黑暗笼罩\", {{'hp_max',1413},{'atk',167}}, {{72001,4},{1,10000}}, 140, 0, 0, \"\", \"E21010\"}",
	["2_6"] = "{2, 6, \"雷迎\", {{'hp_max',9892},{'atk',1170}}, {{72001,13},{1,54000}}, 430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>6</div>级！~ts\", \"E21070\"}",
	["1_19"] = "{1, 19, \"攻城炮\", {{'hp_max',89501},{'atk',10594}}, {{72001,62},{1,418000}}, 1360, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>19</div>级！~ts\", \"E21050\"}",
	["2_8"] = "{2, 8, \"雷迎\", {{'hp_max',16958},{'atk',2007}}, {{72001,19},{1,88000}}, 570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>8</div>级！~ts\", \"E21070\"}",
	["1_24"] = "{1, 24, \"攻城炮\", {{'hp_max',141789},{'atk',16784}}, {}, 0, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>24</div>级！~ts\", \"E21050\"}",
	["1_23"] = "{1, 23, \"攻城炮\", {{'hp_max',130012},{'atk',15389}}, {{72001,78},{1,598000}}, 1640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>23</div>级！~ts\", \"E21050\"}",
	["4_13"] = "{4, 13, \"黑暗笼罩\", {{'hp_max',42866},{'atk',5074}}, {{72001,38},{1,208000}}, 930, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>13</div>级！~ts\", \"E21010\"}",
	["4_7"] = "{4, 7, \"黑暗笼罩\", {{'hp_max',13189},{'atk',1561}}, {{72001,16},{1,70000}}, 500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>7</div>级！~ts\", \"E21010\"}",
	["1_21"] = "{1, 21, \"攻城炮\", {{'hp_max',108814},{'atk',12880}}, {{72001,70},{1,504000}}, 1500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>21</div>级！~ts\", \"E21050\"}",
	["1_20"] = "{1, 20, \"攻城炮\", {{'hp_max',98922},{'atk',11709}}, {{72001,66},{1,460000}}, 1430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>20</div>级！~ts\", \"E21050\"}",
	["2_5"] = "{2, 5, \"雷迎\", {{'hp_max',7065},{'atk',836}}, {{72001,10},{1,40000}}, 360, 0, 0, \"\", \"E21070\"}",
	["2_18"] = "{2, 18, \"雷迎\", {{'hp_max',80551},{'atk',9535}}, {{72001,58},{1,378000}}, 1290, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>18</div>级！~ts\", \"E21070\"}",
	["1_9"] = "{1, 9, \"攻城炮\", {{'hp_max',21197},{'atk',2509}}, {{72001,22},{1,108000}}, 640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>9</div>级！~ts\", \"E21050\"}",
	["1_16"] = "{1, 16, \"攻城炮\", {{'hp_max',64064},{'atk',7583}}, {{72001,50},{1,304000}}, 1140, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>16</div>级！~ts\", \"E21050\"}",
	["3_9"] = "{3, 9, \"大炎戒·炎帝\", {{'hp_max',21197},{'atk',2509}}, {{72001,22},{1,108000}}, 640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将大炎戒·炎帝升级为<div fontcolor=#e28700>9</div>级！~ts\", \"E21020\"}",
	["4_15"] = "{4, 15, \"黑暗笼罩\", {{'hp_max',56527},{'atk',6691}}, {{72001,46},{1,270000}}, 1070, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>15</div>级！~ts\", \"E21010\"}",
	["5_1"] = "{5, 1, \"冰河时代\", {{'hp_max',471},{'atk',55}}, {{72001,2},{1,5000}}, 70, 0, 0, \"\", \"E21030\"}",
	["1_14"] = "{1, 14, \"攻城炮\", {{'hp_max',49461},{'atk',5854}}, {{72001,42},{1,238000}}, 1000, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>14</div>级！~ts\", \"E21050\"}",
	["1_13"] = "{1, 13, \"攻城炮\", {{'hp_max',42866},{'atk',5074}}, {{72001,38},{1,208000}}, 930, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>13</div>级！~ts\", \"E21050\"}",
	["4_9"] = "{4, 9, \"黑暗笼罩\", {{'hp_max',21197},{'atk',2509}}, {{72001,22},{1,108000}}, 640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>9</div>级！~ts\", \"E21010\"}",
	["4_12"] = "{4, 12, \"黑暗笼罩\", {{'hp_max',36742},{'atk',4349}}, {{72001,34},{1,180000}}, 860, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将黑暗笼罩升级为<div fontcolor=#e28700>12</div>级！~ts\", \"E21010\"}",
	["5_10"] = "{5, 10, \"冰河时代\", {{'hp_max',25908},{'atk',3066}}, {{72001,26},{1,130000}}, 710, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>10</div>级！~ts\", \"E21030\"}",
	["5_6"] = "{5, 6, \"冰河时代\", {{'hp_max',9892},{'atk',1170}}, {{72001,13},{1,54000}}, 430, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>6</div>级！~ts\", \"E21030\"}",
	["1_10"] = "{1, 10, \"攻城炮\", {{'hp_max',25908},{'atk',3066}}, {{72001,26},{1,130000}}, 710, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>10</div>级！~ts\", \"E21050\"}",
	["1_17"] = "{1, 17, \"攻城炮\", {{'hp_max',72072},{'atk',8531}}, {{72001,54},{1,340000}}, 1210, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>17</div>级！~ts\", \"E21050\"}",
	["2_9"] = "{2, 9, \"雷迎\", {{'hp_max',21197},{'atk',2509}}, {{72001,22},{1,108000}}, 640, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将雷迎升级为<div fontcolor=#e28700>9</div>级！~ts\", \"E21070\"}",
	["1_8"] = "{1, 8, \"攻城炮\", {{'hp_max',16958},{'atk',2007}}, {{72001,19},{1,88000}}, 570, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将攻城炮升级为<div fontcolor=#e28700>8</div>级！~ts\", \"E21050\"}",
	["5_21"] = "{5, 21, \"冰河时代\", {{'hp_max',108814},{'atk',12880}}, {{72001,70},{1,504000}}, 1500, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>21</div>级！~ts\", \"E21030\"}",
	["5_15"] = "{5, 15, \"冰河时代\", {{'hp_max',56527},{'atk',6691}}, {{72001,46},{1,270000}}, 1070, 0, 0, \"远处一道圣光冲破天际，船长<div fontcolor=#e28700>~ts</div>成功将冰河时代升级为<div fontcolor=#e28700>15</div>级！~ts\", \"E21030\"}",
	["1_5"] = "{1, 5, \"攻城炮\", {{'hp_max',7065},{'atk',836}}, {{72001,10},{1,40000}}, 360, 0, 0, \"\", \"E21050\"}",
	["1_4"] = "{1, 4, \"攻城炮\", {{'hp_max',4710},{'atk',557}}, {{72001,8},{1,28000}}, 290, 0, 0, \"\", \"E21050\"}",
	["2_4"] = "{2, 4, \"雷迎\", {{'hp_max',4710},{'atk',557}}, {{72001,8},{1,28000}}, 290, 0, 0, \"\", \"E21070\"}",
	["3_4"] = "{3, 4, \"大炎戒·炎帝\", {{'hp_max',4710},{'atk',557}}, {{72001,8},{1,28000}}, 290, 0, 0, \"\", \"E21020\"}",
	["4_4"] = "{4, 4, \"黑暗笼罩\", {{'hp_max',4710},{'atk',557}}, {{72001,8},{1,28000}}, 290, 0, 0, \"\", \"E21010\"}",
	["5_4"] = "{5, 4, \"冰河时代\", {{'hp_max',4710},{'atk',557}}, {{72001,8},{1,28000}}, 290, 0, 0, \"\", \"E21030\"}",
	["1_2"] = "{1, 2, \"攻城炮\", {{'hp_max',1413},{'atk',167}}, {{72001,4},{1,10000}}, 140, 0, 0, \"\", \"E21050\"}",
	["1_1"] = "{1, 1, \"攻城炮\", {{'hp_max',471},{'atk',55}}, {{72001,2},{1,5000}}, 70, 0, 0, \"\", \"E21050\"}",
	["2_1"] = "{2, 1, \"雷迎\", {{'hp_max',471},{'atk',55}}, {{72001,2},{1,5000}}, 70, 0, 0, \"\", \"E21070\"}",
	["1_3"] = "{1, 3, \"攻城炮\", {{'hp_max',2826},{'atk',334}}, {{72001,6},{1,18000}}, 210, 0, 0, \"\", \"E21050\"}",
	["2_3"] = "{2, 3, \"雷迎\", {{'hp_max',2826},{'atk',334}}, {{72001,6},{1,18000}}, 210, 0, 0, \"\", \"E21070\"}",
	["3_3"] = "{3, 3, \"大炎戒·炎帝\", {{'hp_max',2826},{'atk',334}}, {{72001,6},{1,18000}}, 210, 0, 0, \"\", \"E21020\"}",
	["4_3"] = "{4, 3, \"黑暗笼罩\", {{'hp_max',2826},{'atk',334}}, {{72001,6},{1,18000}}, 210, 0, 0, \"\", \"E21010\"}",
	["5_3"] = "{5, 3, \"冰河时代\", {{'hp_max',2826},{'atk',334}}, {{72001,6},{1,18000}}, 210, 0, 0, \"\", \"E21030\"}"
}
Config.HallowsData.data_skill_up_length = 60
Config.HallowsData.data_skill_up_cache = {}

function Config.HallowsData.data_skill_up(slot0)
	if Config.HallowsData.data_skill_up_cache[slot0] == nil then
		if not Config.HallowsData.data_skill_up_table[slot0] then
			return
		end

		if not loadstring(string.format("return %s", slot1))() then
			return
		end

		Config.HallowsData.data_skill_up_cache[slot0] = {
			lose = slot1[1],
			skill_bid = slot1[2],
			lev_limit = slot1[3]
		}
	end

	return Config.HallowsData.data_skill_up_cache[slot0]
end

Config.HallowsData.data_skill_up_table = {
	["3_7"] = "{{{72002,100},{1,2900000}}, 803007, 16}",
	["3_11"] = "{{{72002,180},{1,6700000}}, 803011, 24}",
	["3_9"] = "{{{72002,140},{1,4600000}}, 803009, 20}",
	["3_10"] = "{{{72002,160},{1,5600000}}, 803010, 22}",
	["3_12"] = "{{}, 803012, 0}",
	["4_1"] = "{{{72002,10},{1,200000}}, 805001, 4}",
	["4_4"] = "{{{72002,40},{1,1100000}}, 805004, 10}",
	["5_12"] = "{{}, 807012, 0}",
	["3_2"] = "{{{72002,20},{1,400000}}, 803002, 6}",
	["3_6"] = "{{{72002,80},{1,2200000}}, 803006, 14}",
	["5_2"] = "{{{72002,20},{1,400000}}, 807002, 6}",
	["2_2"] = "{{{72002,20},{1,400000}}, 802002, 6}",
	["2_6"] = "{{{72002,80},{1,2200000}}, 802006, 14}",
	["4_2"] = "{{{72002,20},{1,400000}}, 805002, 6}",
	["4_6"] = "{{{72002,80},{1,2200000}}, 805006, 14}",
	["1_6"] = "{{{72002,80},{1,2200000}}, 801006, 14}",
	["5_1"] = "{{{72002,10},{1,200000}}, 807001, 4}",
	["5_10"] = "{{{72002,160},{1,5600000}}, 807010, 22}",
	["4_12"] = "{{}, 805012, 0}",
	["4_10"] = "{{{72002,160},{1,5600000}}, 805010, 22}",
	["4_7"] = "{{{72002,100},{1,2900000}}, 805007, 16}",
	["3_1"] = "{{{72002,10},{1,200000}}, 803001, 4}",
	["4_11"] = "{{{72002,180},{1,6700000}}, 805011, 24}",
	["2_12"] = "{{}, 802012, 0}",
	["2_7"] = "{{{72002,100},{1,2900000}}, 802007, 16}",
	["1_9"] = "{{{72002,140},{1,4600000}}, 801009, 20}",
	["2_4"] = "{{{72002,40},{1,1100000}}, 802004, 10}",
	["3_5"] = "{{{72002,60},{1,1600000}}, 803005, 12}",
	["5_11"] = "{{{72002,180},{1,6700000}}, 807011, 24}",
	["5_5"] = "{{{72002,60},{1,1600000}}, 807005, 12}",
	["2_5"] = "{{{72002,60},{1,1600000}}, 802005, 12}",
	["5_9"] = "{{{72002,140},{1,4600000}}, 807009, 20}",
	["4_5"] = "{{{72002,60},{1,1600000}}, 805005, 12}",
	["2_10"] = "{{{72002,160},{1,5600000}}, 802010, 22}",
	["5_4"] = "{{{72002,40},{1,1100000}}, 807004, 10}",
	["5_6"] = "{{{72002,80},{1,2200000}}, 807006, 14}",
	["2_11"] = "{{{72002,180},{1,6700000}}, 802011, 24}",
	["1_8"] = "{{{72002,120},{1,3700000}}, 801008, 18}",
	["2_9"] = "{{{72002,140},{1,4600000}}, 802009, 20}",
	["1_12"] = "{{}, 801012, 0}",
	["1_10"] = "{{{72002,160},{1,5600000}}, 801010, 22}",
	["1_7"] = "{{{72002,100},{1,2900000}}, 801007, 16}",
	["4_9"] = "{{{72002,140},{1,4600000}}, 805009, 20}",
	["1_11"] = "{{{72002,180},{1,6700000}}, 801011, 24}",
	["2_8"] = "{{{72002,120},{1,3700000}}, 802008, 18}",
	["3_4"] = "{{{72002,40},{1,1100000}}, 803004, 10}",
	["4_8"] = "{{{72002,120},{1,3700000}}, 805008, 18}",
	["5_8"] = "{{{72002,120},{1,3700000}}, 807008, 18}",
	["1_5"] = "{{{72002,60},{1,1600000}}, 801005, 12}",
	["1_4"] = "{{{72002,40},{1,1100000}}, 801004, 10}",
	["1_2"] = "{{{72002,20},{1,400000}}, 801002, 6}",
	["1_1"] = "{{{72002,10},{1,200000}}, 801001, 4}",
	["3_8"] = "{{{72002,120},{1,3700000}}, 803008, 18}",
	["2_1"] = "{{{72002,10},{1,200000}}, 802001, 4}",
	["1_3"] = "{{{72002,30},{1,700000}}, 801003, 8}",
	["2_3"] = "{{{72002,30},{1,700000}}, 802003, 8}",
	["3_3"] = "{{{72002,30},{1,700000}}, 803003, 8}",
	["4_3"] = "{{{72002,30},{1,700000}}, 805003, 8}",
	["5_3"] = "{{{72002,30},{1,700000}}, 807003, 8}",
	["5_7"] = "{{{72002,100},{1,2900000}}, 807007, 16}"
}
Config.HallowsData.data_get_gather_length = 0
Config.HallowsData.data_get_gather = {}

function Config.HallowsData.data_get_gather_fun(slot0)
	slot1 = Config.HallowsData.data_get_gather[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HallowsData.data_get_gather[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HallowsData.data_skill_max_lev_length = 5
Config.HallowsData.data_skill_max_lev = {
	12,
	12,
	12,
	12,
	12
}
Config.HallowsData.data_trace_cost_length = 120
Config.HallowsData.data_trace_cost_cache = {}

function Config.HallowsData.data_trace_cost(slot0)
	if Config.HallowsData.data_trace_cost_cache[slot0] == nil then
		if not Config.HallowsData.data_trace_cost_table[slot0] then
			return
		end

		if not loadstring(string.format("return %s", slot1))() then
			return
		end

		Config.HallowsData.data_trace_cost_cache[slot0] = {
			num = slot1[1]
		}
	end

	return Config.HallowsData.data_trace_cost_cache[slot0]
end

Config.HallowsData.data_trace_cost_table = {
	["4_5"] = "{10}",
	["5_5"] = "{10}",
	["4_1"] = "{0}",
	["3_22"] = "{95}",
	["3_23"] = "{100}",
	["5_12"] = "{45}",
	["3_14"] = "{55}",
	["5_9"] = "{30}",
	["5_11"] = "{40}",
	["3_6"] = "{15}",
	["5_23"] = "{100}",
	["5_22"] = "{95}",
	["4_24"] = "{105}",
	["5_17"] = "{70}",
	["4_6"] = "{15}",
	["1_6"] = "{15}",
	["4_23"] = "{100}",
	["4_22"] = "{95}",
	["5_16"] = "{65}",
	["5_14"] = "{55}",
	["5_20"] = "{85}",
	["4_14"] = "{55}",
	["5_24"] = "{105}",
	["4_17"] = "{70}",
	["3_24"] = "{105}",
	["4_21"] = "{90}",
	["4_20"] = "{85}",
	["5_13"] = "{50}",
	["3_12"] = "{45}",
	["3_10"] = "{35}",
	["3_16"] = "{65}",
	["3_13"] = "{50}",
	["3_11"] = "{40}",
	["3_17"] = "{70}",
	["3_15"] = "{60}",
	["2_14"] = "{55}",
	["2_17"] = "{70}",
	["3_21"] = "{90}",
	["3_20"] = "{85}",
	["1_12"] = "{45}",
	["1_22"] = "{95}",
	["2_21"] = "{90}",
	["2_20"] = "{85}",
	["1_11"] = "{40}",
	["2_24"] = "{105}",
	["1_15"] = "{60}",
	["4_8"] = "{25}",
	["5_8"] = "{25}",
	["5_19"] = "{80}",
	["3_5"] = "{10}",
	["3_1"] = "{0}",
	["2_13"] = "{50}",
	["2_23"] = "{100}",
	["5_18"] = "{75}",
	["2_22"] = "{95}",
	["4_18"] = "{75}",
	["4_16"] = "{65}",
	["1_7"] = "{20}",
	["4_19"] = "{80}",
	["3_7"] = "{20}",
	["1_18"] = "{75}",
	["5_7"] = "{20}",
	["4_11"] = "{40}",
	["2_16"] = "{65}",
	["2_15"] = "{60}",
	["3_18"] = "{75}",
	["4_10"] = "{35}",
	["3_8"] = "{25}",
	["3_19"] = "{80}",
	["2_12"] = "{45}",
	["2_11"] = "{40}",
	["2_19"] = "{80}",
	["3_2"] = "{0}",
	["2_10"] = "{35}",
	["5_2"] = "{0}",
	["2_2"] = "{0}",
	["2_7"] = "{20}",
	["4_2"] = "{0}",
	["2_6"] = "{15}",
	["1_19"] = "{80}",
	["2_8"] = "{25}",
	["1_24"] = "{105}",
	["1_23"] = "{100}",
	["4_13"] = "{50}",
	["4_7"] = "{20}",
	["1_21"] = "{90}",
	["1_20"] = "{85}",
	["2_5"] = "{10}",
	["2_18"] = "{75}",
	["1_9"] = "{30}",
	["1_16"] = "{65}",
	["3_9"] = "{30}",
	["4_15"] = "{60}",
	["5_1"] = "{0}",
	["1_14"] = "{55}",
	["1_13"] = "{50}",
	["4_9"] = "{30}",
	["4_12"] = "{45}",
	["5_10"] = "{35}",
	["5_6"] = "{15}",
	["1_10"] = "{35}",
	["1_17"] = "{70}",
	["2_9"] = "{30}",
	["1_8"] = "{25}",
	["5_21"] = "{90}",
	["5_15"] = "{60}",
	["1_5"] = "{10}",
	["1_4"] = "{5}",
	["2_4"] = "{5}",
	["3_4"] = "{5}",
	["4_4"] = "{5}",
	["5_4"] = "{5}",
	["1_2"] = "{0}",
	["1_1"] = "{0}",
	["2_1"] = "{0}",
	["1_3"] = "{3}",
	["2_3"] = "{3}",
	["3_3"] = "{3}",
	["4_3"] = "{3}",
	["5_3"] = "{3}"
}
Config.HallowsData.data_attr_radio_length = 4
Config.HallowsData.data_attr_radio = {
	[4] = {
		type = 4,
		ratio = {
			{
				"atk",
				1000
			},
			{
				"hp_max",
				1000
			}
		}
	},
	[3] = {
		type = 3,
		ratio = {
			{
				"atk",
				1000
			},
			{
				"hp_max",
				1000
			}
		}
	},
	[2] = {
		type = 2,
		ratio = {
			{
				"atk",
				1000
			},
			{
				"hp_max",
				1000
			}
		}
	},
	[5] = {
		type = 5,
		ratio = {
			{
				"atk",
				1000
			},
			{
				"hp_max",
				1000
			}
		}
	}
}

function Config.HallowsData.data_attr_radio_fun(slot0)
	slot1 = Config.HallowsData.data_attr_radio[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HallowsData.data_attr_radio[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HallowsData.data_task_length = 20
Config.HallowsData.data_task = {
	[101] = {
		hid = 1,
		id = 101,
		desc = "通关剧情关卡2",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_dungeon_pass",
				target = 10020,
				target_val = 1,
				param = {
					"chapter"
				}
			}
		},
		extra = {}
	},
	[102] = {
		hid = 1,
		id = 102,
		desc = "冒险者等级5级",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_levup",
				target = 0,
				target_val = 5,
				param = {}
			}
		},
		extra = {}
	},
	[103] = {
		hid = 1,
		id = 103,
		desc = "1个英雄达到20级",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_partner",
				target = 0,
				target_val = 1,
				param = {
					{
						"lev",
						20
					}
				}
			}
		},
		extra = {
			"lev",
			20
		}
	},
	[104] = {
		hid = 1,
		id = 104,
		desc = "进行1次高级召唤",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_recruit",
				target = 300,
				target_val = 1,
				param = {}
			}
		},
		extra = {}
	},
	[201] = {
		hid = 2,
		id = 201,
		desc = "通关关卡20关",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_dungeon_pass",
				target = 10200,
				target_val = 1,
				param = {
					"chapter"
				}
			}
		},
		extra = {}
	},
	[202] = {
		hid = 2,
		id = 202,
		desc = "冒险者等级10级",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_levup",
				target = 0,
				target_val = 10,
				param = {}
			}
		},
		extra = {}
	},
	[203] = {
		hid = 2,
		id = 203,
		desc = "竞技场挑战3次",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_arena_fight",
				target = 0,
				target_val = 3,
				param = {}
			}
		},
		extra = {}
	},
	[204] = {
		hid = 2,
		id = 204,
		desc = "参加1次远航任务",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_shipping",
				target = 0,
				target_val = 1,
				param = {}
			}
		},
		extra = {}
	},
	[301] = {
		hid = 3,
		id = 301,
		desc = "通关关卡30关",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_dungeon_pass",
				target = 10300,
				target_val = 1,
				param = {
					"chapter"
				}
			}
		},
		extra = {}
	},
	[302] = {
		hid = 3,
		id = 302,
		desc = "冒险者等级15级",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_levup",
				target = 0,
				target_val = 15,
				param = {}
			}
		},
		extra = {}
	},
	[303] = {
		hid = 3,
		id = 303,
		desc = "快速作战1次",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_dungeon_fast_combat",
				target = 0,
				target_val = 1,
				param = {}
			}
		},
		extra = {}
	},
	[304] = {
		hid = 3,
		id = 304,
		desc = "精灵商店购买3次",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_mystery_buy",
				target = 4,
				target_val = 3,
				param = {}
			}
		},
		extra = {}
	},
	[401] = {
		hid = 4,
		id = 401,
		desc = "通关关卡50关",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_dungeon_pass",
				target = 20100,
				target_val = 1,
				param = {
					"chapter"
				}
			}
		},
		extra = {}
	},
	[402] = {
		hid = 4,
		id = 402,
		desc = "冒险者等级20级",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_levup",
				target = 0,
				target_val = 20,
				param = {}
			}
		},
		extra = {}
	},
	[403] = {
		hid = 4,
		id = 403,
		desc = "参与1次公会副本",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_guild_dun_fight",
				target = 0,
				target_val = 1,
				param = {}
			}
		},
		extra = {}
	},
	[404] = {
		hid = 4,
		id = 404,
		desc = "试练塔通关10层",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_star_tower_floor_pass",
				target = 0,
				target_val = 10,
				param = {}
			}
		},
		extra = {}
	},
	[501] = {
		hid = 5,
		id = 501,
		desc = "通关关卡70关",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_dungeon_pass",
				target = 20300,
				target_val = 1,
				param = {
					"chapter"
				}
			}
		},
		extra = {}
	},
	[502] = {
		hid = 5,
		id = 502,
		desc = "冒险者等级25级",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_levup",
				target = 0,
				target_val = 25,
				param = {}
			}
		},
		extra = {}
	},
	[503] = {
		hid = 5,
		id = 503,
		desc = "总战力5万",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_power",
				target = 0,
				target_val = 50000,
				param = {}
			}
		},
		extra = {}
	},
	[504] = {
		hid = 5,
		id = 504,
		desc = "合成5星英雄",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_partner_star_up",
				target = 5,
				target_val = 1,
				param = {}
			}
		},
		extra = {}
	}
}

function Config.HallowsData.data_task_fun(slot0)
	slot1 = Config.HallowsData.data_task[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HallowsData.data_task[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HallowsData.data_task_info_length = 5
Config.HallowsData.data_task_info = {
	{
		101,
		102,
		103,
		104
	},
	[5] = {
		501,
		502,
		503,
		504
	},
	[4] = {
		401,
		402,
		403,
		404
	},
	[3] = {
		301,
		302,
		303,
		304
	},
	[2] = {
		201,
		202,
		203,
		204
	}
}
Config.HallowsData.data_skill_attr_length = 5
Config.HallowsData.data_skill_attr = {
	{
		{
			lev_limit = 4,
			desc = "全队攻击+10%",
			hallows_id = 1,
			attr_id = 1,
			attr = {
				{
					"atk_per",
					100
				}
			}
		},
		{
			lev_limit = 8,
			desc = "全队命中+10%",
			hallows_id = 1,
			attr_id = 2,
			attr = {
				{
					"hit_rate",
					100
				}
			}
		},
		{
			lev_limit = 12,
			desc = "全队速度+40",
			hallows_id = 1,
			attr_id = 3,
			attr = {
				{
					"speed",
					40
				}
			}
		}
	},
	{
		{
			lev_limit = 4,
			desc = "全队防御+10%",
			hallows_id = 2,
			attr_id = 1,
			attr = {
				{
					"def_per",
					100
				}
			}
		},
		{
			lev_limit = 8,
			desc = "全队免伤+10%",
			hallows_id = 2,
			attr_id = 2,
			attr = {
				{
					"res",
					100
				}
			}
		},
		{
			lev_limit = 12,
			desc = "全队速度+40",
			hallows_id = 2,
			attr_id = 3,
			attr = {
				{
					"speed",
					40
				}
			}
		}
	},
	{
		{
			lev_limit = 4,
			desc = "全队抗暴+10%",
			hallows_id = 3,
			attr_id = 1,
			attr = {
				{
					"tenacity",
					100
				}
			}
		},
		{
			lev_limit = 8,
			desc = "全队治疗被治疗+10%",
			hallows_id = 3,
			attr_id = 2,
			attr = {
				{
					"cure",
					100
				},
				{
					"be_cure",
					100
				}
			}
		},
		{
			lev_limit = 12,
			desc = "全队速度+40",
			hallows_id = 3,
			attr_id = 3,
			attr = {
				{
					"speed",
					40
				}
			}
		}
	},
	{
		{
			lev_limit = 4,
			desc = "全队闪避+10%",
			hallows_id = 4,
			attr_id = 1,
			attr = {
				{
					"dodge_rate",
					100
				}
			}
		},
		{
			lev_limit = 8,
			desc = "全队抗暴+10%",
			hallows_id = 4,
			attr_id = 2,
			attr = {
				{
					"tenacity",
					100
				}
			}
		},
		{
			lev_limit = 12,
			desc = "全队速度+40",
			hallows_id = 4,
			attr_id = 3,
			attr = {
				{
					"speed",
					40
				}
			}
		}
	},
	{
		{
			lev_limit = 4,
			desc = "全队暴击+10%",
			hallows_id = 5,
			attr_id = 1,
			attr = {
				{
					"crit_rate",
					100
				}
			}
		},
		{
			lev_limit = 8,
			desc = "全队暴伤+20%",
			hallows_id = 5,
			attr_id = 2,
			attr = {
				{
					"crit_ratio",
					200
				}
			}
		},
		{
			lev_limit = 12,
			desc = "全队速度+40",
			hallows_id = 5,
			attr_id = 3,
			attr = {
				{
					"speed",
					40
				}
			}
		}
	}
}
Config.HallowsData.data_magic_length = 4
Config.HallowsData.data_magic = {
	{
		name = "死神镰刀",
		effect = "E21080",
		time = 604800,
		is_item = 2,
		c_res_id = "H21080",
		sort = 3,
		evt_id = 121,
		desc = "全神器提升：生命2%，攻击2%\n可幻化该神器外观",
		item_id = 72109,
		id = 1,
		get_des = "周冠军赛前3名获得",
		attr = {
			{
				"hp_max_per",
				20
			},
			{
				"atk_per",
				20
			}
		},
		loss = {
			{
				72109,
				1
			}
		}
	},
	{
		name = "烈焰之剑",
		effect = "E21090",
		time = 0,
		is_item = 0,
		c_res_id = "H21090",
		sort = 1,
		evt_id = 0,
		desc = "开启超凡段位赛王者赛第二阵容\n全神器提升：生命3%，攻击3%\n可幻化该神器外观",
		item_id = 72110,
		id = 2,
		get_des = "",
		attr = {
			{
				"hp_max_per",
				30
			},
			{
				"atk_per",
				30
			}
		},
		loss = {}
	},
	{
		name = "海神三叉戟",
		effect = "E21014",
		time = 1209600,
		is_item = 2,
		c_res_id = "H21014",
		sort = 2,
		evt_id = 115,
		desc = "全神器提升：生命3%，攻击3%\n可幻化该神器外观",
		item_id = 72111,
		id = 3,
		get_des = "超凡段位赛超凡王者V结算获得",
		attr = {
			{
				"hp_max_per",
				30
			},
			{
				"atk_per",
				30
			}
		},
		loss = {
			{
				72111,
				1
			}
		}
	},
	{
		name = "精灵秘典",
		effect = "E21100",
		time = 2419200,
		is_item = 2,
		c_res_id = "H21100",
		sort = 4,
		evt_id = 124,
		desc = "全神器提升：生命5%，攻击5%\n可幻化该神器外观",
		item_id = 72112,
		id = 4,
		get_des = "巅峰冠军赛前3名获得",
		attr = {
			{
				"hp_max_per",
				50
			},
			{
				"atk_per",
				50
			}
		},
		loss = {
			{
				72112,
				1
			}
		}
	}
}

function Config.HallowsData.data_magic_fun(slot0)
	slot1 = Config.HallowsData.data_magic[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HallowsData.data_magic[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HallowsData.data_magic_task_length = 4
Config.HallowsData.data_magic_task = {
	[101] = {
		hid = 2,
		id = 101,
		desc = "冒险者等级70级",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_levup",
				target = 0,
				target_val = 70,
				param = {}
			}
		},
		extra = {}
	},
	[103] = {
		hid = 2,
		id = 103,
		desc = "精英赛达到王者段位",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_arena_elite_rank",
				target = 18,
				target_val = 1,
				param = {}
			}
		},
		extra = {}
	},
	[104] = {
		hid = 2,
		id = 104,
		desc = "拥有2个10星英雄",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_partner",
				target = 0,
				target_val = 2,
				param = {
					{
						"star",
						10
					}
				}
			}
		},
		extra = {
			"star",
			10
		}
	},
	[106] = {
		hid = 2,
		id = 106,
		desc = "先知圣殿召唤20次",
		items = {
			{
				3,
				50
			}
		},
		progress = {
			{
				cli_label = "evt_recruit_high",
				target = 0,
				target_val = 20,
				param = {}
			}
		},
		extra = {}
	}
}

function Config.HallowsData.data_magic_task_fun(slot0)
	slot1 = Config.HallowsData.data_magic_task[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HallowsData.data_magic_task[" .. slot0 .. "])not found")

		return
	end

	return slot1
end
