Config = Config or {}
Config.HorcruxData = Config.HorcruxData or {}
Config.HorcruxData.data_constant_length = 5
Config.HorcruxData.data_constant = {
	partner_awaken_loss = {
		code = "partner_awaken_loss",
		desc = "魂器觉醒消耗",
		val = {
			{
				10051,
				20
			}
		}
	},
	partner_awaken_limit = {
		code = "partner_awaken_limit",
		desc = "需要伙伴星级达到13星",
		val = {
			{
				"star_tower",
				1
			},
			{
				"partner_star",
				5
			}
		}
	},
	horcrux_rule = {
		code = "horcrux_rule",
		desc = [[
1.每个英雄的魂器属性和强化等级<div fontcolor=#d95014>相互独立</div>
2.不断强化，可为英雄带来属性提升
3.强化到达一定等级时（10、20、30、35），更可额外获得英雄的<div fontcolor=#d95014>技能强化</div>或<div fontcolor=#d95014>属性提升</div>
4.魂器30级后，继续强化需要英雄达到<div fontcolor=#d95014>13星</div>
5.魂器30级后，强化需要消耗的异能英雄本体（联动除外），其魂器养成材料将全部返还
6.<div fontcolor=#d95014>SP英雄</div>的魂器拥有专属<div fontcolor=#d95014>SP同调效果</div>，激活SP英雄魂器且同调英雄的魂器满级时生效]],
		val = {
			1
		}
	},
	item_effect_id = {
		code = "item_effect_id",
		desc = "魂器特效",
		val = {
			156
		}
	},
	replace_consume_partner = {
		code = "replace_consume_partner",
		desc = "魂器30级后使用特定道具的英雄",
		val = {
			60501
		}
	}
}

function Config.HorcruxData.data_constant_fun(slot0)
	slot1 = Config.HorcruxData.data_constant[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HorcruxData.data_constant[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HorcruxData.data_partner_horcrux_length = 97
Config.HorcruxData.data_partner_horcrux = {
	[10502] = {
		quality = 5,
		bid = 10502,
		horcrux_desc = "自然系的恶魔果实，能够将身体任何部分变为火焰，即使身体被击溃也能瞬间利用火焰重组，更能免疫物理与非霸气攻击。",
		horcrux_name = "烧烧果实",
		horcrux_synopsis = "自然系的恶魔果实，能够将身体任何部分变为火焰，即使身体被击溃也能瞬间利用火焰重组，更能免疫物理与非霸气攻击。",
		res_id = "10502",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【炎戒·阳火】提升一级"
			},
			{
				20,
				"【强化+20】  【烧烧果实】提升一级"
			},
			{
				30,
				"【强化+30】  【炎劫·神火】提升一级"
			},
			{
				35,
				"【强化+35】  【炙热领域】提升一级"
			}
		},
		sp_attrs = {}
	},
	[10503] = {
		quality = 5,
		bid = 10503,
		horcrux_desc = "堕落的海军少将“赤旗·德雷克”的右手利斧，因其有四刃而得此名。交战时德雷克会将武装色霸气缠绕于四刃斧之上以强化攻击力道。",
		horcrux_name = "四刃斧",
		horcrux_synopsis = "堕落的海军少将“赤旗·德雷克”的右手利斧，因其有四刃而得此名。交战时德雷克会将武装色霸气缠绕于四刃斧之上以强化攻击力道。",
		res_id = "10503",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【X·重锤】提升一级"
			},
			{
				20,
				"【强化+20】  【古龙种】提升一级"
			},
			{
				30,
				"【强化+30】  【X·剑术】提升一级"
			},
			{
				35,
				"【强化+35】  【龙威】提升一级"
			}
		},
		sp_attrs = {}
	},
	[10505] = {
		quality = 5,
		bid = 10505,
		horcrux_desc = "超人系的恶魔果实，使基德能够自由控制周遭的所有金属，甚至能把金属以外的事物都变为被金属吸引的磁铁。",
		horcrux_name = "磁磁果实",
		horcrux_synopsis = "超人系的恶魔果实，使基德能够自由控制周遭的所有金属，甚至能把金属以外的事物都变为被金属吸引的磁铁。",
		res_id = "10505",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【机械巨臂】提升一级"
			},
			{
				20,
				"【强化+20】  【机械掌控】提升一级"
			},
			{
				30,
				"【强化+30】  【机械弹射】提升一级"
			},
			{
				35,
				"【强化+35】  【磁力掌控】提升一级"
			}
		},
		sp_attrs = {}
	},
	[10510] = {
		quality = 5,
		bid = 10510,
		horcrux_desc = "自然系响雷果实，用武器敲击大鼓能召唤出雷电攻击。",
		horcrux_name = "响雷果实",
		horcrux_synopsis = "自然系响雷果实，用武器敲击大鼓能召唤出雷电攻击。",
		res_id = "10510",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【神之制裁】提升一级"
			},
			{
				20,
				"【强化+20】  【神之艾尼路】提升一级"
			},
			{
				30,
				"【强化+30】  【雷治金】提升一级"
			},
			{
				35,
				"【强化+35】  【心网】提升一级"
			}
		},
		sp_attrs = {}
	},
	[10512] = {
		quality = 5,
		bid = 10512,
		horcrux_desc = "一个维修工人都不会随身携带的东西，却和萨博形影不离，这是他和艾斯、路飞亲情的见证",
		horcrux_name = "亲情的水管",
		horcrux_synopsis = "一个维修工人都不会随身携带的东西，却和萨博形影不离，这是他和艾斯、路飞亲情的见证",
		res_id = "10512",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【龙之钩爪】提升一级"
			},
			{
				20,
				"【强化+20】  【革命军】提升一级"
			},
			{
				30,
				"【强化+30】  【水管打击】提升一级"
			},
			{
				35,
				"【强化+35】  【护弟狂魔】提升一级"
			}
		},
		sp_attrs = {}
	},
	[10513] = {
		quality = 5,
		bid = 10513,
		horcrux_desc = "替死草人霍金斯专属的占卜草人！能代替霍金斯承受致命伤害",
		horcrux_name = "替死草人",
		horcrux_synopsis = "替死草人霍金斯专属的占卜草人！能代替霍金斯承受致命伤害",
		res_id = "10513",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【命运抽牌】提升一级"
			},
			{
				20,
				"【强化+20】  【稻草果实】提升一级"
			},
			{
				30,
				"【强化+30】  【替死草人】提升一级"
			},
			{
				35,
				"【强化+35】  【诡诈占卜】提升一级"
			}
		},
		sp_attrs = {}
	},
	[10514] = {
		quality = 5,
		bid = 10514,
		horcrux_desc = "阿普可以将身体的任何部位转化为乐器，通过不同的音波攻击，而这个耳机或许可免除音波对自身的伤害。",
		horcrux_name = "阿普耳机",
		horcrux_synopsis = "阿普可以将身体的任何部位转化为乐器，通过不同的音波攻击，而这个耳机或许可免除音波对自身的伤害。",
		res_id = "10514",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【刮盘·斩】提升一级"
			},
			{
				20,
				"【强化+20】  【音音果实】提升一级"
			},
			{
				30,
				"【强化+30】  【刮盘·爆】提升一级"
			},
			{
				35,
				"【强化+35】  【战斗音乐】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20501] = {
		quality = 5,
		bid = 20501,
		horcrux_desc = "改造人弗兰奇的最爱，弗兰奇的身体与“万里阳光号”的动力来源几乎都以可乐来代替。爱屋及乌，弗兰奇同样喜欢汉堡等能与可乐搭配的食物。",
		horcrux_name = "可乐",
		horcrux_synopsis = "改造人弗兰奇的最爱，弗兰奇的身体与“万里阳光号”的动力来源几乎都以可乐来代替。爱屋及乌，弗兰奇同样喜欢汉堡等能与可乐搭配的食物。",
		res_id = "20501",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【风来炮】提升一级"
			},
			{
				20,
				"【强化+20】  【变态】提升一级"
			},
			{
				30,
				"【强化+30】  【可乐大炮】提升一级"
			},
			{
				35,
				"【强化+35】  【硬汉之拳】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20502] = {
		quality = 5,
		bid = 20502,
		horcrux_desc = "经过波音列岛的锻炼后，乌索普改用黑色的短型弹弓“黑兜”组合“POP GREEN”作为武器，有着更加灵活多变的攻击方式以适应变幻莫测的战场。",
		horcrux_name = "弹弓·黑兜",
		horcrux_synopsis = "经过波音列岛的锻炼后，乌索普改用黑色的短型弹弓“黑兜”组合“POP GREEN”作为武器，有着更加灵活多变的攻击方式以适应变幻莫测的战场。",
		res_id = "20502",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【必杀·火鸟星】提升一级"
			},
			{
				20,
				"【强化+20】  【虚张声势】提升一级"
			},
			{
				30,
				"【强化+30】  【必杀·炎爆星】提升一级"
			},
			{
				35,
				"【强化+35】  【必杀·加把火】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20504] = {
		quality = 5,
		bid = 20504,
		horcrux_desc = "超人系·黄泉果实，果实能力为能力者死后可以复活一次",
		horcrux_name = "黄泉果实",
		horcrux_synopsis = "超人系·黄泉果实，果实能力为能力者死后可以复活一次",
		res_id = "20504",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【黄泉之息】提升一级"
			},
			{
				20,
				"【强化+20】  【黄泉果实】提升一级"
			},
			{
				30,
				"【强化+30】  【复活】提升一级"
			},
			{
				35,
				"【强化+35】  【鼻歌吹雪】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20505] = {
		quality = 5,
		bid = 20505,
		horcrux_desc = "由乌索普为娜美量身定做的三截式武器，经过维莎利亚岛科学改造为“魔法天候棒”。看似普通，但是根据不同的组合，能够释放十余种绝招！",
		horcrux_name = "魔法天候棒",
		horcrux_synopsis = "由乌索普为娜美量身定做的三截式武器，经过维莎利亚岛科学改造为“魔法天候棒”。看似普通，但是根据不同的组合，能够释放十余种绝招！",
		res_id = "20505",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【雷云陷阱】提升一级"
			},
			{
				20,
				"【强化+20】  【天气大师】提升一级"
			},
			{
				30,
				"【强化+30】  【海市蜃楼】提升一级"
			},
			{
				35,
				"【强化+35】  【穷追猛打】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20507] = {
		quality = 5,
		bid = 20507,
		horcrux_desc = "十分珍贵的动物系恶魔果实，食用之后可以获得与人类同等的智商以及理解人兽双方语言的天赋，同时掌握能在人型与兽型之间的各种形态之间自由转化的能力。",
		horcrux_name = "人人果实",
		horcrux_synopsis = "十分珍贵的动物系恶魔果实，食用之后可以获得与人类同等的智商以及理解人兽双方语言的天赋，同时掌握能在人型与兽型之间的各种形态之间自由转化的能力。",
		res_id = "20507",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【乱打】提升一级"
			},
			{
				20,
				"【强化+20】  【50贝利】提升一级"
			},
			{
				30,
				"【强化+30】  【我是医生】提升一级"
			},
			{
				35,
				"【强化+35】  【不许打我伙伴】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20509] = {
		quality = 5,
		bid = 20509,
		horcrux_desc = "山治在杰尔马救下了父亲和兄弟们后，从父亲手中得到了杰尔马王国的科技结晶——3号战斗服，战斗力也因此大大提升。",
		horcrux_name = "杰尔马战斗服",
		horcrux_synopsis = "山治在杰尔马救下了父亲和兄弟们后，从父亲手中得到了杰尔马王国的科技结晶——3号战斗服，战斗力也因此大大提升。",
		res_id = "20509",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【恶魔飞踢】提升一级"
			},
			{
				20,
				"【强化+20】  【厨艺大师】提升一级"
			},
			{
				30,
				"【强化+30】  【恶魔风脚】提升一级"
			},
			{
				35,
				"【强化+35】  【燃烧月步】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20511] = {
		quality = 5,
		bid = 20511,
		horcrux_desc = "“海侠”甚平时常穿着浴袍，浴袍之内能隐约看见甚平胸口的“太阳海贼团”标志的纹身。",
		horcrux_name = "太阳纹身",
		horcrux_synopsis = "“海侠”甚平时常穿着浴袍，浴袍之内能隐约看见甚平胸口的“太阳海贼团”标志的纹身。",
		res_id = "20511",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【梅花皮】提升一级"
			},
			{
				20,
				"【强化+20】  【鱼人热血】提升一级"
			},
			{
				30,
				"【强化+30】  【武赖贯】提升一级"
			},
			{
				35,
				"【强化+35】  【援护】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20512] = {
		quality = 5,
		bid = 20512,
		horcrux_desc = "超人系的恶魔果实，能让罗宾身体的任何部位像开花一样，长在任何有形体的事物上，并作出攻击、窃听、偷窥等其他用途",
		horcrux_name = "花花果实",
		horcrux_synopsis = "超人系的恶魔果实，能让罗宾身体的任何部位像开花一样，长在任何有形体的事物上，并作出攻击、窃听、偷窥等其他用途",
		res_id = "20512",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【万紫千红·花园】提升一级"
			},
			{
				20,
				"【强化+20】  【幻之翼】提升一级"
			},
			{
				30,
				"【强化+30】  【万紫千红·三轮华】提升一级"
			},
			{
				35,
				"【强化+35】  【万紫千红·愈合手】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20513] = {
		quality = 5,
		bid = 20513,
		horcrux_desc = "梅卡罗是白星的宠物，身上穿着“crimin”牌红色背心，是白星在硬壳塔期间唯一的倾诉对象，会发出“鲨鲨”的叫声。",
		horcrux_name = "梅卡罗",
		horcrux_synopsis = "梅卡罗是白星的宠物，身上穿着“crimin”牌红色背心，是白星在硬壳塔期间唯一的倾诉对象，会发出“鲨鲨”的叫声。",
		res_id = "20513",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【古代兵器】提升一级"
			},
			{
				20,
				"【强化+20】  【海王波塞冬】提升一级"
			},
			{
				30,
				"【强化+30】  【万物之声】提升一级"
			},
			{
				35,
				"【强化+35】  【惊吓】提升一级"
			}
		},
		sp_attrs = {}
	},
	[20514] = {
		quality = 5,
		bid = 20514,
		horcrux_desc = "比自然系还罕见的动物系“幻兽种”恶魔果实，食用者可以变为传说中的狼神“大口真神”，拥有非比寻常的强大力量！",
		horcrux_name = "犬犬果实",
		horcrux_synopsis = "比自然系还罕见的动物系“幻兽种”恶魔果实，食用者可以变为传说中的狼神“大口真神”，拥有非比寻常的强大力量！",
		res_id = "20514",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【雷鸣八卦】提升一级"
			},
			{
				20,
				"【强化+20】  【犬犬果实】提升一级"
			},
			{
				30,
				"【强化+30】  【鸣谪】提升一级"
			},
			{
				35,
				"【强化+35】  【镜山】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30501] = {
		quality = 5,
		bid = 30501,
		horcrux_desc = "沙沙果实能力者克洛克达尔的体质可以变成沙，能使物理攻击、大多数能量攻击以及非霸气攻击对其能力者身体无效，同时能力者还拥有能自由创造并操控沙子的能力。弱点是身体碰到水或血就无法沙化，此时就无法躲避物理攻击。",
		horcrux_name = "沙沙果实",
		horcrux_synopsis = "沙沙果实能力者克洛克达尔的体质可以变成沙，能使物理攻击、大多数能量攻击以及非霸气攻击对其能力者身体无效，同时能力者还拥有能自由创造并操控沙子的能力。弱点是身体碰到水或血就无法沙化，此时就无法躲避物理攻击。",
		res_id = "30501",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【沙暴】提升一级"
			},
			{
				20,
				"【强化+20】  【沙沙果实】提升一级"
			},
			{
				30,
				"【强化+30】  【沙岚】提升一级"
			},
			{
				35,
				"【强化+35】  【沙化】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30502] = {
		quality = 5,
		bid = 30502,
		horcrux_desc = "巴索罗缪·大熊的贴身书籍，从童年时期的《NINOKIN》到如今的《BIBLE》，这位魁梧的“暴君”始终手不释卷。",
		horcrux_name = "BIBLE",
		horcrux_synopsis = "巴索罗缪·大熊的贴身书籍，从童年时期的《NINOKIN》到如今的《BIBLE》，这位魁梧的“暴君”始终手不释卷。",
		res_id = "30502",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【大守护者】提升一级"
			},
			{
				20,
				"【强化+20】  【暴君】提升一级"
			},
			{
				30,
				"【强化+30】  【机械之躯】提升一级"
			},
			{
				35,
				"【强化+35】  【空气掌握】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30506] = {
		quality = 5,
		bid = 30506,
		horcrux_desc = "自然系的恶魔果实，能够将身体任何部分变为火焰，即使身体被击溃也能瞬间利用火焰重组，更能免疫物理与非霸气攻击。",
		horcrux_name = "烧烧果实",
		horcrux_synopsis = "自然系的恶魔果实，能够将身体任何部分变为火焰，即使身体被击溃也能瞬间利用火焰重组，更能免疫物理与非霸气攻击。",
		res_id = "30506",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【火铳拳】提升一级"
			},
			{
				20,
				"【强化+20】  【燃烧继承】提升一级"
			},
			{
				30,
				"【强化+30】  【火焰龙王】提升一级"
			},
			{
				35,
				"【强化+35】  【火焰刻印】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30507] = {
		quality = 5,
		bid = 30507,
		horcrux_desc = "超人系影影果实，可以剪开别人的影子为自己所用，制作出影子僵尸",
		horcrux_name = "影影果实",
		horcrux_synopsis = "超人系影影果实，可以剪开别人的影子为自己所用，制作出影子僵尸",
		res_id = "30507",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【影切】提升一级"
			},
			{
				20,
				"【强化+20】  【影影果实】提升一级"
			},
			{
				30,
				"【强化+30】  【影子军团】提升一级"
			},
			{
				35,
				"【强化+35】  【影子缠绕】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30508] = {
		quality = 5,
		bid = 30508,
		horcrux_desc = "和之国大剑豪龙马的佩刀，据说龙马曾用此刀斩杀天上的龙，龙马也因此战被人称为“斩龙武士”。",
		horcrux_name = "名刀·秋水",
		horcrux_synopsis = "和之国大剑豪龙马的佩刀，据说龙马曾用此刀斩杀天上的龙，龙马也因此战被人称为“斩龙武士”。",
		res_id = "30508",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【鼻歌三丁·箭尾斩】提升一级"
			},
			{
				20,
				"【强化+20】  【拔刀术】提升一级"
			},
			{
				30,
				"【强化+30】  【鼻歌三丁·回风刺】提升一级"
			},
			{
				35,
				"【强化+35】  【黑刀秋水】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30509] = {
		quality = 5,
		bid = 30509,
		horcrux_desc = "无上大快刀十二工之一，能够释放强力且长距离的斩击，号称“世界最强之黑刀”，是世界第一大剑豪“鹰眼”的佩刀。",
		horcrux_name = "黑刀·夜",
		horcrux_synopsis = "无上大快刀十二工之一，能够释放强力且长距离的斩击，号称“世界最强之黑刀”，是世界第一大剑豪“鹰眼”的佩刀。",
		res_id = "30509",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【鼻歌三丁·箭尾斩】提升一级"
			},
			{
				20,
				"【强化+20】  【拔刀术】提升一级"
			},
			{
				30,
				"【强化+30】  【鼻歌三丁·回风刺】提升一级"
			},
			{
				35,
				"【强化+35】  【黑刀秋水】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30510] = {
		quality = 5,
		bid = 30510,
		horcrux_desc = "超人系的恶魔果实，食用后能够利用手指制造并操纵锋利的极细丝线，从而操控他人，甚至可以直接将他人切割。",
		horcrux_name = "线线果实",
		horcrux_synopsis = "超人系的恶魔果实，食用后能够利用手指制造并操纵锋利的极细丝线，从而操控他人，甚至可以直接将他人切割。",
		res_id = "30510",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【海源白浪·羽击线】提升一级"
			},
			{
				20,
				"【强化+20】  【寄生线】提升一级"
			},
			{
				30,
				"【强化+30】  【影骑线】提升一级"
			},
			{
				35,
				"【强化+35】  【足踢线】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30511] = {
		quality = 5,
		bid = 30511,
		horcrux_desc = "超人系恶魔果实，甜甜果实能将敌人石化",
		horcrux_name = "甜甜果实",
		horcrux_synopsis = "超人系恶魔果实，甜甜果实能将敌人石化",
		res_id = "30511",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【女王鼓舞】提升一级"
			},
			{
				20,
				"【强化+20】  【甜甜果实】提升一级"
			},
			{
				30,
				"【强化+30】  【甜甜箭】提升一级"
			},
			{
				35,
				"【强化+35】  【甜蜜追击】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30513] = {
		quality = 5,
		bid = 30513,
		horcrux_desc = "乙姬带回的世界贵族同意鱼人族与人类成立友好关系的签名，是鱼人岛走向陆地的开始",
		horcrux_name = "友好签名",
		horcrux_synopsis = "乙姬带回的世界贵族同意鱼人族与人类成立友好关系的签名，是鱼人岛走向陆地的开始",
		res_id = "30513",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【共鸣演说】提升一级"
			},
			{
				20,
				"【强化+20】  【金鱼王后】提升一级"
			},
			{
				30,
				"【强化+30】  【仁爱之心】提升一级"
			},
			{
				35,
				"【强化+35】  【命运反抗】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30514] = {
		quality = 5,
		bid = 30514,
		horcrux_desc = "光月时从830年前带来的贴身佩刀，伴随着光月时在未来世界闯荡，见证了光月时的跌宕而又凄婉的一生。",
		horcrux_name = "穿越之刀",
		horcrux_synopsis = "光月时从830年前带来的贴身佩刀，伴随着光月时在未来世界闯荡，见证了光月时的跌宕而又凄婉的一生。",
		res_id = "30514",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【时空异动】提升一级"
			},
			{
				20,
				"【强化+20】  【时时果实】提升一级"
			},
			{
				30,
				"【强化+30】  【伤害迁跃】提升一级"
			},
			{
				35,
				"【强化+35】  【治愈迁跃】提升一级"
			}
		},
		sp_attrs = {}
	},
	[30515] = {
		quality = 5,
		bid = 30515,
		horcrux_desc = "杰尔马66的高科技头盔，戴上它据说能防毒。",
		horcrux_name = "高科技头盔",
		horcrux_synopsis = "杰尔马66的高科技头盔，戴上它据说能防毒。",
		res_id = "30515",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【时空异动】提升一级"
			},
			{
				20,
				"【强化+20】  【时时果实】提升一级"
			},
			{
				30,
				"【强化+30】  【伤害迁跃】提升一级"
			},
			{
				35,
				"【强化+35】  【治愈迁跃】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40503] = {
		quality = 5,
		bid = 40503,
		horcrux_desc = "自然系恶魔果实，闪闪果实食用者体质变成光，能免疫物理攻击、非霸气攻击以及大多数能量攻击，同时拥有光的速度、光的威力，能通过身体发出激光，发出的激光能产生大范围爆炸。",
		horcrux_name = "闪闪果实",
		horcrux_synopsis = "自然系恶魔果实，闪闪果实食用者体质变成光，能免疫物理攻击、非霸气攻击以及大多数能量攻击，同时拥有光的速度、光的威力，能通过身体发出激光，发出的激光能产生大范围爆炸。",
		res_id = "40503",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【八尺琼勾玉】提升一级"
			},
			{
				20,
				"【强化+20】  【闪闪果实】提升一级"
			},
			{
				30,
				"【强化+30】  【天丛云剑】提升一级"
			},
			{
				35,
				"【强化+35】  【八尺镜】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40504] = {
		quality = 5,
		bid = 40504,
		horcrux_desc = "一颗刻有“Monkey D. Luffy”的普通炮弹，当炮弹被卡普投向敌船时，速度与威力都将远超军舰主炮发射的普通炮弹，爆炸气流能传播到几十公里开外。",
		horcrux_name = "拳骨陨石",
		horcrux_synopsis = "一颗刻有“Monkey D. Luffy”的普通炮弹，当炮弹被卡普投向敌船时，速度与威力都将远超军舰主炮发射的普通炮弹，爆炸气流能传播到几十公里开外。",
		res_id = "40504",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【特大铁球】提升一级"
			},
			{
				20,
				"【强化+20】  【坚韧身躯】提升一级"
			},
			{
				30,
				"【强化+30】  【追击】提升一级"
			},
			{
				35,
				"【强化+35】  【以牙还牙】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40506] = {
		quality = 5,
		bid = 40506,
		horcrux_desc = "自然系恶魔果实，体质能变成冰和制造冻气，能使物理攻击、大多数能量攻击以及非霸气攻击对其自身无效。能通过身体制造冰，也能够将触摸到的物体变成冰，能瞬间冰冻海洋，甚至改变一座岛屿的气候。",
		horcrux_name = "冰冻果实",
		horcrux_synopsis = "自然系恶魔果实，体质能变成冰和制造冻气，能使物理攻击、大多数能量攻击以及非霸气攻击对其自身无效。能通过身体制造冰，也能够将触摸到的物体变成冰，能瞬间冰冻海洋，甚至改变一座岛屿的气候。",
		res_id = "40506",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【两棘矛】提升一级"
			},
			{
				20,
				"【强化+20】  【大将】提升一级"
			},
			{
				30,
				"【强化+30】  【鼓舞】提升一级"
			},
			{
				35,
				"【强化+35】  【冰刀】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40507] = {
		quality = 5,
		bid = 40507,
		horcrux_desc = "洗洗果实，可以将敌人像衣服一样洗涤，并可将敌人变成扁平的衣服状挂到晾衣杆上。能够冲洗任何物品，被冲洗的物品会失去型体，生命体则会失去力量，也能将人的“恶”心稍稍洗去，洗涤他们的心灵，使人的“恶”变弱。",
		horcrux_name = "洗洗果实",
		horcrux_synopsis = "洗洗果实，可以将敌人像衣服一样洗涤，并可将敌人变成扁平的衣服状挂到晾衣杆上。能够冲洗任何物品，被冲洗的物品会失去型体，生命体则会失去力量，也能将人的“恶”心稍稍洗去，洗涤他们的心灵，使人的“恶”变弱。",
		res_id = "40507",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【心灵壁垒】提升一级"
			},
			{
				20,
				"【强化+20】  【洗洗果实】提升一级"
			},
			{
				30,
				"【强化+30】  【心灵洗涤】提升一级"
			},
			{
				35,
				"【强化+35】  【心灵强化】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40508] = {
		quality = 5,
		bid = 40508,
		horcrux_desc = "战国的海军帽上站立着一只象征“海军”的海鸥，而军帽下则压制着战国的爆炸头，是这位“海军本部元帅”的代表装饰。",
		horcrux_name = "海鸥海军帽",
		horcrux_synopsis = "战国的海军帽上站立着一只象征“海军”的海鸥，而军帽下则压制着战国的爆炸头，是这位“海军本部元帅”的代表装饰。",
		res_id = "40508",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【佛之战国】提升一级"
			},
			{
				20,
				"【强化+20】  【最高指挥】提升一级"
			},
			{
				30,
				"【强化+30】  【佛之守护】提升一级"
			},
			{
				35,
				"【强化+35】  【正义】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40509] = {
		quality = 5,
		bid = 40509,
		horcrux_desc = "超人系的恶魔果实，能从身体任何一处制造毒液，可以使全身缠绕着威力无比强大的剧毒，可以从身体任何部位释放剧毒无比的毒液",
		horcrux_name = "毒毒果实",
		horcrux_synopsis = "超人系的恶魔果实，能从身体任何一处制造毒液，可以使全身缠绕着威力无比强大的剧毒，可以从身体任何部位释放剧毒无比的毒液",
		res_id = "40509",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【毒龙】提升一级"
			},
			{
				20,
				"【强化+20】  【毒云】提升一级"
			},
			{
				30,
				"【强化+30】  【毒龙舞】提升一级"
			},
			{
				35,
				"【强化+35】  【毒河豚】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40510] = {
		quality = 5,
		bid = 40510,
		horcrux_desc = "自然系岩浆果实，自由制造和操纵熔岩的能力，即使在所有的三系恶魔果实中也具有引以为豪的最高峰的顶尖攻击力。",
		horcrux_name = "岩浆果实",
		horcrux_synopsis = "自然系岩浆果实，自由制造和操纵熔岩的能力，即使在所有的三系恶魔果实中也具有引以为豪的最高峰的顶尖攻击力。",
		res_id = "40510",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【大喷火】提升一级"
			},
			{
				20,
				"【强化+20】  【熔岩之力】提升一级"
			},
			{
				30,
				"【强化+30】  【冥狗】提升一级"
			},
			{
				35,
				"【强化+35】  【犬啮红莲】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40511] = {
		quality = 5,
		bid = 40511,
		horcrux_desc = "藤虎使用重重果实能力时通常以随身携带的杖刀作为媒介，能够将重力积蓄在杖刀之上，挥砍之后强大的横向重力可将一切都破坏殆尽！",
		horcrux_name = "藤虎杖刀",
		horcrux_synopsis = "藤虎使用重重果实能力时通常以随身携带的杖刀作为媒介，能够将重力积蓄在杖刀之上，挥砍之后强大的横向重力可将一切都破坏殆尽！",
		res_id = "40511",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【重力刀·陨击】提升一级"
			},
			{
				20,
				"【强化+20】  【重重果实】提升一级"
			},
			{
				30,
				"【强化+30】  【重力刀·猛虎】提升一级"
			},
			{
				35,
				"【强化+35】  【盲人赌徒】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40512] = {
		quality = 5,
		bid = 40512,
		horcrux_desc = "巨大铁臂粉碎机，拥有着击碎一切的力量，泽法用他无双的霸气以及巨腕粉碎机目标毁灭全世界海贼。",
		horcrux_name = "巨腕粉碎机",
		horcrux_synopsis = "巨大铁臂粉碎机，拥有着击碎一切的力量，泽法用他无双的霸气以及巨腕粉碎机目标毁灭全世界海贼。",
		res_id = "40512",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【灭世计划】提升一级"
			},
			{
				20,
				"【强化+20】  【海军导师】提升一级"
			},
			{
				30,
				"【强化+30】  【极致武装色】提升一级"
			},
			{
				35,
				"【强化+35】  【灭世炮】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40513] = {
		quality = 5,
		bid = 40513,
		horcrux_desc = "桃兔的贴身佩刀，以日本海上守护神而命名，桃兔穿着超短裙出入时皆佩戴此刀",
		horcrux_name = "金毘罗",
		horcrux_synopsis = "桃兔的贴身佩刀，以日本海上守护神而命名，桃兔穿着超短裙出入时皆佩戴此刀",
		res_id = "40513",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【金毘罗】提升一级"
			},
			{
				20,
				"【强化+20】  【大将候补】提升一级"
			},
			{
				30,
				"【强化+30】  【半玉·花柳】提升一级"
			},
			{
				35,
				"【强化+35】  【芸者·浮世绘】提升一级"
			}
		},
		sp_attrs = {}
	},
	[40514] = {
		quality = 5,
		bid = 40514,
		horcrux_desc = "由于大将的代号需要以色彩和动物命名，这枚印有“豚”字的挂坠正是茶豚用以展现自己上将候补身份的证明。",
		horcrux_name = "茶豚挂件",
		horcrux_synopsis = "由于大将的代号需要以色彩和动物命名，这枚印有“豚”字的挂坠正是茶豚用以展现自己上将候补身份的证明。",
		res_id = "40514",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【手枪连射】提升一级"
			},
			{
				20,
				"【强化+20】  【大将候补】提升一级"
			},
			{
				30,
				"【强化+30】  【猪突猛进】提升一级"
			},
			{
				35,
				"【强化+35】  【告白动力】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50502] = {
		quality = 5,
		bid = 50502,
		horcrux_desc = "平平无奇之剑，但在冥王雷利手中，配合自身的霸气，能够挥斩出不逊于名刀的剑气",
		horcrux_name = "皇副之剑",
		horcrux_synopsis = "平平无奇之剑，但在冥王雷利手中，配合自身的霸气，能够挥斩出不逊于名刀的剑气",
		res_id = "50502",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【手枪连射】提升一级"
			},
			{
				20,
				"【强化+20】  【大将候补】提升一级"
			},
			{
				30,
				"【强化+30】  【猪突猛进】提升一级"
			},
			{
				35,
				"【强化+35】  【告白动力】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50503] = {
		quality = 5,
		bid = 50503,
		horcrux_desc = "巴杰斯的护臂，可以抵挡绝大部分攻击",
		horcrux_name = "护臂",
		horcrux_synopsis = "巴杰斯的护臂，可以抵挡绝大部分攻击",
		res_id = "50503",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【冥王】提升一级"
			},
			{
				20,
				"【强化+20】  【霸气专家】提升一级"
			},
			{
				30,
				"【强化+30】  【超量打击】提升一级"
			},
			{
				35,
				"【强化+35】  【传奇皇副】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50504] = {
		quality = 5,
		bid = 50504,
		horcrux_desc = "“四皇—红发”香克斯的神秘佩刀，是与其一起经历无数战场的爱刀，拥有可抵挡住熔岩拳头的坚韧硬度与堪比狮鹫的优美曲线。",
		horcrux_name = "格里芬",
		horcrux_synopsis = "“四皇—红发”香克斯的神秘佩刀，是与其一起经历无数战场的爱刀，拥有可抵挡住熔岩拳头的坚韧硬度与堪比狮鹫的优美曲线。",
		res_id = "50504",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【格里芬】提升一级"
			},
			{
				20,
				"【强化+20】  【红发】提升一级"
			},
			{
				30,
				"【强化+30】  【格里芬·突刺】提升一级"
			},
			{
				35,
				"【强化+35】  【四皇之慑】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50505] = {
		quality = 5,
		bid = 50505,
		horcrux_desc = "双重果实，黑胡子拥有两颗恶魔果实",
		horcrux_name = "双重果实",
		horcrux_synopsis = "双重果实，黑胡子拥有两颗恶魔果实",
		res_id = "50505",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【黑暗爆震】提升一级"
			},
			{
				20,
				"【强化+20】  【双重果实】提升一级"
			},
			{
				30,
				"【强化+30】  【黑洞解放】提升一级"
			},
			{
				35,
				"【强化+35】  【暗穴道】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50507] = {
		quality = 5,
		bid = 50507,
		horcrux_desc = "自然系中烧烧果实，将一切攻击手段化作火焰攻击。",
		horcrux_name = "烧烧果实",
		horcrux_synopsis = "自然系中烧烧果实，将一切攻击手段化作火焰攻击。",
		res_id = "50507",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【大火拳】提升一级"
			},
			{
				20,
				"【强化+20】  【烧烧果实】提升一级"
			},
			{
				30,
				"【强化+30】  【神火·不知火】提升一级"
			},
			{
				35,
				"【强化+35】  【炎戒】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50508] = {
		quality = 5,
		bid = 50508,
		horcrux_desc = "世界最强的的男人—白胡子的专属佩刀，配合白胡子威震整片大海，无上大快刀十二工——丛云切",
		horcrux_name = "丛云切",
		horcrux_synopsis = "世界最强的的男人—白胡子的专属佩刀，配合白胡子威震整片大海，无上大快刀十二工——丛云切",
		res_id = "50508",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【丛云切】提升一级"
			},
			{
				20,
				"【强化+20】  【最强之男】提升一级"
			},
			{
				30,
				"【强化+30】  【空裂】提升一级"
			},
			{
				35,
				"【强化+35】  【果实觉醒】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50509] = {
		quality = 5,
		bid = 50509,
		horcrux_desc = "超人系·橡胶果实，能够将身体的任何部位依自己的想法伸长和反弹，使普通的打击具有更强的威力，身体不会因为反作用力而受到伤害。",
		horcrux_name = "橡胶果实",
		horcrux_synopsis = "超人系·橡胶果实，能够将身体的任何部位依自己的想法伸长和反弹，使普通的打击具有更强的威力，身体不会因为反作用力而受到伤害。",
		res_id = "50509",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【橡皮灰熊枪】提升一级"
			},
			{
				20,
				"【强化+20】  【橡胶巨人】提升一级"
			},
			{
				30,
				"【强化+30】  【四档形态】提升一级"
			},
			{
				35,
				"【强化+35】  【橡胶印章】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50510] = {
		quality = 5,
		bid = 50510,
		horcrux_desc = "拥有鸟鸟果实·幻兽种·不死鸟形态的马尔科在“了结的一战”后依然携带的札甲带，至今仍旧完好如新。",
		horcrux_name = "札甲带",
		horcrux_synopsis = "拥有鸟鸟果实·幻兽种·不死鸟形态的马尔科在“了结的一战”后依然携带的札甲带，至今仍旧完好如新。",
		res_id = "50510",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【幻兽连击】提升一级"
			},
			{
				20,
				"【强化+20】  【凤凰印】提升一级"
			},
			{
				30,
				"【强化+30】  【青炎】提升一级"
			},
			{
				35,
				"【强化+35】  【再生之炎】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50511] = {
		quality = 5,
		bid = 50511,
		horcrux_desc = "卡塔库栗会将手臂变成糯团包围着土龙，令手臂不断旋转并刺出，威力极其强大，黏糯米团优秀的延展性与变化性更是如虎添翼。",
		horcrux_name = "土龙",
		horcrux_synopsis = "卡塔库栗会将手臂变成糯团包围着土龙，令手臂不断旋转并刺出，威力极其强大，黏糯米团优秀的延展性与变化性更是如虎添翼。",
		res_id = "50511",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						533105
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						533205
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						533305
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						533405
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【无双年糕刃弹】提升一级"
			},
			{
				20,
				"【强化+20】  【糯糯果实】提升一级"
			},
			{
				30,
				"【强化+30】  【斩·切·年糕】提升一级"
			},
			{
				35,
				"【强化+35】  【极致见闻色】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50512] = {
		quality = 5,
		bid = 50512,
		horcrux_desc = "极为罕见的动物系“幻兽种”恶魔果实，使用者能够化身为龙，拥有支配风、火、雷、云的能力，引起毁天灭地的各种超规模攻击。",
		horcrux_name = "鱼鱼果实·幻兽种·青龙形态",
		horcrux_synopsis = "极为罕见的动物系“幻兽种”恶魔果实，使用者能够化身为龙，拥有支配风、火、雷、云的能力，引起毁天灭地的各种超规模攻击。",
		res_id = "50512",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【降三式·引奈落】提升一级"
			},
			{
				20,
				"【强化+20】  【鱼鱼果实·幻兽种】提升一级"
			},
			{
				30,
				"【强化+30】  【雷鸣八卦】提升一级"
			},
			{
				35,
				"【强化+35】  【最强生物】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50513] = {
		quality = 5,
		bid = 50513,
		horcrux_desc = "被称为“BIG MOM”的夏洛特·玲玲利用“魂魂果实”的能力召唤而出的灵魂分身，其中“宙斯、拿破仑、普罗米修斯”的力量最为强大。",
		horcrux_name = "霍米兹",
		horcrux_synopsis = "被称为“BIG MOM”的夏洛特·玲玲利用“魂魂果实”的能力召唤而出的灵魂分身，其中“宙斯、拿破仑、普罗米修斯”的力量最为强大。",
		res_id = "50513",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【灵魂咒文】提升一级"
			},
			{
				20,
				"【强化+20】  【魂魂果实】提升一级"
			},
			{
				30,
				"【强化+30】  【威国】提升一级"
			},
			{
				35,
				"【强化+35】  【思食症】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50514] = {
		quality = 5,
		bid = 50514,
		horcrux_desc = "大快刀二十一工之二，各自被称作“连天空都能斩落”与“连地狱都能征服”的名刀，是二刀流剑士光月御田的招牌武器。",
		horcrux_name = "天羽羽斩&阎魔",
		horcrux_synopsis = "大快刀二十一工之二，各自被称作“连天空都能斩落”与“连地狱都能征服”的名刀，是二刀流剑士光月御田的招牌武器。",
		res_id = "50514",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【桃源白泷】提升一级"
			},
			{
				20,
				"【强化+20】  【流樱】提升一级"
			},
			{
				30,
				"【强化+30】  【桃源十拳】提升一级"
			},
			{
				35,
				"【强化+35】  【御田二刀流】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50515] = {
		quality = 5,
		bid = 50515,
		horcrux_desc = "超人系·合体果实，能排列组合所有物体，使之合体的能力。能够让触摸到的无机物和自己的身体融合在一起。",
		horcrux_name = "合体果实",
		horcrux_synopsis = "超人系·合体果实，能排列组合所有物体，使之合体的能力。能够让触摸到的无机物和自己的身体融合在一起。",
		res_id = "50515",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【魔鬼之手】提升一级"
			},
			{
				20,
				"【强化+20】  【合体果实】提升一级"
			},
			{
				30,
				"【强化+30】  【魔鬼形态】提升一级"
			},
			{
				35,
				"【强化+35】  【战争机器】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50516] = {
		quality = 5,
		bid = 50516,
		horcrux_desc = "杰克放在颈子后面，伪装成象牙的战刀。是两把下身直刀状、上身镰刀状的武器，杰克曾用这种刀斩断佐乌双王一手一脚，是专门为了杀戮而造的武器。",
		horcrux_name = "肖特尔刀",
		horcrux_synopsis = "杰克放在颈子后面，伪装成象牙的战刀。是两把下身直刀状、上身镰刀状的武器，杰克曾用这种刀斩断佐乌双王一手一脚，是专门为了杀戮而造的武器。",
		res_id = "50516",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【旱灾】提升一级"
			},
			{
				20,
				"【强化+20】  【象象果实】提升一级"
			},
			{
				30,
				"【强化+30】  【猛犸斩击】提升一级"
			},
			{
				35,
				"【强化+35】  【jick逆袭】提升一级"
			}
		},
		sp_attrs = {}
	},
	[50517] = {
		quality = 5,
		bid = 50517,
		horcrux_desc = "奎因使用的武器是两把大砍刀，刀身比较宽，呈弯月状，平时分别是挂在两边腰间。",
		horcrux_name = "大砍刀",
		horcrux_synopsis = "奎因使用的武器是两把大砍刀，刀身比较宽，呈弯月状，平时分别是挂在两边腰间。",
		res_id = "50517",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【疫灾】提升一级"
			},
			{
				20,
				"【强化+20】  【龙龙果实·蜿龙】提升一级"
			},
			{
				30,
				"【强化+30】  【瘟疫弹】提升一级"
			},
			{
				35,
				"【强化+35】  【心网】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70501] = {
		quality = 5,
		bid = 70501,
		horcrux_desc = "此刀会擅自释放使用者的“流樱”（霸气），超出控制的“猛斩”，普通剑士使用会精力被释放光而干枯的危险。",
		horcrux_name = "阎魔",
		horcrux_synopsis = "此刀会擅自释放使用者的“流樱”（霸气），超出控制的“猛斩”，普通剑士使用会精力被释放光而干枯的危险。",
		res_id = "70501",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【阿修罗·炼狱鬼斩】提升一级"
			},
			{
				20,
				"【强化+20】  【响彻天堂】提升一级"
			},
			{
				30,
				"【强化+30】  【阿修罗·亡者戏】提升一级"
			},
			{
				35,
				"【强化+35】  【阿修罗·极】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70502] = {
		quality = 5,
		bid = 70502,
		horcrux_desc = "超人系·手术果实，据说这颗果实价值50亿贝利，可以在自己制造出的半球状/全球状的特定空间“ROOM”内自由分割组合任何物件。",
		horcrux_name = "手术果实",
		horcrux_synopsis = "超人系·手术果实，据说这颗果实价值50亿贝利，可以在自己制造出的半球状/全球状的特定空间“ROOM”内自由分割组合任何物件。",
		res_id = "70502",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【冲击波动】提升一级"
			},
			{
				20,
				"【强化+20】  【手术果实觉醒】提升一级"
			},
			{
				30,
				"【强化+30】  【穿刺波动】提升一级"
			},
			{
				35,
				"【强化+35】  【生命手术】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70503] = {
		quality = 5,
		bid = 70503,
		horcrux_desc = "超人系·橡胶果实，能够将身体的任何部位依自己的想法伸长和反弹，使普通的打击具有更强的威力，身体不会因为反作用力而受到伤害。",
		horcrux_name = "橡胶果实",
		horcrux_synopsis = "超人系·橡胶果实，能够将身体的任何部位依自己的想法伸长和反弹，使普通的打击具有更强的威力，身体不会因为反作用力而受到伤害。",
		res_id = "70503",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【业火手枪】提升一级"
			},
			{
				20,
				"【强化+20】  【四档形态】提升一级"
			},
			{
				30,
				"【强化+30】  【大猿王枪】提升一级"
			},
			{
				35,
				"【强化+35】  【橡胶巨人jep炮弹】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70504] = {
		quality = 5,
		bid = 70504,
		horcrux_desc = "据说该果实是800年前乔伊波伊所食用的恶魔果实，被后人称为解放战士，世界政府给它命名【人人果实·幻兽种·尼卡形态】，世界政府800年间一直尝试回收这颗恶魔果实，但都没有成功！",
		horcrux_name = "人人果实·幻兽种·尼卡形态",
		horcrux_synopsis = "据说该果实是800年前乔伊波伊所食用的恶魔果实，被后人称为解放战士，世界政府给它命名【人人果实·幻兽种·尼卡形态】，世界政府800年间一直尝试回收这颗恶魔果实，但都没有成功！",
		res_id = "70504",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【闪电雷枪】提升一级"
			},
			{
				20,
				"【强化+20】  【绝缘橡胶】提升一级"
			},
			{
				30,
				"【强化+30】  【雷霆万钧】提升一级"
			},
			{
				35,
				"【强化+35】  【尼卡形态】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70505] = {
		quality = 5,
		bid = 70505,
		horcrux_desc = "极为罕见的动物系“幻兽种”恶魔果实，使用者能够化身为龙，拥有支配风、火、雷、云的能力，引起毁天灭地的各种超规模攻击。",
		horcrux_name = "鱼鱼果实·幻兽种·青龙形态",
		horcrux_synopsis = "极为罕见的动物系“幻兽种”恶魔果实，使用者能够化身为龙，拥有支配风、火、雷、云的能力，引起毁天灭地的各种超规模攻击。",
		res_id = "70505",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【雷鸣八卦】提升一级"
			},
			{
				20,
				"【强化+20】  【百兽凯多】提升一级"
			},
			{
				30,
				"【强化+30】  【龙云】提升一级"
			},
			{
				35,
				"【强化+35】  【最强生物】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70506] = {
		quality = 5,
		bid = 70506,
		horcrux_desc = "战国的海军帽上站立着一只象征“海军”的海鸥，而军帽下则压制着战国的爆炸头，是这位“海军本部元帅”的代表装饰。",
		horcrux_name = "海鸥海军帽",
		horcrux_synopsis = "战国的海军帽上站立着一只象征“海军”的海鸥，而军帽下则压制着战国的爆炸头，是这位“海军本部元帅”的代表装饰。",
		res_id = "70506",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【佛之战国】提升一级"
			},
			{
				20,
				"【强化+20】  【最高指挥】提升一级"
			},
			{
				30,
				"【强化+30】  【佛之守护】提升一级"
			},
			{
				35,
				"【强化+35】  【大佛形态】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70507] = {
		quality = 5,
		bid = 70507,
		horcrux_desc = "曾经和白胡子，罗杰齐名的大海贼金狮子被困在推进城，为了越狱自己砍掉自己的双脚，做成了武器",
		horcrux_name = "双腿剑",
		horcrux_synopsis = "曾经和白胡子，罗杰齐名的大海贼金狮子被困在推进城，为了越狱自己砍掉自己的双脚，做成了武器",
		res_id = "70507",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【狮子斩·刃劈】提升一级"
			},
			{
				20,
				"【强化+20】  【飘飘果实】提升一级"
			},
			{
				30,
				"【强化+30】  【狮子威·御地卷】提升一级"
			},
			{
				35,
				"【强化+35】  【传奇大海贼】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70508] = {
		quality = 5,
		bid = 70508,
		horcrux_desc = "藤虎使用重重果实能力时通常以随身携带的杖刀作为媒介，能够将重力积蓄在杖刀之上，挥砍之后强大的横向重力可将一切都破坏殆尽！",
		horcrux_name = "藤虎杖刀",
		horcrux_synopsis = "藤虎使用重重果实能力时通常以随身携带的杖刀作为媒介，能够将重力积蓄在杖刀之上，挥砍之后强大的横向重力可将一切都破坏殆尽！",
		res_id = "70508",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【重力刀·猛虎】提升一级"
			},
			{
				20,
				"【强化+20】  【见闻色霸气】提升一级"
			},
			{
				30,
				"【强化+30】  【地狱旅】提升一级"
			},
			{
				35,
				"【强化+35】  【武装色霸气】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70509] = {
		quality = 5,
		bid = 70509,
		horcrux_desc = "你一定会喜欢这个试剂的",
		horcrux_name = "剧毒试剂",
		horcrux_synopsis = "你一定会喜欢这个试剂的",
		res_id = "70509",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【致幻毒剂】提升一级"
			},
			{
				20,
				"【强化+20】  【自然系·瓦斯果实】提升一级"
			},
			{
				30,
				"【强化+30】  【KORO】提升一级"
			},
			{
				35,
				"【强化+35】  【肌肉松弛剂】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70510] = {
		quality = 5,
		bid = 70510,
		horcrux_desc = "双重果实，黑胡子拥有两颗恶魔果实",
		horcrux_name = "双重果实",
		horcrux_synopsis = "双重果实，黑胡子拥有两颗恶魔果实",
		res_id = "70510",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【解放】提升一级"
			},
			{
				20,
				"【强化+20】  【双果实能力者】提升一级"
			},
			{
				30,
				"【强化+30】  【暗穴道】提升一级"
			},
			{
				35,
				"【强化+35】  【能量倾斜】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70511] = {
		quality = 5,
		bid = 70511,
		horcrux_desc = "杰尔马66的变身器。山治专属的隐形黑，变身后可以获得隐形能力。",
		horcrux_name = "杰尔马科技",
		horcrux_synopsis = "杰尔马66的变身器。山治专属的隐形黑，变身后可以获得隐形能力。",
		res_id = "70511",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【外骨骼护盾】提升一级"
			},
			{
				20,
				"【强化+20】  【武装色霸气】提升一级"
			},
			{
				30,
				"【强化+30】  【魔神风脚·牛肉爆裂】提升一级"
			},
			{
				35,
				"【强化+35】  【骑士道精神】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70512] = {
		quality = 5,
		bid = 70512,
		horcrux_desc = "猫蝮蛇的手臂曾在战斗中失去，后来用一把手枪做成了手臂。",
		horcrux_name = "改造手臂",
		horcrux_synopsis = "猫蝮蛇的手臂曾在战斗中失去，后来用一把手枪做成了手臂。",
		res_id = "70512",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【圆月·闪电突袭】提升一级"
			},
			{
				20,
				"【强化+20】  【月之狮子】提升一级"
			},
			{
				30,
				"【强化+30】  【圆月·闪电重击】提升一级"
			},
			{
				35,
				"【强化+35】  【月之狮子·觉醒】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70513] = {
		quality = 5,
		bid = 70513,
		horcrux_desc = "五老星萨坦圣科学防卫战神的权杖，象征世界政府最高权力，直属伊姆管辖。",
		horcrux_name = "权力权杖",
		horcrux_synopsis = "五老星萨坦圣科学防卫战神的权杖，象征世界政府最高权力，直属伊姆管辖。",
		res_id = "70513",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【土星·霸气震慑】提升一级"
			},
			{
				20,
				"【强化+20】  【土星·恶魔降临】提升一级"
			},
			{
				30,
				"【强化+30】  【土星·霸气天罚】提升一级"
			},
			{
				35,
				"【强化+35】  【五老星·科学武神】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70514] = {
		quality = 5,
		bid = 70514,
		horcrux_desc = "萨罗梅,是一条水性极佳的无毒蟒蛇。身体以粉色为主,有红色的云状斑块,腹部是黄色的,头上顶着骷髅头,拥有追踪能力,可随时盘旋起来当作椅子,能做出逗逼的表情,很懂女帝的心思。",
		horcrux_name = "萨罗梅",
		horcrux_synopsis = "萨罗梅,是一条水性极佳的无毒蟒蛇。身体以粉色为主,有红色的云状斑块,腹部是黄色的,头上顶着骷髅头,拥有追踪能力,可随时盘旋起来当作椅子,能做出逗逼的表情,很懂女帝的心思。",
		res_id = "70514",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【虏之矢】提升一级"
			},
			{
				20,
				"【强化+20】  【国色天香】提升一级"
			},
			{
				30,
				"【强化+30】  【甜甜甘风】提升一级"
			},
			{
				35,
				"【强化+35】  【女帝权柄】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70515] = {
		quality = 5,
		bid = 70515,
		horcrux_desc = "一把比自己身高还要长的巨大双刃剑，剑格呈饼干形状。克力架称其为独一无二的名剑。他平时抗在右肩上。",
		horcrux_name = "椒盐卷饼",
		horcrux_synopsis = "一把比自己身高还要长的巨大双刃剑，剑格呈饼干形状。克力架称其为独一无二的名剑。他平时抗在右肩上。",
		res_id = "70515",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【饼干士兵】提升一级"
			},
			{
				20,
				"【强化+20】  【饼干能力】提升一级"
			},
			{
				30,
				"【强化+30】  【饼干防御】提升一级"
			},
			{
				35,
				"【强化+35】  【饼干骑士】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70516] = {
		quality = 5,
		bid = 70516,
		horcrux_desc = "这把刀很明显没有明确的品级。但是在斯慕吉榨榨果实的配合下，这把刀却极其强大，它同样可以吸收水分，可以随着斯慕吉的变大而增大，对于斯慕吉来说这是最为方便的一把刀。",
		horcrux_name = "斯慕吉的佩刀",
		horcrux_synopsis = "这把刀很明显没有明确的品级。但是在斯慕吉榨榨果实的配合下，这把刀却极其强大，它同样可以吸收水分，可以随着斯慕吉的变大而增大，对于斯慕吉来说这是最为方便的一把刀。",
		res_id = "70516",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【榨榨·水龙卷】提升一级"
			},
			{
				20,
				"【强化+20】  【榨榨果实】提升一级"
			},
			{
				30,
				"【强化+30】  【榨榨·波纹斩】提升一级"
			},
			{
				35,
				"【强化+35】  【甜点将星】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70517] = {
		quality = 5,
		bid = 70517,
		horcrux_desc = "无上大快刀12工【艾斯】，跟随哥尔·D·罗杰并肩战斗。",
		horcrux_name = "艾斯",
		horcrux_synopsis = "无上大快刀12工【艾斯】，跟随哥尔·D·罗杰并肩战斗。",
		res_id = "70517",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【霸王色·斩击】提升一级"
			},
			{
				20,
				"【强化+20】  【见闻色霸气】提升一级"
			},
			{
				30,
				"【强化+30】  【神避】提升一级"
			},
			{
				35,
				"【强化+35】  【海贼王】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70518] = {
		quality = 5,
		bid = 70518,
		horcrux_desc = "无上大快刀12工【黑刀·夜】，跟随鹰眼·米霍克并肩战斗，成为世界第一大剑豪佩刀",
		horcrux_name = "黑刀·夜",
		horcrux_synopsis = "无上大快刀12工【艾斯】，跟随哥尔·D·罗杰并肩战斗。",
		res_id = "70518",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【黑刀夜·下劈】提升一级"
			},
			{
				20,
				"【强化+20】  【黑刀·夜】提升一级"
			},
			{
				30,
				"【强化+30】  【最强一击】提升一级"
			},
			{
				35,
				"【强化+35】  【最强剑豪】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70519] = {
		quality = 5,
		bid = 70519,
		horcrux_desc = "乌索普自制武器弹弓·黑兜，能够跟随乌索普的实力一起提升！",
		horcrux_name = "弹弓·黑兜",
		horcrux_synopsis = "乌索普自制武器弹弓·黑兜，能够跟随乌索普的实力一起提升！",
		res_id = "70519",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【必杀绿星·恶魔】提升一级"
			},
			{
				20,
				"【强化+20】  【狙击王】提升一级"
			},
			{
				30,
				"【强化+30】  【必杀绿星·焰火花】提升一级"
			},
			{
				35,
				"【强化+35】  【大吃一惊】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70520] = {
		quality = 5,
		bid = 70520,
		horcrux_desc = "弗兰奇把自身改造成机器人，铁拳之中融合各种必杀技。",
		horcrux_name = "弗兰奇铁拳",
		horcrux_synopsis = "弗兰奇把自身改造成机器人，铁拳之中融合各种必杀技。",
		res_id = "70520",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【终极铁锤】提升一级"
			},
			{
				20,
				"【强化+20】  【弗兰奇弗兰奇】提升一级"
			},
			{
				30,
				"【强化+30】  【弗兰奇游离激光束】提升一级"
			},
			{
				35,
				"【强化+35】  【super】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70521] = {
		quality = 5,
		bid = 70521,
		horcrux_desc = "佩罗娜的幽灵雨伞，佩罗娜时时刻刻攥在手里",
		horcrux_name = "幽灵雨伞",
		horcrux_synopsis = "佩罗娜的幽灵雨伞，佩罗娜时时刻刻攥在手里",
		res_id = "70521",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【治愈幽灵】提升一级"
			},
			{
				20,
				"【强化+20】  【幽灵公主】提升一级"
			},
			{
				30,
				"【强化+30】  【消极幽灵】提升一级"
			},
			{
				35,
				"【强化+35】  【灵灵果实】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70522] = {
		quality = 5,
		bid = 70522,
		horcrux_desc = "巴托洛米奥的屏障果实，暂时没有任何攻击手段能够突破",
		horcrux_name = "屏障果实",
		horcrux_synopsis = "巴托洛米奥的屏障果实，暂时没有任何攻击手段能够突破",
		res_id = "70522",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【屏障冲击】提升一级"
			},
			{
				20,
				"【强化+20】  【屏障果实】提升一级"
			},
			{
				30,
				"【强化+30】  【觉·屏障冲击】提升一级"
			},
			{
				35,
				"【强化+35】  【人体肉盾·巴托】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70523] = {
		quality = 5,
		bid = 70523,
		horcrux_desc = "布鲁克的魂丧剑，一把外形酷似雨伞的剑",
		horcrux_name = "魂丧剑",
		horcrux_synopsis = "布鲁克的魂丧剑，一把外形酷似雨伞的剑",
		res_id = "70523",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【鼻歌·吹雪斩】提升一级"
			},
			{
				20,
				"【强化+20】  【幻想曲】提升一级"
			},
			{
				30,
				"【强化+30】  【魂丧剑·直刺】提升一级"
			},
			{
				35,
				"【强化+35】  【灵魂之王】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70524] = {
		quality = 5,
		bid = 70524,
		horcrux_desc = "自然系中烧烧果实，将一切攻击手段化作火焰攻击。",
		horcrux_name = "烧烧果实",
		horcrux_synopsis = "自然系中烧烧果实，将一切攻击手段化作火焰攻击。",
		res_id = "70524",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【大火拳】提升一级"
			},
			{
				20,
				"【强化+20】  【烧烧果实】提升一级"
			},
			{
				30,
				"【强化+30】  【大炎戒·炎帝】提升一级"
			},
			{
				35,
				"【强化+35】  【炎帝】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70525] = {
		quality = 5,
		bid = 70525,
		horcrux_desc = "歌歌果实，乌塔的专属果实，能给世界带来欢乐",
		horcrux_name = "歌歌果实",
		horcrux_synopsis = "歌歌果实，乌塔的专属果实，能给世界带来欢乐",
		res_id = "70525",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【寂寞音符】提升一级"
			},
			{
				20,
				"【强化+20】  【方徨曲谱】提升一级"
			},
			{
				30,
				"【强化+30】  【超现实的旋律】提升一级"
			},
			{
				35,
				"【强化+35】  【歌歌果实】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70530] = {
		quality = 5,
		bid = 70530,
		horcrux_desc = "烬的武器是一把巨型武士刀，有着强大的攻击性。刀刃能够变形成类似破刃剑的形状，烬曾用此打掉索隆的两把刀。",
		horcrux_name = "破刃剑",
		horcrux_synopsis = "烬的武器是一把巨型武士刀，有着强大的攻击性。刀刃能够变形成类似破刃剑的形状，烬曾用此打掉索隆的两把刀。",
		res_id = "70530",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【火龙皇】提升一级"
			},
			{
				20,
				"【强化+20】  【炎灾】提升一级"
			},
			{
				30,
				"【强化+30】  【御守·火龙皇】提升一级"
			},
			{
				35,
				"【强化+35】  【露娜利亚族】提升一级"
			}
		},
		sp_attrs = {}
	},
	[709830] = {
		quality = 5,
		bid = 709830,
		horcrux_desc = "自然系恶魔果实，体质能变成冰和制造冻气，能使物理攻击、大多数能量攻击以及非霸气攻击对其自身无效。能通过身体制造冰，也能够将触摸到的物体变成冰，能瞬间冰冻海洋，甚至改变一座岛屿的气候。",
		horcrux_name = "冰冻果实",
		horcrux_synopsis = "自然系恶魔果实，体质能变成冰和制造冻气，能使物理攻击、大多数能量攻击以及非霸气攻击对其自身无效。能通过身体制造冰，也能够将触摸到的物体变成冰，能瞬间冰冻海洋，甚至改变一座岛屿的气候。",
		res_id = "709830",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【冰块“暴雉嘴”】提升一级"
			},
			{
				20,
				"【强化+20】  【冻冻果实】提升一级"
			},
			{
				30,
				"【强化+30】  【冰河时代】提升一级"
			},
			{
				35,
				"【强化+35】  【冰冻时刻】提升一级"
			}
		},
		sp_attrs = {}
	},
	[90527] = {
		quality = 5,
		bid = 90527,
		horcrux_desc = "狼刑专属武器，【破空刀】据说能斩破虚空！！！",
		horcrux_name = "破空刀",
		horcrux_synopsis = "狼刑专属武器，【破空刀】据说能斩破虚空！！！",
		res_id = "90527",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【裂空斩击】提升一级"
			},
			{
				20,
				"【强化+20】  【狼神之力】提升一级"
			},
			{
				30,
				"【强化+30】  【狼神·破空斩】提升一级"
			},
			{
				35,
				"【强化+35】  【狼神】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70527] = {
		quality = 5,
		bid = 70527,
		horcrux_desc = "佩罗斯用糖果果实制造的专属武器",
		horcrux_name = "棒棒糖",
		horcrux_synopsis = "佩罗斯用糖果果实制造的专属武器",
		res_id = "70527",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【糖果粘液】提升一级"
			},
			{
				20,
				"【强化+20】  【分发糖果】提升一级"
			},
			{
				30,
				"【强化+30】  【糖果潮汐】提升一级"
			},
			{
				35,
				"【强化+35】  【糖果人】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70528] = {
		quality = 5,
		bid = 70528,
		horcrux_desc = "基尔马统帅的电磁长矛，可发出电磁攻击",
		horcrux_name = "电磁长矛",
		horcrux_synopsis = "基尔马统帅的电磁长矛，可发出电磁攻击",
		res_id = "70528",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【电磁突刺】提升一级"
			},
			{
				20,
				"【强化+20】  【统帅援护】提升一级"
			},
			{
				30,
				"【强化+30】  【电磁碎击】提升一级"
			},
			{
				35,
				"【强化+35】  【血统因子】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70531] = {
		quality = 5,
		bid = 70531,
		horcrux_desc = "新晋海军大将绿牛的佩刀",
		horcrux_name = "大将太刀",
		horcrux_synopsis = "新晋海军大将绿牛的佩刀",
		res_id = "70531",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【禁憎森森】提升一级"
			},
			{
				20,
				"【强化+20】  【新晋大将】提升一级"
			},
			{
				30,
				"【强化+30】  【新生之芽】提升一级"
			},
			{
				35,
				"【强化+35】  【森森果实】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70529] = {
		quality = 5,
		bid = 70529,
		horcrux_desc = "杰尔马科技制作的战斗服。",
		horcrux_name = "战斗服",
		horcrux_synopsis = "杰尔马科技制作的战斗服。",
		res_id = "70529",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【火花·光拳】提升一级"
			},
			{
				20,
				"【强化+20】  【火花红】提升一级"
			},
			{
				30,
				"【强化+30】  【火花·双重·回旋】提升一级"
			},
			{
				35,
				"【强化+35】  【不灭之火】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70532] = {
		quality = 5,
		bid = 70532,
		horcrux_desc = "此刀会擅自释放使用者的“流樱”（霸气），超出控制的“猛斩”，普通剑士使用会精力被释放光而干枯的危险。",
		horcrux_name = "阎魔",
		horcrux_synopsis = "此刀会擅自释放使用者的“流樱”（霸气），超出控制的“猛斩”，普通剑士使用会精力被释放光而干枯的危险。",
		res_id = "70501",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【死·狮子歌歌】提升一级"
			},
			{
				20,
				"【强化+20】  【阿修罗】提升一级"
			},
			{
				30,
				"【强化+30】  【千八百烦恼风】提升一级"
			},
			{
				35,
				"【强化+35】  【阿修罗拔剑·亡者戏】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70541] = {
		quality = 5,
		bid = 70541,
		horcrux_desc = "槛槛果实能力者幻化的武器，被他击中自身将不受控制",
		horcrux_name = "黑槛",
		horcrux_synopsis = "槛槛果实能力者幻化的武器，被他击中自身将不受控制",
		res_id = "70501",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【黑色镣铐】提升一级"
			},
			{
				20,
				"【强化+20】  【黑槛战阵】提升一级"
			},
			{
				30,
				"【强化+30】  【袷羽槛】提升一级"
			},
			{
				35,
				"【强化+35】  【黑戟之印】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70542] = {
		quality = 5,
		bid = 70542,
		horcrux_desc = "比自然系还罕见的动物系“幻兽种”恶魔果实，食用者可以变为传说中的狼神“大口真神”，拥有非比寻常的强大力量！",
		horcrux_name = "犬犬果实",
		horcrux_synopsis = "比自然系还罕见的动物系“幻兽种”恶魔果实，食用者可以变为传说中的狼神“大口真神”，拥有非比寻常的强大力量！",
		res_id = "20514",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【冰牙】提升一级"
			},
			{
				20,
				"【强化+20】  【白蛇驱】提升一级"
			},
			{
				30,
				"【强化+30】  【雷鸣八卦】提升一级"
			},
			{
				35,
				"【强化+35】  【犬犬果实】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70543] = {
		quality = 5,
		bid = 70543,
		horcrux_desc = "被称为“BIG MOM”的夏洛特·玲玲利用“魂魂果实”的能力召唤而出的灵魂分身，其中“宙斯、拿破仑、普罗米修斯”的力量最为强大。",
		horcrux_name = "霍米兹",
		horcrux_synopsis = "被称为“BIG MOM”的夏洛特·玲玲利用“魂魂果实”的能力召唤而出的灵魂分身，其中“宙斯、拿破仑、普罗米修斯”的力量最为强大。",
		res_id = "50513",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【威国】提升一级"
			},
			{
				20,
				"【强化+20】  【魂魂果实】提升一级"
			},
			{
				30,
				"【强化+30】  【威国%霸海】提升一级"
			},
			{
				35,
				"【强化+35】  【四皇】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70544] = {
		quality = 5,
		bid = 70544,
		horcrux_desc = "和之国篇章路飞为索隆寻刀，短暂的拥有一段是时间二代鬼彻，但是路飞却不会用。",
		horcrux_name = "二代鬼彻",
		horcrux_synopsis = "和之国篇章路飞为索隆寻刀，短暂的拥有一段是时间二代鬼彻，但是路飞却不会用。",
		res_id = "70544",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【橡胶·火拳铳】提升一级"
			},
			{
				20,
				"【强化+20】  【武装色霸气】提升一级"
			},
			{
				30,
				"【强化+30】  【橡胶·象枪】提升一级"
			},
			{
				35,
				"【强化+35】  【流樱】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70545] = {
		quality = 5,
		bid = 70545,
		horcrux_desc = "尼治的急速耳机，带上耳机速度将大幅度提升",
		horcrux_name = "急速耳机",
		horcrux_synopsis = "尼治的急速耳机，带上耳机速度将大幅度提升",
		res_id = "70545",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【火花蓝·电击拳】提升一级"
			},
			{
				20,
				"【强化+20】  【火花蓝·隐身】提升一级"
			},
			{
				30,
				"【强化+30】  【起电·针刺】提升一级"
			},
			{
				35,
				"【强化+35】  【高速移动】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70546] = {
		quality = 5,
		bid = 70546,
		horcrux_desc = "本·贝克曼的来福枪，不知其威力，总之是一把来头很大的枪",
		horcrux_name = "来福枪",
		horcrux_synopsis = "本·贝克曼的来福枪，不知其威力，总之是一把来头很大的枪",
		res_id = "70546",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【枪斗乱打】提升一级"
			},
			{
				20,
				"【强化+20】  【沉着冷静】提升一级"
			},
			{
				30,
				"【强化+30】  【威慑射击】提升一级"
			},
			{
				35,
				"【强化+35】  【红发大副】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70547] = {
		quality = 5,
		bid = 70547,
		horcrux_desc = "世界最强的的男人—白胡子的专属佩刀，配合白胡子威震整片大海，无上大快刀十二工——丛云切",
		horcrux_name = "丛云切",
		horcrux_synopsis = "世界最强的的男人—白胡子的专属佩刀，配合白胡子威震整片大海，无上大快刀十二工——丛云切",
		res_id = "70547",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【一骑当千】提升一级"
			},
			{
				20,
				"【强化+20】  【时代的顶点】提升一级"
			},
			{
				30,
				"【强化+30】  【空破无双斩】提升一级"
			},
			{
				35,
				"【强化+35】  【传奇海贼】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70548] = {
		quality = 5,
		bid = 70548,
		horcrux_desc = "巴索罗缪·大熊的贴身书籍，从童年时期的《NINOKIN》到如今的《BIBLE》，这位魁梧的“暴君”始终手不释卷。",
		horcrux_name = "BIBLE",
		horcrux_synopsis = "世界最强的的男人—白胡子的专属佩刀，配合白胡子威震整片大海，无上大快刀十二工——丛云切",
		res_id = "70548",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【熊之冲击】提升一级"
			},
			{
				20,
				"【强化+20】  【和平主义者】提升一级"
			},
			{
				30,
				"【强化+30】  【阴愈伤弹】提升一级"
			},
			{
				35,
				"【强化+35】  【肉球果实】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70549] = {
		quality = 5,
		bid = 70549,
		horcrux_desc = "由乌索普为娜美量身定做的三截式武器，经过维莎利亚岛科学改造为“魔法天候棒”。看似普通，但是根据不同的组合，能够释放十余种绝招！",
		horcrux_name = "魔法天候棒",
		horcrux_synopsis = "由乌索普为娜美量身定做的三截式武器，经过维莎利亚岛科学改造为“魔法天候棒”。看似普通，但是根据不同的组合，能够释放十余种绝招！",
		res_id = "20505",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【热带低气压】提升一级"
			},
			{
				20,
				"【强化+20】  【气象知识】提升一级"
			},
			{
				30,
				"【强化+30】  【宙斯雷霆】提升一级"
			},
			{
				35,
				"【强化+35】  【草帽航海士】提升一级"
			}
		},
		sp_attrs = {}
	},
	[70550] = {
		quality = 5,
		bid = 70550,
		horcrux_desc = "以深海夜幕浸染的顶级天鹅绒为基底，缀以暗光流动的意大利真丝缎面领饰，每一寸剪裁如黄金比例铸就的铠甲，贴合战斗哲学家优雅而爆发的肌肉线条。双排鎏金荆棘纽扣暗藏ALL BLUE的航海图腾，后摆开衩似黑足腾空的凌厉轨迹——这是海上绅士献给世界的浪漫战书，在血色战场与烛光晚宴间永恒游刃有余。",
		horcrux_name = "紫色西装",
		horcrux_synopsis = "由乌索普为娜美量身定做的三截式武器，经过维莎利亚岛科学改造为“魔法天候棒”。看似普通，但是根据不同的组合，能够释放十余种绝招！",
		res_id = "70550",
		horcrux_id = {
			5,
			6,
			10
		},
		horcrux_effect = {
			{
				10,
				{
					{
						"skill",
						2451001
					}
				}
			},
			{
				20,
				{
					{
						"skill",
						2451002
					}
				}
			},
			{
				30,
				{
					{
						"skill",
						2452001
					}
				}
			},
			{
				35,
				{
					{
						"skill",
						2454001
					}
				}
			}
		},
		strengthen_effect_desc = {
			{
				10,
				"【强化+10】  【绞肉】提升一级"
			},
			{
				20,
				"【强化+20】  【基因改造】提升一级"
			},
			{
				30,
				"【强化+30】  【恶魔风脚】提升一级"
			},
			{
				35,
				"【强化+35】  【黑足】提升一级"
			}
		},
		sp_attrs = {}
	}
}

function Config.HorcruxData.data_partner_horcrux_fun(slot0)
	slot1 = Config.HorcruxData.data_partner_horcrux[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HorcruxData.data_partner_horcrux[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HorcruxData.data_horcrux_attr_length = 36
Config.HorcruxData.data_horcrux_attr = {
	[0] = {
		strengthen_desc = "",
		horcrux_id = 0,
		score = 536,
		num = 0,
		lev = 0,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				1,
				10
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				5000
			}
		},
		attr2 = {
			{
				"atk",
				500
			}
		},
		attr3 = {
			{
				"hp_max",
				5000
			}
		},
		attr4 = {
			{
				"atk",
				500
			}
		},
		attr5 = {
			{
				"hp_max",
				5000
			}
		},
		attr6 = {
			{
				"atk",
				500
			}
		},
		attr7 = {
			{
				"hp_max",
				5000
			}
		},
		attr8 = {
			{
				"atk",
				500
			}
		},
		attr9 = {
			{
				"tenacity",
				17
			}
		},
		attr10 = {
			{
				"dodge_magic",
				17
			}
		},
		attr11 = {
			{
				"dodge_rate",
				17
			}
		},
		attr12 = {
			{
				"def",
				25
			}
		},
		attr13 = {
			{
				"speed",
				15
			}
		},
		attr14 = {
			{
				"hit_rate",
				17
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 1,
		score = 536,
		num = 0,
		lev = 1,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				10
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				5000
			}
		},
		attr2 = {
			{
				"atk",
				500
			}
		},
		attr3 = {
			{
				"hp_max",
				5000
			}
		},
		attr4 = {
			{
				"atk",
				500
			}
		},
		attr5 = {
			{
				"hp_max",
				5000
			}
		},
		attr6 = {
			{
				"atk",
				500
			}
		},
		attr7 = {
			{
				"hp_max",
				5000
			}
		},
		attr8 = {
			{
				"atk",
				500
			}
		},
		attr9 = {
			{
				"tenacity",
				17
			}
		},
		attr10 = {
			{
				"dodge_magic",
				17
			}
		},
		attr11 = {
			{
				"dodge_rate",
				17
			}
		},
		attr12 = {
			{
				"def",
				25
			}
		},
		attr13 = {
			{
				"speed",
				15
			}
		},
		attr14 = {
			{
				"hit_rate",
				17
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 2,
		score = 593,
		num = 0,
		lev = 2,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				10
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				5640
			}
		},
		attr2 = {
			{
				"atk",
				540
			}
		},
		attr3 = {
			{
				"hp_max",
				5750
			}
		},
		attr4 = {
			{
				"atk",
				530
			}
		},
		attr5 = {
			{
				"hp_max",
				5540
			}
		},
		attr6 = {
			{
				"atk",
				570
			}
		},
		attr7 = {
			{
				"hp_max",
				5600
			}
		},
		attr8 = {
			{
				"atk",
				560
			}
		},
		attr9 = {
			{
				"tenacity",
				19
			}
		},
		attr10 = {
			{
				"dodge_magic",
				19
			}
		},
		attr11 = {
			{
				"dodge_rate",
				19
			}
		},
		attr12 = {
			{
				"def",
				30
			}
		},
		attr13 = {
			{
				"speed",
				20
			}
		},
		attr14 = {
			{
				"hit_rate",
				19
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 3,
		score = 655,
		num = 0,
		lev = 3,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				15
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				6280
			}
		},
		attr2 = {
			{
				"atk",
				590
			}
		},
		attr3 = {
			{
				"hp_max",
				6500
			}
		},
		attr4 = {
			{
				"atk",
				550
			}
		},
		attr5 = {
			{
				"hp_max",
				6070
			}
		},
		attr6 = {
			{
				"atk",
				630
			}
		},
		attr7 = {
			{
				"hp_max",
				6200
			}
		},
		attr8 = {
			{
				"atk",
				610
			}
		},
		attr9 = {
			{
				"tenacity",
				21
			}
		},
		attr10 = {
			{
				"dodge_magic",
				21
			}
		},
		attr11 = {
			{
				"dodge_rate",
				21
			}
		},
		attr12 = {
			{
				"def",
				35
			}
		},
		attr13 = {
			{
				"speed",
				25
			}
		},
		attr14 = {
			{
				"hit_rate",
				21
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 4,
		score = 733,
		num = 0,
		lev = 4,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				20
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				7240
			}
		},
		attr2 = {
			{
				"atk",
				650
			}
		},
		attr3 = {
			{
				"hp_max",
				7620
			}
		},
		attr4 = {
			{
				"atk",
				590
			}
		},
		attr5 = {
			{
				"hp_max",
				6870
			}
		},
		attr6 = {
			{
				"atk",
				730
			}
		},
		attr7 = {
			{
				"hp_max",
				7090
			}
		},
		attr8 = {
			{
				"atk",
				680
			}
		},
		attr9 = {
			{
				"tenacity",
				23
			}
		},
		attr10 = {
			{
				"dodge_magic",
				23
			}
		},
		attr11 = {
			{
				"dodge_rate",
				23
			}
		},
		attr12 = {
			{
				"def",
				43
			}
		},
		attr13 = {
			{
				"speed",
				30
			}
		},
		attr14 = {
			{
				"hit_rate",
				23
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 5,
		score = 857,
		num = 0,
		lev = 5,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				25
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				8840
			}
		},
		attr2 = {
			{
				"atk",
				760
			}
		},
		attr3 = {
			{
				"hp_max",
				9500
			}
		},
		attr4 = {
			{
				"atk",
				650
			}
		},
		attr5 = {
			{
				"hp_max",
				8190
			}
		},
		attr6 = {
			{
				"atk",
				890
			}
		},
		attr7 = {
			{
				"hp_max",
				8580
			}
		},
		attr8 = {
			{
				"atk",
				810
			}
		},
		attr9 = {
			{
				"tenacity",
				25
			}
		},
		attr10 = {
			{
				"dodge_magic",
				25
			}
		},
		attr11 = {
			{
				"dodge_rate",
				25
			}
		},
		attr12 = {
			{
				"def",
				51
			}
		},
		attr13 = {
			{
				"speed",
				35
			}
		},
		attr14 = {
			{
				"hit_rate",
				25
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 6,
		score = 977,
		num = 0,
		lev = 6,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				30
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				10440
			}
		},
		attr2 = {
			{
				"atk",
				860
			}
		},
		attr3 = {
			{
				"hp_max",
				11370
			}
		},
		attr4 = {
			{
				"atk",
				720
			}
		},
		attr5 = {
			{
				"hp_max",
				9520
			}
		},
		attr6 = {
			{
				"atk",
				1050
			}
		},
		attr7 = {
			{
				"hp_max",
				10080
			}
		},
		attr8 = {
			{
				"atk",
				940
			}
		},
		attr9 = {
			{
				"tenacity",
				27
			}
		},
		attr10 = {
			{
				"dodge_magic",
				27
			}
		},
		attr11 = {
			{
				"dodge_rate",
				27
			}
		},
		attr12 = {
			{
				"def",
				59
			}
		},
		attr13 = {
			{
				"speed",
				40
			}
		},
		attr14 = {
			{
				"hit_rate",
				27
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 7,
		score = 1143,
		num = 0,
		lev = 7,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				35
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				12680
			}
		},
		attr2 = {
			{
				"atk",
				1010
			}
		},
		attr3 = {
			{
				"hp_max",
				13990
			}
		},
		attr4 = {
			{
				"atk",
				800
			}
		},
		attr5 = {
			{
				"hp_max",
				11380
			}
		},
		attr6 = {
			{
				"atk",
				1270
			}
		},
		attr7 = {
			{
				"hp_max",
				12160
			}
		},
		attr8 = {
			{
				"atk",
				1120
			}
		},
		attr9 = {
			{
				"tenacity",
				29
			}
		},
		attr10 = {
			{
				"dodge_magic",
				29
			}
		},
		attr11 = {
			{
				"dodge_rate",
				29
			}
		},
		attr12 = {
			{
				"def",
				67
			}
		},
		attr13 = {
			{
				"speed",
				45
			}
		},
		attr14 = {
			{
				"hit_rate",
				29
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 8,
		score = 1329,
		num = 0,
		lev = 8,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				40
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				15240
			}
		},
		attr2 = {
			{
				"atk",
				1180
			}
		},
		attr3 = {
			{
				"hp_max",
				16980
			}
		},
		attr4 = {
			{
				"atk",
				900
			}
		},
		attr5 = {
			{
				"hp_max",
				13510
			}
		},
		attr6 = {
			{
				"atk",
				1530
			}
		},
		attr7 = {
			{
				"hp_max",
				14550
			}
		},
		attr8 = {
			{
				"atk",
				1320
			}
		},
		attr9 = {
			{
				"tenacity",
				31
			}
		},
		attr10 = {
			{
				"dodge_magic",
				31
			}
		},
		attr11 = {
			{
				"dodge_rate",
				31
			}
		},
		attr12 = {
			{
				"def",
				75
			}
		},
		attr13 = {
			{
				"speed",
				50
			}
		},
		attr14 = {
			{
				"hit_rate",
				31
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 9,
		score = 1536,
		num = 0,
		lev = 9,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10051,
				50
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				18120
			}
		},
		attr2 = {
			{
				"atk",
				1370
			}
		},
		attr3 = {
			{
				"hp_max",
				20350
			}
		},
		attr4 = {
			{
				"atk",
				1020
			}
		},
		attr5 = {
			{
				"hp_max",
				15900
			}
		},
		attr6 = {
			{
				"atk",
				1820
			}
		},
		attr7 = {
			{
				"hp_max",
				17230
			}
		},
		attr8 = {
			{
				"atk",
				1550
			}
		},
		attr9 = {
			{
				"tenacity",
				33
			}
		},
		attr10 = {
			{
				"dodge_magic",
				33
			}
		},
		attr11 = {
			{
				"dodge_rate",
				33
			}
		},
		attr12 = {
			{
				"def",
				83
			}
		},
		attr13 = {
			{
				"speed",
				55
			}
		},
		attr14 = {
			{
				"hit_rate",
				33
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 10,
		score = 2785,
		num = 0,
		lev = 10,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				10
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				21640
			}
		},
		attr2 = {
			{
				"atk",
				1600
			}
		},
		attr3 = {
			{
				"hp_max",
				24460
			}
		},
		attr4 = {
			{
				"atk",
				1150
			}
		},
		attr5 = {
			{
				"hp_max",
				18820
			}
		},
		attr6 = {
			{
				"atk",
				2170
			}
		},
		attr7 = {
			{
				"hp_max",
				20510
			}
		},
		attr8 = {
			{
				"atk",
				1830
			}
		},
		attr9 = {
			{
				"tenacity",
				35
			}
		},
		attr10 = {
			{
				"dodge_magic",
				35
			}
		},
		attr11 = {
			{
				"dodge_rate",
				35
			}
		},
		attr12 = {
			{
				"def",
				91
			}
		},
		attr13 = {
			{
				"speed",
				60
			}
		},
		attr14 = {
			{
				"hit_rate",
				35
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 11,
		score = 2038,
		num = 0,
		lev = 11,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				15
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				25160
			}
		},
		attr2 = {
			{
				"atk",
				1840
			}
		},
		attr3 = {
			{
				"hp_max",
				28580
			}
		},
		attr4 = {
			{
				"atk",
				1290
			}
		},
		attr5 = {
			{
				"hp_max",
				21750
			}
		},
		attr6 = {
			{
				"atk",
				2520
			}
		},
		attr7 = {
			{
				"hp_max",
				23800
			}
		},
		attr8 = {
			{
				"atk",
				2110
			}
		},
		attr9 = {
			{
				"tenacity",
				37
			}
		},
		attr10 = {
			{
				"dodge_magic",
				37
			}
		},
		attr11 = {
			{
				"dodge_rate",
				37
			}
		},
		attr12 = {
			{
				"def",
				99
			}
		},
		attr13 = {
			{
				"speed",
				65
			}
		},
		attr14 = {
			{
				"hit_rate",
				37
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 12,
		score = 2328,
		num = 0,
		lev = 12,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				20
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				29320
			}
		},
		attr2 = {
			{
				"atk",
				2110
			}
		},
		attr3 = {
			{
				"hp_max",
				33440
			}
		},
		attr4 = {
			{
				"atk",
				1450
			}
		},
		attr5 = {
			{
				"hp_max",
				25200
			}
		},
		attr6 = {
			{
				"atk",
				2940
			}
		},
		attr7 = {
			{
				"hp_max",
				27670
			}
		},
		attr8 = {
			{
				"atk",
				2440
			}
		},
		attr9 = {
			{
				"tenacity",
				39
			}
		},
		attr10 = {
			{
				"dodge_magic",
				39
			}
		},
		attr11 = {
			{
				"dodge_rate",
				39
			}
		},
		attr12 = {
			{
				"def",
				107
			}
		},
		attr13 = {
			{
				"speed",
				70
			}
		},
		attr14 = {
			{
				"hit_rate",
				39
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 13,
		score = 2644,
		num = 0,
		lev = 13,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				25
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				33800
			}
		},
		attr2 = {
			{
				"atk",
				2410
			}
		},
		attr3 = {
			{
				"hp_max",
				38680
			}
		},
		attr4 = {
			{
				"atk",
				1630
			}
		},
		attr5 = {
			{
				"hp_max",
				28920
			}
		},
		attr6 = {
			{
				"atk",
				3380
			}
		},
		attr7 = {
			{
				"hp_max",
				31850
			}
		},
		attr8 = {
			{
				"atk",
				2800
			}
		},
		attr9 = {
			{
				"tenacity",
				41
			}
		},
		attr10 = {
			{
				"dodge_magic",
				41
			}
		},
		attr11 = {
			{
				"dodge_rate",
				41
			}
		},
		attr12 = {
			{
				"def",
				115
			}
		},
		attr13 = {
			{
				"speed",
				75
			}
		},
		attr14 = {
			{
				"hit_rate",
				41
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 14,
		score = 2980,
		num = 0,
		lev = 14,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				30
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				38600
			}
		},
		attr2 = {
			{
				"atk",
				2730
			}
		},
		attr3 = {
			{
				"hp_max",
				44290
			}
		},
		attr4 = {
			{
				"atk",
				1810
			}
		},
		attr5 = {
			{
				"hp_max",
				32910
			}
		},
		attr6 = {
			{
				"atk",
				3860
			}
		},
		attr7 = {
			{
				"hp_max",
				36320
			}
		},
		attr8 = {
			{
				"atk",
				3180
			}
		},
		attr9 = {
			{
				"tenacity",
				43
			}
		},
		attr10 = {
			{
				"dodge_magic",
				43
			}
		},
		attr11 = {
			{
				"dodge_rate",
				43
			}
		},
		attr12 = {
			{
				"def",
				123
			}
		},
		attr13 = {
			{
				"speed",
				80
			}
		},
		attr14 = {
			{
				"hit_rate",
				43
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 15,
		score = 3357,
		num = 0,
		lev = 15,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				35
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				44040
			}
		},
		attr2 = {
			{
				"atk",
				3090
			}
		},
		attr3 = {
			{
				"hp_max",
				50660
			}
		},
		attr4 = {
			{
				"atk",
				2030
			}
		},
		attr5 = {
			{
				"hp_max",
				37420
			}
		},
		attr6 = {
			{
				"atk",
				4410
			}
		},
		attr7 = {
			{
				"hp_max",
				41390
			}
		},
		attr8 = {
			{
				"atk",
				3610
			}
		},
		attr9 = {
			{
				"tenacity",
				45
			}
		},
		attr10 = {
			{
				"dodge_magic",
				45
			}
		},
		attr11 = {
			{
				"dodge_rate",
				45
			}
		},
		attr12 = {
			{
				"def",
				131
			}
		},
		attr13 = {
			{
				"speed",
				85
			}
		},
		attr14 = {
			{
				"hit_rate",
				45
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 16,
		score = 3731,
		num = 0,
		lev = 16,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				40
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				49480
			}
		},
		attr2 = {
			{
				"atk",
				3440
			}
		},
		attr3 = {
			{
				"hp_max",
				57020
			}
		},
		attr4 = {
			{
				"atk",
				2240
			}
		},
		attr5 = {
			{
				"hp_max",
				41940
			}
		},
		attr6 = {
			{
				"atk",
				4950
			}
		},
		attr7 = {
			{
				"hp_max",
				46460
			}
		},
		attr8 = {
			{
				"atk",
				4050
			}
		},
		attr9 = {
			{
				"tenacity",
				47
			}
		},
		attr10 = {
			{
				"dodge_magic",
				47
			}
		},
		attr11 = {
			{
				"dodge_rate",
				47
			}
		},
		attr12 = {
			{
				"def",
				139
			}
		},
		attr13 = {
			{
				"speed",
				90
			}
		},
		attr14 = {
			{
				"hit_rate",
				47
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 17,
		score = 4154,
		num = 0,
		lev = 17,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				45
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				55560
			}
		},
		attr2 = {
			{
				"atk",
				3850
			}
		},
		attr3 = {
			{
				"hp_max",
				64130
			}
		},
		attr4 = {
			{
				"atk",
				2480
			}
		},
		attr5 = {
			{
				"hp_max",
				46990
			}
		},
		attr6 = {
			{
				"atk",
				5560
			}
		},
		attr7 = {
			{
				"hp_max",
				52130
			}
		},
		attr8 = {
			{
				"atk",
				4530
			}
		},
		attr9 = {
			{
				"tenacity",
				49
			}
		},
		attr10 = {
			{
				"dodge_magic",
				49
			}
		},
		attr11 = {
			{
				"dodge_rate",
				49
			}
		},
		attr12 = {
			{
				"def",
				147
			}
		},
		attr13 = {
			{
				"speed",
				95
			}
		},
		attr14 = {
			{
				"hit_rate",
				49
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 18,
		score = 4594,
		num = 0,
		lev = 18,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				50
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				61960
			}
		},
		attr2 = {
			{
				"atk",
				4270
			}
		},
		attr3 = {
			{
				"hp_max",
				71610
			}
		},
		attr4 = {
			{
				"atk",
				2730
			}
		},
		attr5 = {
			{
				"hp_max",
				52300
			}
		},
		attr6 = {
			{
				"atk",
				6200
			}
		},
		attr7 = {
			{
				"hp_max",
				58100
			}
		},
		attr8 = {
			{
				"atk",
				5040
			}
		},
		attr9 = {
			{
				"tenacity",
				51
			}
		},
		attr10 = {
			{
				"dodge_magic",
				51
			}
		},
		attr11 = {
			{
				"dodge_rate",
				51
			}
		},
		attr12 = {
			{
				"def",
				155
			}
		},
		attr13 = {
			{
				"speed",
				100
			}
		},
		attr14 = {
			{
				"hit_rate",
				51
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 19,
		score = 5055,
		num = 0,
		lev = 19,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10052,
				60
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				68680
			}
		},
		attr2 = {
			{
				"atk",
				4710
			}
		},
		attr3 = {
			{
				"hp_max",
				79470
			}
		},
		attr4 = {
			{
				"atk",
				2990
			}
		},
		attr5 = {
			{
				"hp_max",
				57880
			}
		},
		attr6 = {
			{
				"atk",
				6870
			}
		},
		attr7 = {
			{
				"hp_max",
				64360
			}
		},
		attr8 = {
			{
				"atk",
				5580
			}
		},
		attr9 = {
			{
				"tenacity",
				53
			}
		},
		attr10 = {
			{
				"dodge_magic",
				53
			}
		},
		attr11 = {
			{
				"dodge_rate",
				53
			}
		},
		attr12 = {
			{
				"def",
				163
			}
		},
		attr13 = {
			{
				"speed",
				105
			}
		},
		attr14 = {
			{
				"hit_rate",
				53
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 20,
		score = 7561,
		num = 0,
		lev = 20,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				10
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				76040
			}
		},
		attr2 = {
			{
				"atk",
				5200
			}
		},
		attr3 = {
			{
				"hp_max",
				88070
			}
		},
		attr4 = {
			{
				"atk",
				3270
			}
		},
		attr5 = {
			{
				"hp_max",
				64000
			}
		},
		attr6 = {
			{
				"atk",
				7610
			}
		},
		attr7 = {
			{
				"hp_max",
				71220
			}
		},
		attr8 = {
			{
				"atk",
				6160
			}
		},
		attr9 = {
			{
				"tenacity",
				55
			}
		},
		attr10 = {
			{
				"dodge_magic",
				55
			}
		},
		attr11 = {
			{
				"dodge_rate",
				55
			}
		},
		attr12 = {
			{
				"def",
				171
			}
		},
		attr13 = {
			{
				"speed",
				110
			}
		},
		attr14 = {
			{
				"hit_rate",
				55
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 21,
		score = 6067,
		num = 0,
		lev = 21,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				10
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				83390
			}
		},
		attr2 = {
			{
				"atk",
				5690
			}
		},
		attr3 = {
			{
				"hp_max",
				96680
			}
		},
		attr4 = {
			{
				"atk",
				3560
			}
		},
		attr5 = {
			{
				"hp_max",
				70110
			}
		},
		attr6 = {
			{
				"atk",
				8340
			}
		},
		attr7 = {
			{
				"hp_max",
				78080
			}
		},
		attr8 = {
			{
				"atk",
				6750
			}
		},
		attr9 = {
			{
				"tenacity",
				57
			}
		},
		attr10 = {
			{
				"dodge_magic",
				57
			}
		},
		attr11 = {
			{
				"dodge_rate",
				57
			}
		},
		attr12 = {
			{
				"def",
				179
			}
		},
		attr13 = {
			{
				"speed",
				115
			}
		},
		attr14 = {
			{
				"hit_rate",
				57
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 22,
		score = 6615,
		num = 0,
		lev = 22,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				15
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				91390
			}
		},
		attr2 = {
			{
				"atk",
				6220
			}
		},
		attr3 = {
			{
				"hp_max",
				106040
			}
		},
		attr4 = {
			{
				"atk",
				3870
			}
		},
		attr5 = {
			{
				"hp_max",
				76750
			}
		},
		attr6 = {
			{
				"atk",
				9140
			}
		},
		attr7 = {
			{
				"hp_max",
				85540
			}
		},
		attr8 = {
			{
				"atk",
				7390
			}
		},
		attr9 = {
			{
				"tenacity",
				59
			}
		},
		attr10 = {
			{
				"dodge_magic",
				59
			}
		},
		attr11 = {
			{
				"dodge_rate",
				59
			}
		},
		attr12 = {
			{
				"def",
				187
			}
		},
		attr13 = {
			{
				"speed",
				120
			}
		},
		attr14 = {
			{
				"hit_rate",
				59
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 23,
		score = 7184,
		num = 0,
		lev = 23,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				20
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				99710
			}
		},
		attr2 = {
			{
				"atk",
				6770
			}
		},
		attr3 = {
			{
				"hp_max",
				115760
			}
		},
		attr4 = {
			{
				"atk",
				4200
			}
		},
		attr5 = {
			{
				"hp_max",
				83660
			}
		},
		attr6 = {
			{
				"atk",
				9980
			}
		},
		attr7 = {
			{
				"hp_max",
				93290
			}
		},
		attr8 = {
			{
				"atk",
				8050
			}
		},
		attr9 = {
			{
				"tenacity",
				61
			}
		},
		attr10 = {
			{
				"dodge_magic",
				61
			}
		},
		attr11 = {
			{
				"dodge_rate",
				61
			}
		},
		attr12 = {
			{
				"def",
				195
			}
		},
		attr13 = {
			{
				"speed",
				125
			}
		},
		attr14 = {
			{
				"hit_rate",
				61
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 24,
		score = 7774,
		num = 0,
		lev = 24,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				25
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				108350
			}
		},
		attr2 = {
			{
				"atk",
				7340
			}
		},
		attr3 = {
			{
				"hp_max",
				125870
			}
		},
		attr4 = {
			{
				"atk",
				4530
			}
		},
		attr5 = {
			{
				"hp_max",
				90830
			}
		},
		attr6 = {
			{
				"atk",
				10840
			}
		},
		attr7 = {
			{
				"hp_max",
				101340
			}
		},
		attr8 = {
			{
				"atk",
				8740
			}
		},
		attr9 = {
			{
				"tenacity",
				63
			}
		},
		attr10 = {
			{
				"dodge_magic",
				63
			}
		},
		attr11 = {
			{
				"dodge_rate",
				63
			}
		},
		attr12 = {
			{
				"def",
				203
			}
		},
		attr13 = {
			{
				"speed",
				130
			}
		},
		attr14 = {
			{
				"hit_rate",
				63
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 25,
		score = 8405,
		num = 0,
		lev = 25,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				30
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				117630
			}
		},
		attr2 = {
			{
				"atk",
				7950
			}
		},
		attr3 = {
			{
				"hp_max",
				136720
			}
		},
		attr4 = {
			{
				"atk",
				4900
			}
		},
		attr5 = {
			{
				"hp_max",
				98540
			}
		},
		attr6 = {
			{
				"atk",
				11770
			}
		},
		attr7 = {
			{
				"hp_max",
				109990
			}
		},
		attr8 = {
			{
				"atk",
				9480
			}
		},
		attr9 = {
			{
				"tenacity",
				65
			}
		},
		attr10 = {
			{
				"dodge_magic",
				65
			}
		},
		attr11 = {
			{
				"dodge_rate",
				65
			}
		},
		attr12 = {
			{
				"def",
				211
			}
		},
		attr13 = {
			{
				"speed",
				135
			}
		},
		attr14 = {
			{
				"hit_rate",
				65
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 26,
		score = 9036,
		num = 0,
		lev = 26,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				35
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				126910
			}
		},
		attr2 = {
			{
				"atk",
				8560
			}
		},
		attr3 = {
			{
				"hp_max",
				147570
			}
		},
		attr4 = {
			{
				"atk",
				5260
			}
		},
		attr5 = {
			{
				"hp_max",
				106250
			}
		},
		attr6 = {
			{
				"atk",
				12700
			}
		},
		attr7 = {
			{
				"hp_max",
				118640
			}
		},
		attr8 = {
			{
				"atk",
				10220
			}
		},
		attr9 = {
			{
				"tenacity",
				67
			}
		},
		attr10 = {
			{
				"dodge_magic",
				67
			}
		},
		attr11 = {
			{
				"dodge_rate",
				67
			}
		},
		attr12 = {
			{
				"def",
				219
			}
		},
		attr13 = {
			{
				"speed",
				140
			}
		},
		attr14 = {
			{
				"hit_rate",
				67
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 27,
		score = 9713,
		num = 0,
		lev = 27,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				40
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				136830
			}
		},
		attr2 = {
			{
				"atk",
				9220
			}
		},
		attr3 = {
			{
				"hp_max",
				159170
			}
		},
		attr4 = {
			{
				"atk",
				5640
			}
		},
		attr5 = {
			{
				"hp_max",
				114480
			}
		},
		attr6 = {
			{
				"atk",
				13690
			}
		},
		attr7 = {
			{
				"hp_max",
				127890
			}
		},
		attr8 = {
			{
				"atk",
				11010
			}
		},
		attr9 = {
			{
				"tenacity",
				69
			}
		},
		attr10 = {
			{
				"dodge_magic",
				69
			}
		},
		attr11 = {
			{
				"dodge_rate",
				69
			}
		},
		attr12 = {
			{
				"def",
				227
			}
		},
		attr13 = {
			{
				"speed",
				145
			}
		},
		attr14 = {
			{
				"hit_rate",
				69
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 28,
		score = 10410,
		num = 0,
		lev = 28,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				45
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				147070
			}
		},
		attr2 = {
			{
				"atk",
				9900
			}
		},
		attr3 = {
			{
				"hp_max",
				171140
			}
		},
		attr4 = {
			{
				"atk",
				6040
			}
		},
		attr5 = {
			{
				"hp_max",
				122990
			}
		},
		attr6 = {
			{
				"atk",
				14710
			}
		},
		attr7 = {
			{
				"hp_max",
				137430
			}
		},
		attr8 = {
			{
				"atk",
				11820
			}
		},
		attr9 = {
			{
				"tenacity",
				71
			}
		},
		attr10 = {
			{
				"dodge_magic",
				71
			}
		},
		attr11 = {
			{
				"dodge_rate",
				71
			}
		},
		attr12 = {
			{
				"def",
				235
			}
		},
		attr13 = {
			{
				"speed",
				150
			}
		},
		attr14 = {
			{
				"hit_rate",
				71
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到12星",
		horcrux_id = 29,
		score = 11124,
		num = 0,
		lev = 29,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10053,
				50
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				157620
			}
		},
		attr2 = {
			{
				"atk",
				10590
			}
		},
		attr3 = {
			{
				"hp_max",
				183490
			}
		},
		attr4 = {
			{
				"atk",
				6450
			}
		},
		attr5 = {
			{
				"hp_max",
				131760
			}
		},
		attr6 = {
			{
				"atk",
				15770
			}
		},
		attr7 = {
			{
				"hp_max",
				147280
			}
		},
		attr8 = {
			{
				"atk",
				12660
			}
		},
		attr9 = {
			{
				"tenacity",
				73
			}
		},
		attr10 = {
			{
				"dodge_magic",
				73
			}
		},
		attr11 = {
			{
				"dodge_rate",
				73
			}
		},
		attr12 = {
			{
				"def",
				243
			}
		},
		attr13 = {
			{
				"speed",
				155
			}
		},
		attr14 = {
			{
				"hit_rate",
				73
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到13星",
		horcrux_id = 30,
		score = 14884,
		num = 0,
		lev = 30,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10054,
				10
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				168820
			}
		},
		attr2 = {
			{
				"atk",
				11330
			}
		},
		attr3 = {
			{
				"hp_max",
				196590
			}
		},
		attr4 = {
			{
				"atk",
				6890
			}
		},
		attr5 = {
			{
				"hp_max",
				141060
			}
		},
		attr6 = {
			{
				"atk",
				16890
			}
		},
		attr7 = {
			{
				"hp_max",
				157720
			}
		},
		attr8 = {
			{
				"atk",
				13550
			}
		},
		attr9 = {
			{
				"tenacity",
				75
			}
		},
		attr10 = {
			{
				"dodge_magic",
				75
			}
		},
		attr11 = {
			{
				"dodge_rate",
				75
			}
		},
		attr12 = {
			{
				"def",
				250
			}
		},
		attr13 = {
			{
				"speed",
				160
			}
		},
		attr14 = {
			{
				"hit_rate",
				75
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到13星",
		horcrux_id = 31,
		score = 13670,
		num = 0,
		lev = 31,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10054,
				20
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				195060
			}
		},
		attr2 = {
			{
				"atk",
				13070
			}
		},
		attr3 = {
			{
				"hp_max",
				227270
			}
		},
		attr4 = {
			{
				"atk",
				7910
			}
		},
		attr5 = {
			{
				"hp_max",
				162850
			}
		},
		attr6 = {
			{
				"atk",
				19510
			}
		},
		attr7 = {
			{
				"hp_max",
				182170
			}
		},
		attr8 = {
			{
				"atk",
				15640
			}
		},
		attr9 = {
			{
				"tenacity",
				80
			}
		},
		attr10 = {
			{
				"dodge_magic",
				80
			}
		},
		attr11 = {
			{
				"dodge_rate",
				80
			}
		},
		attr12 = {
			{
				"def",
				270
			}
		},
		attr13 = {
			{
				"speed",
				180
			}
		},
		attr14 = {
			{
				"hit_rate",
				80
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到13星",
		horcrux_id = 32,
		score = 15452,
		num = 0,
		lev = 32,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10054,
				30
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				221300
			}
		},
		attr2 = {
			{
				"atk",
				14800
			}
		},
		attr3 = {
			{
				"hp_max",
				257960
			}
		},
		attr4 = {
			{
				"atk",
				8940
			}
		},
		attr5 = {
			{
				"hp_max",
				184640
			}
		},
		attr6 = {
			{
				"atk",
				22130
			}
		},
		attr7 = {
			{
				"hp_max",
				206630
			}
		},
		attr8 = {
			{
				"atk",
				17730
			}
		},
		attr9 = {
			{
				"tenacity",
				85
			}
		},
		attr10 = {
			{
				"dodge_magic",
				85
			}
		},
		attr11 = {
			{
				"dodge_rate",
				85
			}
		},
		attr12 = {
			{
				"def",
				290
			}
		},
		attr13 = {
			{
				"speed",
				200
			}
		},
		attr14 = {
			{
				"hit_rate",
				85
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到13星",
		horcrux_id = 33,
		score = 17237,
		num = 0,
		lev = 33,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10054,
				40
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				247530
			}
		},
		attr2 = {
			{
				"atk",
				16540
			}
		},
		attr3 = {
			{
				"hp_max",
				288640
			}
		},
		attr4 = {
			{
				"atk",
				9960
			}
		},
		attr5 = {
			{
				"hp_max",
				206430
			}
		},
		attr6 = {
			{
				"atk",
				24760
			}
		},
		attr7 = {
			{
				"hp_max",
				231090
			}
		},
		attr8 = {
			{
				"atk",
				19820
			}
		},
		attr9 = {
			{
				"tenacity",
				90
			}
		},
		attr10 = {
			{
				"dodge_magic",
				90
			}
		},
		attr11 = {
			{
				"dodge_rate",
				90
			}
		},
		attr12 = {
			{
				"def",
				310
			}
		},
		attr13 = {
			{
				"speed",
				220
			}
		},
		attr14 = {
			{
				"hit_rate",
				90
			}
		}
	},
	{
		strengthen_desc = "需要英雄达到13星",
		horcrux_id = 34,
		score = 19018,
		num = 0,
		lev = 34,
		conds = {
			{
				"partner_star",
				5
			}
		},
		loss = {
			{
				10054,
				50
			}
		},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				273770
			}
		},
		attr2 = {
			{
				"atk",
				18270
			}
		},
		attr3 = {
			{
				"hp_max",
				319320
			}
		},
		attr4 = {
			{
				"atk",
				10980
			}
		},
		attr5 = {
			{
				"hp_max",
				228220
			}
		},
		attr6 = {
			{
				"atk",
				27380
			}
		},
		attr7 = {
			{
				"hp_max",
				255550
			}
		},
		attr8 = {
			{
				"atk",
				21910
			}
		},
		attr9 = {
			{
				"tenacity",
				95
			}
		},
		attr10 = {
			{
				"dodge_magic",
				95
			}
		},
		attr11 = {
			{
				"dodge_rate",
				95
			}
		},
		attr12 = {
			{
				"def",
				330
			}
		},
		attr13 = {
			{
				"speed",
				240
			}
		},
		attr14 = {
			{
				"hit_rate",
				95
			}
		}
	},
	{
		strengthen_desc = "",
		horcrux_id = 35,
		score = 24800,
		num = 0,
		lev = 35,
		conds = {},
		loss = {},
		replace_loss = {},
		target_partner_cost = {},
		attr1 = {
			{
				"hp_max",
				300000
			}
		},
		attr2 = {
			{
				"atk",
				20000
			}
		},
		attr3 = {
			{
				"hp_max",
				350000
			}
		},
		attr4 = {
			{
				"atk",
				12000
			}
		},
		attr5 = {
			{
				"hp_max",
				250000
			}
		},
		attr6 = {
			{
				"atk",
				30000
			}
		},
		attr7 = {
			{
				"hp_max",
				280000
			}
		},
		attr8 = {
			{
				"atk",
				24000
			}
		},
		attr9 = {
			{
				"tenacity",
				100
			}
		},
		attr10 = {
			{
				"dodge_magic",
				100
			}
		},
		attr11 = {
			{
				"dodge_rate",
				100
			}
		},
		attr12 = {
			{
				"def",
				350
			}
		},
		attr13 = {
			{
				"speed",
				260
			}
		},
		attr14 = {
			{
				"hit_rate",
				100
			}
		}
	}
}

function Config.HorcruxData.data_horcrux_attr_fun(slot0)
	slot1 = Config.HorcruxData.data_horcrux_attr[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HorcruxData.data_horcrux_attr[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.HorcruxData.data_fallback_reward_length = 35
Config.HorcruxData.data_fallback_reward = {
	{
		lev = 1,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				1,
				100
			}
		}
	},
	{
		lev = 2,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				7
			}
		}
	},
	{
		lev = 3,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				14
			}
		}
	},
	{
		lev = 4,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				24
			}
		}
	},
	{
		lev = 5,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				38
			}
		}
	},
	{
		lev = 6,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				56
			}
		}
	},
	{
		lev = 7,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				77
			}
		}
	},
	{
		lev = 8,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				101
			}
		}
	},
	{
		lev = 9,
		loss = {
			{
				37005,
				10
			}
		},
		reward = {
			{
				10051,
				129
			}
		}
	},
	{
		lev = 10,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			}
		}
	},
	{
		lev = 11,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				7
			}
		}
	},
	{
		lev = 12,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				17
			}
		}
	},
	{
		lev = 13,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				31
			}
		}
	},
	{
		lev = 14,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				49
			}
		}
	},
	{
		lev = 15,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				70
			}
		}
	},
	{
		lev = 16,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				94
			}
		}
	},
	{
		lev = 17,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				122
			}
		}
	},
	{
		lev = 18,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				154
			}
		}
	},
	{
		lev = 19,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				189
			}
		}
	},
	{
		lev = 20,
		loss = {
			{
				37005,
				20
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			}
		}
	},
	{
		lev = 21,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				7
			}
		}
	},
	{
		lev = 22,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				14
			}
		}
	},
	{
		lev = 23,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				24
			}
		}
	},
	{
		lev = 24,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				38
			}
		}
	},
	{
		lev = 25,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				56
			}
		}
	},
	{
		lev = 26,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				77
			}
		}
	},
	{
		lev = 27,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				101
			}
		}
	},
	{
		lev = 28,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				129
			}
		}
	},
	{
		lev = 29,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				161
			}
		}
	},
	{
		lev = 30,
		loss = {
			{
				37005,
				30
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				196
			}
		}
	},
	{
		lev = 31,
		loss = {
			{
				37005,
				50
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				196
			},
			{
				10054,
				7
			}
		}
	},
	{
		lev = 32,
		loss = {
			{
				37005,
				50
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				196
			},
			{
				10054,
				21
			}
		}
	},
	{
		lev = 33,
		loss = {
			{
				37005,
				50
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				196
			},
			{
				10054,
				42
			}
		}
	},
	{
		lev = 34,
		loss = {
			{
				37005,
				50
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				196
			},
			{
				10054,
				70
			}
		}
	},
	{
		lev = 35,
		loss = {
			{
				37005,
				50
			}
		},
		reward = {
			{
				10051,
				164
			},
			{
				10052,
				231
			},
			{
				10053,
				196
			},
			{
				10054,
				105
			}
		}
	}
}

function Config.HorcruxData.data_fallback_reward_fun(slot0)
	slot1 = Config.HorcruxData.data_fallback_reward[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.HorcruxData.data_fallback_reward[" .. slot0 .. "])not found")

		return
	end

	return slot1
end
