Config = Config or {}
Config.StarGiftData = Config.StarGiftData or {}
Config.StarGiftData.data_limit_gift_length = 23
Config.StarGiftData.data_limit_gift_cache = {}

function Config.StarGiftData.data_limit_gift(slot0)
	if Config.StarGiftData.data_limit_gift_cache[slot0] == nil then
		if not Config.StarGiftData.data_limit_gift_table[slot0] then
			return
		end

		if not loadstring(string.format("return %s", slot1))() then
			return
		end

		Config.StarGiftData.data_limit_gift_cache[slot0] = {
			id = slot1[1],
			name = slot1[2],
			gift_type = slot1[3],
			codition = slot1[4],
			reward = slot1[5],
			package_id = slot1[6],
			time = slot1[7],
			ico = slot1[8],
			res_1 = slot1[9],
			res_2 = slot1[10],
			desc = slot1[11]
		}
	end

	return Config.StarGiftData.data_limit_gift_cache[slot0]
end

Config.StarGiftData.data_limit_gift_table = {
	"{1, \"六星养成礼\", 1, {'star',6}, {{3,300},{1,3000000},{22,1500000},{10001,500}}, 202, 14400, 51, \"txt_cn_action_limit_gift_6\", \"\", \"恭喜你激活了6星英雄养成礼，是否前往购买？\"}",
	"{2, \"七星养成礼\", 1, {'star',7}, {{3,680},{1,5000000},{22,3500000},{10001,800}}, 203, 14400, 52, \"txt_cn_action_limit_gift_7\", \"\", \"恭喜你激活了7星英雄养成礼，是否前往购买？\"}",
	"{3, \"八星养成礼\", 1, {'star',8}, {{3,1280},{1,8000000},{22,6000000},{10001,1000}}, 204, 14400, 53, \"txt_cn_action_limit_gift_8\", \"\", \"恭喜你激活了8星英雄养成礼，是否前往购买？\"}",
	"{4, \"九星养成礼\", 1, {'star',9}, {{3,3280},{1,15000000},{22,8000000},{10450,2000}}, 205, 14400, 54, \"txt_cn_action_limit_gift_9\", \"\", \"恭喜你激活了9星英雄养成礼，是否前往购买？\"}",
	"{5, \"十星养成礼\", 1, {'star',10}, {{3,4480},{1,25000000},{22,12000000},{10450,3000}}, 206, 14400, 55, \"txt_cn_action_limit_gift_10\", \"\", \"恭喜你激活了10星英雄养成礼，是否前往购买？\"}",
	"{6, \"11星养成礼\", 1, {'star',11}, {{3,6480},{1,40000000},{22,20000000},{10450,3000}}, 207, 14400, 88, \"txt_cn_action_limit_gift_11\", \"\", \"恭喜你激活了11星英雄养成礼，是否前往购买？\"}",
	"{7, \"12星养成礼\", 1, {'star',12}, {{3,6480},{1,50000000},{22,15000000},{10001,10000}}, 208, 14400, 124, \"txt_cn_action_limit_gift_12\", \"\", \"恭喜你激活了12星英雄养成礼，是否前往购买？\"}",
	"{8, \"13星养成礼\", 1, {'star',13}, {{3,6480},{16202,4},{10460,15},{10450,10000}}, 209, 14400, 263, \"txt_cn_action_limit_gift_13\", \"\", \"恭喜你激活了13星英雄养成礼，是否前往购买？\"}",
	"{9, \"18级礼包\", 2, {'lev',18}, {{3,180},{10403,5},{10001,500},{38080,1},{10002,10},{10103,20},{1,800000},{22,500000}}, 211, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_18\", \"恭喜你激活了18级礼包，是否前往购买？\"}",
	"{10, \"48级礼包\", 2, {'lev',48}, {{3,680},{10403,20},{10001,2000},{38092,1},{37001,30},{10002,20},{1,1000000},{22,800000}}, 212, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_48\", \"恭喜你激活了48级礼包，是否前往购买？\"}",
	"{11, \"68级礼包\", 2, {'lev',68}, {{3,1280},{14001,3},{10403,15},{10453,2},{37002,1},{10,2000},{1,1000000},{22,500000}}, 213, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_68\", \"恭喜你激活了68级礼包，是否前往购买？\"}",
	"{12, \"78级礼包\", 2, {'lev',78}, {{3,1280},{14001,3},{10403,15},{10450,1000},{37002,1},{10,2000},{1,1000000},{22,500000}}, 214, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_78\", \"恭喜你激活了78级礼包，是否前往购买？\"}",
	"{13, \"88级礼包\", 2, {'lev',88}, {{3,3280},{14001,6},{10403,25},{10450,2000},{37002,3},{10,2000},{1,1000000},{22,500000}}, 215, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_88\", \"恭喜你激活了88级礼包，是否前往购买？\"}",
	"{14, \"98级礼包\", 2, {'lev',98}, {{3,3280},{14001,6},{10450,3000},{10040,100},{37002,1},{10,2000},{1,1000000},{22,500000}}, 216, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_98\", \"恭喜你激活了98级礼包，是否前往购买？\"}",
	"{15, \"108级礼包\", 2, {'lev',108}, {{3,3280},{10454,1},{10450,2000},{39502,1},{28,50},{10,2000},{1,1000000},{10001,500}}, 217, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_108\", \"恭喜你激活了108级礼包，是否前往购买？\"}",
	"{16, \"118级礼包\", 2, {'lev',118}, {{3,4480},{10454,1},{10450,3000},{39501,1},{28,200},{10,2000},{1,1000000},{10001,1000}}, 218, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_118\", \"恭喜你激活了118级礼包，是否前往购买？\"}",
	"{17, \"128级礼包\", 2, {'lev',128}, {{3,4480},{29906,50},{14001,8},{10450,5000},{28,200},{10,2000},{1,1000000},{10001,1000}}, 219, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_128\", \"恭喜你激活了128级礼包，是否前往购买？\"}",
	"{18, \"138级礼包\", 2, {'lev',138}, {{3,6480},{29906,50},{14001,15},{10450,8000},{28,300},{10,2000},{1,1000000},{10001,3000}}, 220, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_138\", \"恭喜你激活了138级礼包，是否前往购买？\"}",
	"{19, \"150级礼包\", 2, {'lev',150}, {{3,6480},{29906,50},{14001,15},{17211,52},{28,300},{10,2000},{1,1000000},{10001,10000}}, 221, 7200, 41, \"txt_cn_action_limit_gift_level\", \"action_limit_gift_level_150\", \"恭喜你激活了150级礼包，是否前往购买？\"}",
	"{20, \"超值神装包\", 3, {'holy_eqm',{1,2},{2,2}}, {{3,300},{10030,24},{1,1000000}}, 1001, 7200, 104, \"txt_cn_action_limit_gift_holyeqm\", \"\", \"恭喜你激活了超值神装礼包，是否前往购买？\"}",
	"{21, \"精英神装包\", 3, {'holy_eqm',{3,4},{2,2}}, {{3,680},{10030,58},{1,1000000}}, 1002, 7200, 104, \"txt_cn_action_limit_gift_holyeqm\", \"\", \"恭喜你激活了精英神装礼包，是否前往购买？\"}",
	"{22, \"豪华神装包\", 3, {'holy_eqm',{5,8},{2,2}}, {{3,1280},{10030,120},{1,1000000}}, 1003, 7200, 104, \"txt_cn_action_limit_gift_holyeqm\", \"\", \"恭喜你激活了豪华神装礼包，是否前往购买？\"}",
	"{23, \"尊享神装包\", 3, {'holy_eqm',{9,10},{2,2}}, {{3,3280},{10030,316},{1,1000000}}, 1004, 7200, 104, \"txt_cn_action_limit_gift_holyeqm\", \"\", \"恭喜你激活了尊享神装礼包，是否前往购买？\"}"
}
