Config = Config or {}
Config.RoomGrowData = Config.RoomGrowData or {}
Config.RoomGrowData.data_const_length = 5
Config.RoomGrowData.data_const = {
	open_lev_limit = {
		val = 55,
		key = "open_lev_limit",
		desc = "55级开启个成长之路"
	},
	bbs_open_limit = {
		val = 35,
		key = "bbs_open_limit",
		desc = "35级开启留言板功能"
	},
	bbs_time_limit = {
		val = 30,
		key = "bbs_time_limit",
		desc = "留言冷却时间（秒）"
	},
	bbs_writing_number = {
		val = 36,
		key = "bbs_writing_number",
		desc = "留言字数限制"
	},
	bbs_number_limit = {
		val = 300,
		key = "bbs_number_limit",
		desc = "每个留言板的最大留言数"
	}
}

function Config.RoomGrowData.data_const_fun(slot0)
	slot1 = Config.RoomGrowData.data_const[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.RoomGrowData.data_const[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.RoomGrowData.data_growth_way_desc_length = 229
Config.RoomGrowData.data_growth_way_desc_cache = {}

function Config.RoomGrowData.data_growth_way_desc(slot0)
	if Config.RoomGrowData.data_growth_way_desc_cache[slot0] == nil then
		if not Config.RoomGrowData.data_growth_way_desc_table[slot0] then
			return
		end

		if not loadstring(string.format("return %s", slot1))() then
			return
		end

		Config.RoomGrowData.data_growth_way_desc_cache[slot0] = {
			desc = slot1[1]
		}
	end

	return Config.RoomGrowData.data_growth_way_desc_cache[slot0]
end

Config.RoomGrowData.data_growth_way_desc_table = {
	[107003.0] = "{\"%s发现了你在竞技场中的英勇身姿，顿时表达了他的仰慕之情，这是你第100次被他人所膜拜哦~\"}",
	[115002.0] = "{\"你获得了第一位7星伙伴%s，随之而来的是更强大的属性和更高级的技能~\"}",
	[117201.0] = "{\"通关无尽试炼第%s关，你的实力也将如同这个试炼的名字一般，无尽增长。\"}",
	[118001.0] = "{\"获得了冠军赛32强的第%s名，再赢下一场，冠军之路将为你开启。\"}",
	[111401.0] = "{\"战力居然达到了%s，哪怕是你也不敢相信自己队伍已经成长到这个地步，\"}",
	[136001.0] = "{\"在第%s赛季的超凡段位赛中获得了第%s名，你的名字将永远铭刻在赛季传奇之上！\"}",
	[139101.0] = "{\"你在跨服竞技场获得了第%s名，纵使异域强者卡莉法立，你依旧是最耀眼的那个！\"}",
	[128002.0] = "{\"在跨服天梯中与众多异域高手对战后，你在跨服天梯中获得了第%s名，期待下一次的对决~\"}",
	[117003.0] = "{\"今天通过了无尽试炼第%s关，不过还远远不够呢，仍需继续前行！\"}",
	[138002.0] = "{\"冒险之旅中首次参与跨服竞技场，就获得了第%s名，期待你下一次的表现！\"}",
	[120301.0] = "{\"%s关注了你，这是你的第%s个粉丝。\"}",
	[121001.0] = "{\"成功将%s提升为10星，这是你成长之路上的又一重大突破。\"}",
	[120403.0] = "{\"%s在个人空间中关注了你，这是你的第%s个粉丝啦，你已经成为了冒险大陆上的明星了呢。\"}",
	[124001.0] = "{\"你成功挑战了霸气修炼的%s霸主之位，获得了神殿之光的照耀！\"}",
	[119101.0] = "{\"今天是你来到冒险大陆的第100天，你的最高战力达到%s，排名为第%s名，你的最强阵容是%s，一起变得更强吧！\"}",
	[122302.0] = "{\"你获得了第15位11星伙伴%s，有了更多强大的伙伴后，你将面临冒险大陆中的顶级战场了\"}",
	[116103.0] = "{\"经过15关的艰难战斗后，你终于通关了远征的困难模式\"}",
	[139103.0] = "{\"你在跨服竞技场获得了第%s名，在冒险大陆上，你已经拥有了一群并肩作战的最强伙伴。\"}",
	[127003.0] = "{\"你的%s领悟了%s，你已经迫不及待想去展现你的新实力了\"}",
	[130001.0] = "{\"你在跨服天梯中获得了第1名，从这里看下去，冒险大陆被你一览无余。\"}",
	[111352.0] = "{\"你的战力达到了%s，这片冒险大陆中能与你匹敌的对手已经了寥寥可数了\"}",
	[116002.0] = "{\"这一天，你和你的伙伴终于通过了英雄远征的普通模式，你已在渴望新的挑战了\"}",
	[118201.0] = "{\"在这一夜的冠军赛中获得第1名，尽情骄傲吧，你就是冠军！\"}",
	[113004.0] = "{\"你用力拍了拍自己的脸，无法相信%s这位5星英雄竟然可以从普通召唤中招募，真是运气爆棚的一天\"}",
	[135101.0] = "{\"你在超凡段位赛达到了闪耀尊师段位，持之以恒的战斗果然是必不可少的。\"}",
	[138001.0] = "{\"这是你首次参与跨服竞技场，获得了第%s名的成绩，你的表现真是令人瞩目呢。\"}",
	[107202.0] = "{\"%s在竞技场中膜拜了你，这是你第%s次被他人所仰慕，这大概就是“万人迷”吧。\"}",
	[115203.0] = "{\"成功将%s提升至9星，这是你的第一位9星伙伴。\"}",
	[118202.0] = "{\"你获得了冠军赛第一名，这一次，冠军称号只属于你！\"}",
	[115102.0] = "{\"你获得了第一位8星伙伴%s，随之而来的是更强大的属性和更高级的技能~\"}",
	[129002.0] = "{\"在跨服天梯中进入了前%s名，强者如卡莉法的天梯，也有了你的一席之地！\"}",
	[118003.0] = "{\"获得了冠军赛32强的第%s名，期待自己的下一次表现~\"}",
	[111501.0] = "{\"你的战力达到了%s，这一刻的你仿佛置身于众神之巅\"}",
	[139102.0] = "{\"你在跨服竞技场获得了第%s名，你的强大已经被异域的船长所传颂。\"}",
	[120101.0] = "{\"%s关注了你，这是你的第%s个粉丝，心里还有点小激动呢\"}",
	[101004.0] = "{\"一路磕磕绊绊，终于到达了%s级，继续出发吧，还有更多未知等你去探索~\"}",
	[117103.0] = "{\"随着一次次挑战，你通过了无尽试炼第%s关，这是你变强道路上最好的证明！\"}",
	[123302.0] = "{\"随着一道光芒闪过，你获得了第15个12星伙伴%s，连真正的神明也将畏惧你的力量\"}",
	[128003.0] = "{\"在跨服天梯中与各个异域船长对战后，你在跨服天梯中获得了第%s名，希望下次能继续前进。\"}",
	[131001.0] = "{\"在公会%s的第%s章副本中，伤害排名达到了第%s名。\"}",
	[109003.0] = "{\"加入了%s公会，会长是%s，能与公会成员一起聊天打Boss，不失为美好的事情。\"}",
	[117002.0] = "{\"通关无尽试炼第%s关，继续提升然后继续前进吧！\"}",
	[119201.0] = "{\"今天是你来到冒险大陆的第1个年，你的最高战力达到%s，排名为第%s名，你的最强阵容是%s，这里的一草一木你都已无比熟悉。\"}",
	[119401.0] = "{\"今天是你来到冒险大陆已经3年啦，你的最高战力达到%s，排名为第%s名，你的最强阵容是%s，这个世界已经离不开你了。\"}",
	[116203.0] = "{\"不断变强的对手却依然无法阻止你胜利的步伐，你通关了远征地狱模式，这便你的胜利之地！\"}",
	[113002.0] = "{\"这一天在基础召唤中获得了5星%s，能与神匹敌的大概只有你这种欧皇了吧？！\"}",
	[112002.0] = "{\"你在友情召唤中获得了5星%s，导致其他冒险家纷纷赶来吸取欧气。\"}",
	[122001.0] = "{\"经过长期的积累，你终于通过升星获得了第1个11星英雄%s。\"}",
	[112001.0] = "{\"今天在友情召唤中召唤出了5星%s，可能这就是友情的力量吧。\"}",
	[116102.0] = "{\"你通关了远征困难模式，“原来不过如此”，通关后的你如是想着·······\"}",
	[130002.0] = "{\"你在跨服天梯中获得了第1名，你登上天梯的顶峰，发现这里的景色是如此美丽\"}",
	[111502.0] = "{\"不可思议，你居然达到了%s战力，即使是神明也开始窥视你的力量！\"}",
	[128001.0] = "{\"在跨服天梯中和众多异域高手交锋后，你获得了第%s名，希望下一次能有所突破。\"}",
	[111452.0] = "{\"你不为超越别人，只为超越自己，达到%s战力的你心中只有两个字：最强！\"}",
	[121101.0] = "{\"%s，这是你第5个升星为10星的英雄，这一刻开始，你拥有了一队完整的10星英雄，开始朝着更高的方向迈进。\"}",
	[107302.0] = "{\"你的不败传闻流传在竞技场中，其中%s是你的第%s位仰慕者，不断地有船长慕名前来......\"}",
	[118103.0] = "{\"获得了冠军赛前八强的第%s名，再努力一把，冠军就是你的了。\"}",
	[107203.0] = "{\"%s在竞技场中膜拜了你，这是你第%s次被他人所仰慕，强者总能为万人所敬仰！\"}",
	[139001.0] = "{\"你在跨服竞技场获得了第%s名，希望下一次的自己还可以变得更强！\"}",
	[111351.0] = "{\"这一天，你的队伍战力达到了%s，你与伙伴们的进步连神明都开始惊叹起来\"}",
	[115202.0] = "{\"融合了无数英雄之后，终于获得了第一位9星伙伴%s，队伍的实力更加强大了。\"}",
	[129003.0] = "{\"在跨服天梯中进入了前%s名，接下来的目标就只有登顶了！\"}",
	[118002.0] = "{\"获得了冠军赛32强的第%s名，通往冠军的路上，你已经获得了通行证呢。\"}",
	[102004.0] = "{\"意外从艾斯（魂）处得知了使英雄变强的奥秘，你获得了第一个6星%s，相信自己一定能在冒险大陆中大展拳脚\"}",
	[117203.0] = "{\"不断地提升，不断地挑战，你终于通关了无尽试炼第%s关！\"}",
	[111252.0] = "{\"你的战力达到了%s，从此真正的进入到了强者的领域。\"}",
	[107001.0] = "{\"%s在竞技场中膜拜了你，这是你第%s次被他人所仰慕，继续加油~\"}",
	[111201.0] = "{\"战力达到了%s，即使冒险之旅有很多的艰难险阻，也没能阻挡你变强的渴望。\"}",
	[101003.0] = "{\"不知不觉就达到了%s级，你对未来的冒险之旅也越发期待了。\"}",
	[117102.0] = "{\"一天天地尝试，不断地向前，你终于通关了无尽试炼第%s关！\"}",
	[131002.0] = "{\"在公会%s的第%s章副本中，你的伤害排名达到排行第%s，这就是舍弃一切只求伤害的感觉吧\"}",
	[111151.0] = "{\"随着在冒险大陆的探险，在你和伙伴们的共同努力下，使战力顺利达到了%s。\"}",
	[111102.0] = "{\"你的队伍战力已经达到了%s，代表着你已经进入了资深船长的行列。\"}",
	[119301.0] = "{\"今天是你来到冒险大陆2年啦，时间过的真快呢。这时的你最高战力达到%s，排名为第%s名，最强阵容是%s。\"}",
	[111052.0] = "{\"随着在冒险大陆的不断磨练，你和你的伙伴达到了%s战力，相信自己会更加强大！\"}",
	[122101.0] = "{\"%s，这是你第5个升星为11星的英雄，带领着你的队伍继续向更高处前进吧。\"}",
	[111051.0] = "{\"经过一番磨练，你的战力达到了%s，相信自己会更加强大！\"}",
	[116202.0] = "{\"真正的强者拥有着挑战更强者的实力和勇气，就在今天，你做到了——通关远征地狱模式\"}",
	[111002.0] = "{\"经过一番磨合训练，你的冒险小队达到了%s战力，你已经迈出了变强的第一步！\"}",
	[111001.0] = "{\"你的队伍战力达到了%s，能和伙伴们探索冒险大陆更多的地方了呢\"}",
	[110003.0] = "{\"你创建了%s公会，与兄弟姐妹一起战斗打Boss的日子，指日可待喽。\"}",
	[130003.0] = "{\"你在跨服天梯中获得了第1名，能够坚守天梯的首席宝座，你的实力已经毋庸置疑。\"}",
	[110002.0] = "{\"你一拍脑门，创建了%s公会，相信自己的公会一定会在众多冒险公会中脱颖而出吧。\"}",
	[114201.0] = "{\"你通过了海底监狱第%s层，神明力量已经触手可及了\"}",
	[118203.0] = "{\"你获得了冠军赛第一名，这个夜晚，全城的人都已为你欢呼喝彩。\"}",
	[109002.0] = "{\"加入了%s公会，会长%s与其他成员将与你相互扶持，一起为最强公会的目标而努力！\"}",
	[108001.0] = "{\"获得了第5个五星伙伴%s，看来自己的冒险之旅会更加精彩了~\"}",
	[108003.0] = "{\"%s是你的第5个五星伙伴，在这么多强力伙伴的帮助下相信自己的冒险之旅会更加顺利\"}",
	[108002.0] = "{\"%s是你获得的第5个五星伙伴，往后的冒险多多关照哟！\"}",
	[118102.0] = "{\"获得了冠军赛前八强的第%s名，距离冠军只有一步之遥了。\"}",
	[135003.0] = "{\"超凡段位赛首次达到了钻石段位，下一个赛季，我们继续前进吧！\"}",
	[109001.0] = "{\"加入了%s公会，会长是%s，公会的荣耀将与你同在！\"}",
	[111402.0] = "{\"伴随你的战力达到了%s，你已经被其余船长视为那座不可逾越的巅峰。\"}",
	[107301.0] = "{\"%s在竞技场中膜拜了你，这是你第%s次被他人所仰慕，强者总能为万人所敬仰！\"}",
	[120201.0] = "{\"%s关注了你，这是你的第%s位粉丝。\"}",
	[107101.0] = "{\"%s在竞技场中膜拜了你，这是你第%s次被他人所仰慕，强者总能吸引追随者的脚步。\"}",
	[120103.0] = "{\"%s在个人空间中关注了你，这是你的第%s个粉丝。\"}",
	[117202.0] = "{\"通关无尽试炼第%s关，无尽试炼真的会如同名字一般永无止境吗？那就继续探索下去吧！\"}",
	[107201.0] = "{\"%s在竞技场中膜拜了你，这是你第%s次被他人所仰慕，你简直是竞技场中的不败神话！\"}",
	[107103.0] = "{\"你在竞技场受到了%s的膜拜，这是你第%s次被他人所仰慕，你已经是被众多船长所认可的强者了\"}",
	[112003.0] = "{\"你怀揣着好友的祝福，意外的招募到了五星%s，让你不得不感慨这是所谓友情的力量吧\"}",
	[131003.0] = "{\"在公会%s的第%s章副本中，伤害排行第%s，下一次，你还可以更强~\"}",
	[122201.0] = "{\"经年累月的积累，你终于获得了第10个11星英雄%s，自由搭配的战斗让你更加得心应手！\"}",
	[133001.0] = "{\"为英雄%s穿戴了全套%s星极品%s神装，令其实力越发强大了！\"}",
	[107102.0] = "{\"%s在竞技场中膜拜了你，这也是你第%s被他人膜拜，下一次，就是万人敬仰了！\"}",
	[119001.0] = "{\"今天是你来到冒险大陆的第30天，你的最高战力达到%s，排名为第%s名，你的最强阵容是%s，往后还要继续加油哦！\"}",
	[111202.0] = "{\"在经过一番辛苦磨练，终于达到了%s战力，你在强者之路上已越走越远.......\"}",
	[135002.0] = "{\"超凡段位赛首次达到了钻石段位，与强者对战果然是变强的方式之一呢。\"}",
	[103003.0] = "{\"结识了船长%s，以后的冒险之旅就一起结伴同行吧。\"}",
	[114002.0] = "{\"伴随着怪物的一阵哀嚎，你成功通过了海底监狱第%s层，别高兴的太早，真正的试炼才刚刚开始呢\"}",
	[137003.0] = "{\"一道光柱冲破云霄，你的%s向大陆宣示着又一件满级神技诞生。\"}",
	[107002.0] = "{\"%s在竞技场中膜拜了你，这是你第%s次被他人膜拜，未来的你还会有更多的崇拜者吧？\"}",
	[111251.0] = "{\"你的战力达到了%s，希望还有更强大的对手能让你挑战\"}",
	[106004.0] = "{\"经过一番激烈竞争，你获得了竞技场结算排行第%s名，你在冒险大陆中变得颇有名气了~\"}",
	[106001.0] = "{\"在竞技场结算后进入了前%s名，你已在船长中声名远扬了~\"}",
	[105004.0] = "{\"你来到了处于异域的冒险大陆，结识了一位名叫%s的异域好友，同时更多强大的冒险家让你大开眼界。\"}",
	[105001.0] = "{\"在冒险大陆上结识了第1个异域好友%s。\"}",
	[135203.0] = "{\"你以强大的战斗力和坚强的意志力，在超凡段位赛中达到了王者段位！\"}",
	[104004.0] = "{\"你发现了许多志同道合的船长，其中%s是你结识的第100位好友，在以后的冒险之旅中共同前行吧~\"}",
	[104001.0] = "{\"船长%s，这是你在冒险大陆上认识的第100个好友啦\"}",
	[113003.0] = "{\"这一天在基础召唤中获得了5星%s，连神也无法阻止你这位欧皇的脚步了。\"}",
	[120401.0] = "{\"%s关注了你，这是你的第%s位粉丝，可能这就是“万人迷”的魅力吧！\"}",
	[121002.0] = "{\"一道光芒自祭坛中闪过，你隐隐看见%s站在你面前，你获得了第一位10星伙伴， 祂将伴随你走向新的高峰\"}",
	[135001.0] = "{\"经过每日坚持不懈的挑战，你终于在超凡段位赛中达到了钻石段位。\"}",
	[120203.0] = "{\"%s在个人空间中关注了你，这是你的第%s个粉丝，自己快成为冒险大陆的名人了\"}",
	[103004.0] = "{\"初为船长的你结识了第一位好友%s，以后的冒险之旅相互帮助吧~\"}",
	[110001.0] = "{\"你创建了%s公会，与更多志同道合的船长一起去闯荡冒险大陆吧。\"}",
	[137002.0] = "{\"十年铸大器，百炼终成神。你的神技%s终于满级，至此达到了巅峰状态。\"}",
	[132001.0] = "{\"在公会%s与公会%s的公会战中达到了%s点战绩，公会排行第%s名，你已经是公会的顶梁柱了。\"}",
	[120102.0] = "{\"%s关注了你，你拥有了第%s个粉丝。看来下一个也不远啦。\"}",
	[122301.0] = "{\"经年累月的积累，你终于获得了第15个11星英雄%s，自由搭配的战斗让你更加得心应手！\"}",
	[103001.0] = "{\"在冒险大陆结识了第一个好友%s，有点小激动呢\"}",
	[123001.0] = "{\"经过长期的积累，你终于通过升星获得了第1个12星英雄%s。\"}",
	[111302.0] = "{\"你的战力达到了%s，你已经把其余强者远远甩在了后方。\"}",
	[135202.0] = "{\"超凡段位赛首次达到了王者段位，在王者赛中走向更远的前方吧！\"}",
	[102003.0] = "{\"你在一次探险中发现了融合的奥秘，%s也因此提升至6星，你获得了第一位6星伙伴\"}",
	[104003.0] = "{\"%s是你结识的第100个好友，以后的冒险之旅，就一起前行吧！\"}",
	[114102.0] = "{\"不知不觉，你已经来到了海底监狱第%s层，看着下方还在不断攀登的冒险家，你已经成为引领他们的存在了。\"}",
	[102002.0] = "{\"你意外发现了古老的祭坛，将%s提升至6星，这是你的第一个6星伙伴\"}",
	[102001.0] = "{\"首次将5星%s提升至6星，看来已经找到了逐渐变强的方法了。\"}",
	[101403.0] = "{\"达到了%s级，成为了传说级的冒险家，你的故事、你的伙伴、你的战绩、都将被铭记在这片冒险大陆中。\"}",
	[103002.0] = "{\"认识了同为船长的%s，并成为好友，约定一同闯荡冒险大陆！\"}",
	[122002.0] = "{\"这一天的祭坛发出古老的轰鸣声，原来是你将%s升到了11星，这也是你的第一位11星英雄\"}",
	[137001.0] = "{\"不知道使用了多少神技精石，你终于将神技%s提升到满级，冒险大陆的格局也许因此而改变。\"}",
	[101402.0] = "{\"船长等级终于达到了%s级，这一刻，你就是无可逾越的巅峰！\"}",
	[101401.0] = "{\"船长等级终于达到了%s级，你就是传说中的练级狂人吧？！\"}",
	[111451.0] = "{\"你的战力达到了%s，你的存在使得冒险大陆中的传说能够继续谱写。\"}",
	[139002.0] = "{\"你在跨服竞技场获得了第%s名，多亏自己可靠的伙伴们~\"}",
	[105003.0] = "{\"%s是你认识的第一位异域船长，你成功添加其为跨服好友。\"}",
	[121102.0] = "{\"这一天你获得了第5个10星英雄%s，你的冒险阵容已经愈发强大了\"}",
	[135201.0] = "{\"超凡段位赛首次达到了王者段位，实力与努力缺一不可，赞！\"}",
	[101303.0] = "{\"经过一番辛苦历练，你达到了%s级，你将继续前行，希望能看到更高处的风景\"}",
	[120303.0] = "{\"%s在个人空间中关注了你，是你的第%s位粉丝。\"}",
	[101301.0] = "{\"你跨越百级大关，让自己的船长等级提升至%s级，更广阔的世界等着你去征服。\"}",
	[101203.0] = "{\"不知不觉已经%s级了，前方仍有许多未知的冒险等着你。\"}",
	[101201.0] = "{\"达到了%s级，你已经是一位成熟的冒险家了，还有多少探险等着你呢？\"}",
	[101202.0] = "{\"你的船长等级终于达到了%s级。“接下来的目标是要成为最强吗”你如是想着。\"}",
	[120202.0] = "{\"%s是你拥有的第%s个粉丝，你在冒险大陆上已经小有名气啦。\"}",
	[101103.0] = "{\"你的船长等级终于达到了%s级，看着前方更多未知的探险，这场冒险之旅似乎越来越有趣了\"}",
	[101102.0] = "{\"这一天你达到了%s级，看着越来越多聚集在身边的小伙伴，这场冒险之旅也愈发有趣了~\"}",
	[123101.0] = "{\"%s，这是你第5个升星为12星的英雄，现在的你在大陆上已经罕有敌手了吧。\"}",
	[101101.0] = "{\"经过一番努力，船长等级达到了%s级，新的征途已经开启。\"}",
	[115001.0] = "{\"成功将%s提升至7星，这是你的第一位7星伙伴，看来每一次升星都是质的飞跃呢。\"}",
	[123002.0] = "{\"你的%s被能力觉醒纹石所环绕，随后爆发出一道强烈的光芒······你的第一位12星英雄由此诞生了\"}",
	[139003.0] = "{\"你在跨服竞技场获得了第%s名，期待下一次能挑战更强的对手~\"}",
	[111152.0] = "{\"新的冒险虽然更加艰险，但也伴随着实力的提升，达到%s战力就是你的最大收获。\"}",
	[114202.0] = "{\"每上一层都是那么的艰难，已经达到海底监狱第%s层的你，就快要接触到神明真正的力量！\"}",
	[101002.0] = "{\"你的船长等级终于达到了%s级，冒险之旅才刚刚开始。\"}",
	[101001.0] = "{\"经过你的一番努力，使自己的船长等级达到了%s级。\"}",
	[104002.0] = "{\"旅途中你认识了许多道同志合的船长，今天认识的%s，已经是你的第100个好友啦\"}",
	[122102.0] = "{\"随着你在冒险大陆中的不断成长，这一天你获得了第5个11星英雄%s，你已初具在冒险大陆中争霸一方的资格\"}",
	[100004.0] = "{\"这里是冒险大陆，一个充满机遇与挑战的地方。而你的冒险故事，也就此展开......\"}",
	[125001.0] = "{\"你给%s装备了超级战技，希望伙伴的实战能力能更加强大。\"}",
	[100003.0] = "{\"失落的遗迹、古老的神明之力。你的冒险之旅，从这一刻已经开启……\"}",
	[111101.0] = "{\"经过一番艰苦训练，你的队伍战力达到了%s，自己已经是一名资深船长啦\"}",
	[100002.0] = "{\"这是你来到冒险大陆的第一天，故事也将从这里开始……\"}",
	[106003.0] = "{\"位列竞技场结算排行前%s，你成为了船长中冉冉升起的一颗新星。\"}",
	[100001.0] = "{\"这是你第一次来到冒险大陆，神秘的未知正等着你去探索······\"}",
	[124101.0] = "{\"你成功挑战霸气修炼最高霸主之位，号称“最强生物”，巅峰强者的光芒已闪耀在大陆的每一处！\"}",
	[105002.0] = "{\"你的足迹开始走向了异域，你遇到了异域船长%s，并与其成为好友\"}",
	[116001.0] = "{\"你通关了远征普通模式，真是值得纪念的一天。\"}",
	[124002.0] = "{\"你成功挑战了霸气修炼的%s霸主之位，期待着这个霸主之位能够永远为你所有！\"}",
	[101302.0] = "{\"不知不觉已经%s级了，看来距离巅峰又近了一步了呢。\"}",
	[120302.0] = "{\"%s是你拥有的第%s个粉丝，你在冒险大陆上已经声名远扬了。\"}",
	[113001.0] = "{\"天啦撸，这一天竟然通过基础召唤获得了5星%s，这是神的眷顾吧！\"}",
	[132003.0] = "{\"在公会%s与公会%s的公会战中达到了%s点战绩，公会排行第%s名，你已经成为公会不可或缺的战力了。\"}",
	[123201.0] = "{\"你获得了第10个12星英雄%s，自由搭配的战斗让你更加得心应手！\"}",
	[115101.0] = "{\"成功将%s提升至8星，作为自己的第一位8星伙伴，你自己深深感受到祂的强大\"}",
	[123102.0] = "{\"你获得了第5个12星英雄%s，你的传奇阵容就此诞生了\"}",
	[126001.0] = "{\"你给%s装备了传说战技，希望伙伴的实力能有更大的飞跃\"}",
	[122202.0] = "{\"你获得了第10个11星伙伴%s，你已经可以游刃有余的对抗与你同阶的船长了\"}",
	[109004.0] = "{\"你加入了%s公会，会长%s相信在你和其他成员的共同努力下，公会将变得更加美好强大\"}",
	[117001.0] = "{\"通关无尽试炼第%s关，真正的试炼才刚刚开始。\"}",
	[125002.0] = "{\"你给%s装备了超级战技，希望合适的战技能让自己的伙伴如虎添翼。\"}",
	[132002.0] = "{\"在公会%s与公会%s的公会战中达到了%s点战绩，公会排行第%s名，公会缺你不可。\"}",
	[114001.0] = "{\"你通关了海底监狱第%s层，前方还有更强的对手在等着你。\"}",
	[134003.0] = "{\"首次超凡段位赛力压其他船长，达到了%s段位，你和你的英雄们已经为大陆强者所瞩目！\"}",
	[106002.0] = "{\"获得了竞技场结算后的第%s名，接下来只有一个目标，那就是最强！\"}",
	[116101.0] = "{\"你通关了远征困难模式，所谓英雄，便是在达到终点后仍渴望永无止境。\"}",
	[124102.0] = "{\"万人之上可称神，你成功挑战霸气修炼最高霸主之位，号称“最强生物”！\"}",
	[127001.0] = "{\"你拿出了保存多年的技能符石，成功使%s领悟了%s，至此实力更上一层了。\"}",
	[124003.0] = "{\"你成功挑战了霸气修炼的%s霸主之位，你的伙伴也变得更加强大了！\"}",
	[120402.0] = "{\"%s是你拥有的第%s个粉丝，你已成为冒险大陆中家喻户晓的存在。\"}",
	[123301.0] = "{\"你获得了第15个12星英雄%s，自由搭配的战斗让你更加得心应手！\"}",
	[110004.0] = "{\"经过一番思考，你创建了%s公会，希望能有更多志同道合的船长加入其中\"}",
	[123202.0] = "{\"你的伙伴们越来越强大，%s便是你的第10个12星英雄，自由搭配的战斗让你得心应手。\"}",
	[115201.0] = "{\"第一次将%s提升至9星，看来传闻中的10星也指日可待了。\"}",
	[126002.0] = "{\"你给%s装备了传说战技，希望合适的战技能够让伙伴发挥出200%%的实力。\"}",
	[115003.0] = "{\"成功将%s提升至7星，你获得了第一位7星伙伴，看来又是一次实力的飞跃。\"}",
	[134002.0] = "{\"首次参与超凡段位赛，达到了%s段位，你所能达到的高度真是令人期待呢！\"}",
	[136003.0] = "{\"在第%s赛季的超凡段位赛中获得了第%s名，期待你创造更辉煌的传奇！\"}",
	[117101.0] = "{\"通关无尽试炼第%s关，还需要继续努力哟！\"}",
	[111301.0] = "{\"你的战力达到了%s，你一定很用心的在提升你的英雄们呢\"}",
	[135103.0] = "{\"无数个日日夜夜的努力，你终于在超凡段位赛中达到了闪耀尊师段位！\"}",
	[114101.0] = "{\"你通过了海底监狱第%s层，此时你心中却只有一个声音：扶我起来，我还能继续！\"}",
	[116201.0] = "{\"你首次通关了远征的地狱模式，每一次远征，都是从零开始的征程！\"}",
	[134001.0] = "{\"在首次超凡段位赛中达到了%s段位，强者不鸣则已，一鸣惊人！\"}",
	[124103.0] = "{\"你成功挑战霸气修炼最高霸主之位，号称“最强生物”，你将被万人所敬仰，也将承受万人的挑战！\"}",
	[127002.0] = "{\"在你的努力下，你的%s终于领悟了%s，成神之路又近一步。\"}",
	[116003.0] = "{\"在经过15关的艰难战斗后，终于通关了远征的普通模式。\"}",
	[136002.0] = "{\"在第%s赛季的超凡段位赛中获得了第%s名，你的传奇将被大陆上的人们所传颂！\"}",
	[138003.0] = "{\"首次跨服竞技场获得了第%s名，下一次，你还可以更强的对吧？\"}",
	[135102.0] = "{\"你在超凡段位赛达到了闪耀尊师段位，迎接你的，是王者之路！\"}",
	[118101.0] = "{\"获得了冠军赛前八强的第%s名，看来实力与运气一样重要，继续加油吧\"}",
	[115103.0] = "{\"融合了无数英雄之后，终于获得了第一位8星伙伴%s，队伍的实力更加强大了。\"}",
	[126003.0] = "{\"你拿出了辛苦积攒获得的传说战技，并给%s装备上，希望自己的伙伴能够更加强大。\"}",
	[129001.0] = "{\"你在跨服天梯中进入了前%s名，冠军宝座，也尽在眼前了！\"}"
}
Config.RoomGrowData.data_carnival_length = 36
Config.RoomGrowData.data_carnival = {
	[123102.0] = 12,
	[102002.0] = 6,
	[122301.0] = 11,
	[115202.0] = 9,
	[123001.0] = 12,
	[122202.0] = 11,
	[102003.0] = 6,
	[121001.0] = 10,
	[115201.0] = 9,
	[102001.0] = 6,
	[115002.0] = 7,
	[122101.0] = 11,
	[115003.0] = 7,
	[122002.0] = 11,
	[108003.0] = 5,
	[121102.0] = 10,
	[108001.0] = 5,
	[123301.0] = 12,
	[115203.0] = 9,
	[123202.0] = 12,
	[115102.0] = 8,
	[123101.0] = 12,
	[122302.0] = 11,
	[115001.0] = 7,
	[123002.0] = 12,
	[122201.0] = 11,
	[122102.0] = 11,
	[122001.0] = 11,
	[108002.0] = 5,
	[121101.0] = 10,
	[123302.0] = 12,
	[121002.0] = 10,
	[115103.0] = 8,
	[123201.0] = 12,
	[115101.0] = 8,
	[102004.0] = 6
}

function Config.RoomGrowData.data_carnival_fun(slot0)
	slot1 = Config.RoomGrowData.data_carnival[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.RoomGrowData.data_carnival[" .. slot0 .. "])not found")

		return
	end

	return slot1
end
