Config = Config or {}
Config.GuildMarketplaceData = Config.GuildMarketplaceData or {}
Config.GuildMarketplaceData.data_const_length = 8
Config.GuildMarketplaceData.data_const = {
	open_lev = {
		val = 1,
		desc = "宝库开启所需公会等级"
	},
	guild_marketplace_sell_time = {
		val = 20,
		desc = "每个人每天能够售卖的次数"
	},
	guild_marketplace_borad_num = {
		val = 30,
		desc = "公告保存的条数"
	},
	guild_change_item_id = {
		val = 36,
		desc = "id"
	},
	chat_Interval_time = {
		val = 20,
		desc = "action_1 间隔时间"
	},
	change_action_time = {
		val = 20,
		desc = "action_1跳转action_2间隔时间"
	},
	action_keep_time1 = {
		val = 20,
		desc = "action_2保持时间"
	},
	action_keep_time2 = {
		val = 20,
		desc = "action_3保持时间"
	}
}

function Config.GuildMarketplaceData.data_const_fun(slot0)
	slot1 = Config.GuildMarketplaceData.data_const[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.GuildMarketplaceData.data_const[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.GuildMarketplaceData.data_item_info_length = 56
Config.GuildMarketplaceData.data_item_info_cache = {}

function Config.GuildMarketplaceData.data_item_info(slot0)
	if Config.GuildMarketplaceData.data_item_info_cache[slot0] == nil then
		if not Config.GuildMarketplaceData.data_item_info_table[slot0] then
			return
		end

		if not loadstring(string.format("return %s", slot1))() then
			return
		end

		Config.GuildMarketplaceData.data_item_info_cache[slot0] = {
			id = slot1[1],
			name = slot1[2],
			price = slot1[3],
			sell = slot1[4],
			radio = slot1[5],
			type = slot1[6],
			is_sell = slot1[7],
			is_pile = slot1[8],
			max_pile = slot1[9],
			capacity = slot1[10],
			end_time = slot1[11],
			is_board = slot1[12],
			day_buy = slot1[13]
		}
	end

	return Config.GuildMarketplaceData.data_item_info_cache[slot0]
end

Config.GuildMarketplaceData.data_item_info_table = {
	[10001.0] = "{10001, \"突破卡\", {{36,5}}, {{36,1}}, 50, 2, 1, 1, 49950, 15, 30, 1, 0}",
	[25901.0] = "{25901, \"乌索普碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[40210.0] = "{40210, \"魔灵护甲\", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}",
	[37001.0] = "{37001, \"探宝券\", {{36,3}}, {{36,1}}, 1, 2, 1, 1, 999, 15, 30, 1, 0}",
	[39047.0] = "{39047, \"随机符石礼包\", {{36,244}}, {}, 1, 2, 0, 1, 999, 15, 30, 1, 0}",
	[28904.0] = "{28904, \"黑胡子(新世界)碎片\", {{36,800}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}",
	[29105.0] = "{29105, \"5星海贼新星碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[27903.0] = "{27903, \"卡普碎片\", {{36,800}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}",
	[29205.0] = "{29205, \"5星草帽联盟碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[26906.0] = "{26906, \"月光莫利亚碎片\", {{36,750}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}",
	[26905.0] = "{26905, \"萨博（火拳）碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[26904.0] = "{26904, \"霍古巴克碎片\", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[24902.0] = "{24902, \"德雷克碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[26902.0] = "{26902, \"伊万科夫碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[25907.0] = "{25907, \"索隆(伟大航路)碎片\", {{36,750}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}",
	[40410.0] = "{40410, \"魔灵战靴\", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}",
	[25905.0] = "{25905, \"韦伯碎片\", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[40409.0] = "{40409, \"光辉战靴\", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[26907.0] = "{26907, \"龙马碎片\", {{36,12}}, {}, 1, 0, 0, 1, 999, 15, 30, 1, 0}",
	[40408.0] = "{40408, \"雷霆战靴\", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[25902.0] = "{25902, \"薇薇碎片\", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[40407.0] = "{40407, \"胜利战靴\", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40310.0] = "{40310, \"魔灵头盔\", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}",
	[40406.0] = "{40406, \"荣耀战靴\", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40309.0] = "{40309, \"光辉头盔\", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40405.0] = "{40405, \"冒险战靴\", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40308.0] = "{40308, \"雷霆头盔\", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40209.0] = "{40209, \"光辉护甲\", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40307.0] = "{40307, \"胜利头盔\", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[25900.0] = "{25900, \"弗兰奇碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[40306.0] = "{40306, \"荣耀头盔\", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[24909.0] = "{24909, \"艾尼路碎片\", {{36,750}}, {}, 50, 0, 0, 1, 49950, 15, 30, 1, 0}",
	[40305.0] = "{40305, \"冒险头盔\", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[24905.0] = "{24905, \"大悟碎片\", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[40208.0] = "{40208, \"雷霆护甲\", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[26903.0] = "{26903, \"闪电碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[40207.0] = "{40207, \"精致西装\", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40110.0] = "{40110, \"中将佩剑\", {{36,125}}, {}, 1, 1, 0, 1, 999, 15, 30, 1, 0}",
	[40206.0] = "{40206, \"荣耀护甲\", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40109.0] = "{40109, \"光辉战斧\", {{36,73}}, {{36,14}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40205.0] = "{40205, \"冒险护甲\", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40108.0] = "{40108, \"海军战刃\", {{36,43}}, {{36,8}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40107.0] = "{40107, \"胜利火炮\", {{36,25}}, {{36,5}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[40106.0] = "{40106, \"荣耀战刃\", {{36,15}}, {{36,3}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[26900.0] = "{26900, \"鳄鱼碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[40105.0] = "{40105, \"冒险之刃\", {{36,9}}, {{36,1}}, 1, 1, 1, 1, 999, 15, 30, 1, 0}",
	[10453.0] = "{10453, \"高级战技\", {{36,500}}, {}, 1, 3, 0, 0, 1, 15, 30, 1, 1}",
	[29905.0] = "{29905, \"5星随机碎片\", {{36,10}}, {}, 1, 0, 0, 1, 999, 15, 30, 1, 0}",
	[24908.0] = "{24908, \"冯克雷碎片\", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[25904.0] = "{25904, \"娜美(伟大航路)碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[29305.0] = "{29305, \"5星强者碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[24907.0] = "{24907, \"小丑巴基碎片\", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[25903.0] = "{25903, \"布鲁克碎片\", {{36,12}}, {{36,6}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[14001.0] = "{14001, \"强者招募令\", {{36,150}}, {}, 1, 2, 0, 1, 999, 15, 30, 1, 2}",
	[24906.0] = "{24906, \"贝拉米碎片\", {{36,10}}, {{36,5}}, 1, 0, 1, 1, 999, 15, 30, 1, 0}",
	[10403.0] = "{10403, \"高级召唤卷\", {{36,20}}, {}, 1, 2, 0, 1, 999, 15, 30, 1, 10}"
}
Config.GuildMarketplaceData.data_dic_item_info_length = 56
Config.GuildMarketplaceData.data_dic_item_info = {
	[24905.0] = 1,
	[25901.0] = 1,
	[25907.0] = 0,
	[28904.0] = 0,
	[29905.0] = 0,
	[25900.0] = 1,
	[29105.0] = 1,
	[40206.0] = 1,
	[29205.0] = 1,
	[40208.0] = 1,
	[40210.0] = 0,
	[40305.0] = 1,
	[24902.0] = 1,
	[40306.0] = 1,
	[40308.0] = 1,
	[40410.0] = 0,
	[40405.0] = 1,
	[40409.0] = 1,
	[26907.0] = 0,
	[40408.0] = 1,
	[40310.0] = 0,
	[40407.0] = 1,
	[26906.0] = 0,
	[40406.0] = 1,
	[40309.0] = 1,
	[27903.0] = 0,
	[26905.0] = 1,
	[39047.0] = 0,
	[40307.0] = 1,
	[10403.0] = 0,
	[26904.0] = 1,
	[10001.0] = 1,
	[40209.0] = 1,
	[37001.0] = 1,
	[26903.0] = 1,
	[10453.0] = 0,
	[40207.0] = 1,
	[40110.0] = 0,
	[26902.0] = 1,
	[40109.0] = 1,
	[40205.0] = 1,
	[40108.0] = 1,
	[40107.0] = 1,
	[40106.0] = 1,
	[26900.0] = 1,
	[40105.0] = 1,
	[24909.0] = 0,
	[25905.0] = 1,
	[24908.0] = 1,
	[25904.0] = 1,
	[29305.0] = 1,
	[24907.0] = 1,
	[25903.0] = 1,
	[14001.0] = 0,
	[24906.0] = 1,
	[25902.0] = 1
}

function Config.GuildMarketplaceData.data_dic_item_info_fun(slot0)
	slot1 = Config.GuildMarketplaceData.data_dic_item_info[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.GuildMarketplaceData.data_dic_item_info[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.GuildMarketplaceData.data_explain_length = 3
Config.GuildMarketplaceData.data_explain = {
	{
		id = 1,
		title = "基础规则",
		desc = "1.公会宝库为仅限同一公会成员进行操作的特殊公共商城，同一公会成员可在商城内进行购买或放入操作从而完成物品的间接共享  \n2.公会宝库内的商品作为公会的公共财产绑定于公会，不同公会的公会宝库内的商品也不同"
	},
	{
		id = 2,
		title = "商品来源",
		desc = [[
1.公会宝库的物品来源分为系统玩法产出和玩家自行放入两种        
2.系统玩法产出：部分公会玩法会产出特殊的公会宝库奖励，这部分奖励物品不会直接放入玩家的背包，而是放入公会宝库中成为可供玩家兑换的商品。目前会发放该种奖励的玩法如下：
<div fontcolor=#d95014>公会秘境
公会战</div>
3.玩家自行放入：公会宝库允许玩家放入特定的物品从而实现同一公会成员间物品的间接共享，每名玩家<div fontcolor=#d95014>每天</div>可以向宝库内放入<div fontcolor=#d95014>20</div>次物品。目前公会宝库允许放入的物品条目如下：
<div fontcolor=#d95014>德雷克碎片　　　大悟碎片
贝拉米碎片　　　小丑巴基碎片
冯克雷碎片　　　　弗兰奇碎片
乌索普碎片　　　薇薇碎片
布鲁克碎片　　　娜美(伟大航路)碎片
韦伯碎片　　　鳄鱼碎片
伊万科夫碎片　　　闪电碎片
霍古巴克碎片　　　　萨博（火拳）碎片
5星海贼新星碎片　  　　5星草帽联盟碎片
5星强者碎片　　  　冒险之刃
荣耀战刃　　　　　胜利火炮
海军战刃　　　　　光辉战斧
冒险护甲　　　　　荣耀护甲
精致西装　　　　　雷霆护甲
光辉护甲　　　　　冒险头盔
荣耀头盔　　　　　胜利头盔
雷霆头盔　　　　　光辉头盔
冒险战靴　　　　　荣耀战靴
胜利战靴　　　　　雷霆战靴
光辉战靴　　　　　突破卡
探宝券</div>
]]
	},
	{
		id = 3,
		title = "系统回收与存储上限",
		desc = "1.系统回收：宝库内的商品存在着<div fontcolor=#d95014>30</div>天的保存期限，达到保存期限后，对应的商品将会在次日的凌晨<div fontcolor=#d95014>5</div>点从公会宝库中移除  \n2.存储上限：宝库内不同种类的物品有着不同的存储上限，当某种物品的数量达到存储上限时，玩家将不能再向宝库内放入更多的该种物品"
	}
}

function Config.GuildMarketplaceData.data_explain_fun(slot0)
	slot1 = Config.GuildMarketplaceData.data_explain[slot0]

	if DATA_DEBUG and slot1 == nil then
		print("(Config.GuildMarketplaceData.data_explain[" .. slot0 .. "])not found")

		return
	end

	return slot1
end

Config.GuildMarketplaceData.data_landlady_info_length = 3
Config.GuildMarketplaceData.data_landlady_info = {
	{
		{
			action_id = 1,
			weight = 100,
			content = "不是随便什么东西都有资格放进宝库的！"
		},
		{
			action_id = 1,
			weight = 100,
			content = "看上心仪的宝物了？拿勇者凭证来换吧！"
		},
		{
			action_id = 1,
			weight = 100,
			content = "宝库会定期进行整理，不买可就没咯~"
		},
		{
			action_id = 1,
			weight = 100,
			content = "提醒你一下，放入物品是可以换取勇者凭证的"
		}
	},
	{
		{
			action_id = 2,
			weight = 100,
			content = "参加公会战可以获取勇者凭证，不去看看吗？"
		}
	},
	{
		{
			action_id = 3,
			weight = 100,
			content = ")"
		},
		{
			action_id = 3,
			weight = 100,
			content = "我要生气咯！"
		}
	}
}
